[{"text":"just came back from belton texas bellcountey near killen south of waco visitng my brother in fort hood. im back in sweden","time":1256360668},{"text":"Voted Y Known Speed Trap at 0.04 mi from intersection 761st Tank Battalion Ave and Hood Rd, Fort Hood http://trapster.com/_rAmR","time":1256400743},{"text":"Austin: Fort Hood Brigade transferred to Fort Knox http://bit.ly/sta7Q","time":1256492484},{"text":"RT @ArmyNewsNow: Brigade Moves From Fort Hood To Fort Knox http://tinyurl.com/yjw8xy7","time":1256501966},{"text":"RT @ArmyNewsNow: Brigade Moves From Fort Hood To Fort Knox http://tinyurl.com/yjw8xy7","time":1256502630},{"text":"Austin: Fort Hood Brigade transferred to Fort Knox http://bit.ly/sta7Q","time":1256504561},{"text":"Yeah Winn Dixie LOL what yall have?? When I was stationed @ Fort Hood I went to HEB RT @Lil_BitTee: @Highyella504 lol...the stores?","time":1256505583},{"text":"@sharinggarden My dad was stationed here in 73; 13th AF air liaison to Fort Hood so we lived there my senior year HS. I came to St Ed\u0027s, 74.","time":1256570599},{"text":"cant wait til friday. gonna be n arlington for a week. my vincent will b 8 yrs old on the 4th ben just put in for fort hood so cross fingers","time":1256595713},{"text":"@Kaydeb I think we\u0027re supposed to go to Fort Hood- wherever the heck that is!","time":1256693290},{"text":"Food, Beer, Games, Music... It Sounds Like Oktoberfest - dvids: FORT HOOD, Texas - Ahhh...the alluring smells c.. http://bit.ly/PIz1r","time":1256693054},{"text":"PT at Fort Hood Stadium, why the F$\u0026# are we still wearing our Daisy Duke PT shorts!!","time":1256724904},{"text":"New brigade helps fuel growth in, around Knox ...The brigade of about 3,400 troops is moving from Fort Hood,... http://bit.ly/HEE6Y","time":1256742761},{"text":"uh oh...done found a crossfit gym on fort hood...time to feel the pain...receive the results","time":1256815000},{"text":"2 Texans, 1 Fort Hood soldier dead in Afghanistan http://bit.ly/3CZkNG","time":1256848566},{"text":"2 Texans, 1 Fort Hood soldier dead in Afghanistan http://bit.ly/3IWAOT","time":1256851817},{"text":"College Football Con Fort Hood soliders attend Nebraska-Baylor game: Some 100 soliders from.. http://bit.ly/4bDLWs","time":1256934840},{"text":"TX News Fort Hood Soldier Hit And Killed By SUV: A Fort Hood soldier was attempting to cross a street Fr.. http://bit.ly/2aDFnr","time":1257025502}]
