[{"text":"I feel like parts of ice age 3 are similar to scenes I saw from avatar. Hmmm.","time":1255477893},{"text":"Watching ice age 3 for the six times....","time":1255487500},{"text":"It\u0027s like 65 and rainy in LA. This is the next ice age","time":1255482970},{"text":"I think a few of my brain cells committed suicide to escape Ice Age 3","time":1255478760},{"text":"Fever: Volcano burning on the inside, ice age hypothermia wrecking my body on the outside. *faints* http://myloc.me/11GaA","time":1255489605},{"text":"Was given a few movies today : Madagascar2, Pixar Collection, Ice Age 3, Dark Knight, Why Did I Get Married (someone stole my copy).","time":1255479778},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255491023},{"text":"Is Another Ice Age On The Way http://bit.ly/53e2a","time":1255496844},{"text":"@brettmikoll if your refering to Ice Age, you gotta see Cloudy With a Chance of Meatballs","time":1255500162},{"text":"win ice age 3 @tiarasandtantrums http://bit.ly/BcIyR","time":1255505637},{"text":"win ice age 3 @tiaras_tantrums http://bit.ly/BcIyR","time":1255505700},{"text":"It\u0027s amazing how Manny took courage today; He just stood at the shore of uncertainty and dove right in. Ice Age 2: The Meltdown","time":1255497414},{"text":"not having electricity due to stormy weather sucks! Like being in the ice age. Grr...","time":1255501829},{"text":"Ice Age - Box Set Teil 1-3 [Blu-ray] ab 34,95 Euro http://bit.ly/tlM3Q #heimkino #angebot","time":1255505584},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://bit.ly/WuvcO He follows back!","time":1255499677},{"text":"Nici dupa 20 de ani de experienta nu stii cind o poanta merge Mike Reiss coscenarist The Simpsons si Ice Age 3 http://tinyurl.com/yzasx3c","time":1255506333},{"text":"just finish watching ice age again. i love that movie \u003c3","time":1255510274},{"text":"http://twitpic.com/lh8fp - Eiszeit Ice Age","time":1255508043},{"text":"#sumotorrent - Download Ice Age 3 Dawn Of The Dinosaurs (2009) torrent: http://otne.ws/3504117","time":1255514038},{"text":"when i am looking through the window i see like new ice age comming... ... http://lnk.ms/1x3G0","time":1255511051},{"text":"Kidzworld\u0027s Ice Age: Dawn of the Dinosaurs Sweepstakes (ages 6-17) - 11/9/09 http://bit.ly/10OJ3m","time":1255518358},{"text":"Just watched Ice Age 3. Not as cool as the previous ones, but I had a lot of fun anyway.","time":1255521467},{"text":"Ice Age - Box Set Teil 1-3 [Blu-ray] ab 34,95 Euro @dvdregal http://bit.ly/tlM3Q #neuvorstellung #angebot #bestseller","time":1255507744},{"text":"Ice Age 3 was okay, next on my list are: Public Enemies, G.I. Joe, Harry Potter and the Half-Blood Prince, Orphan","time":1255512913},{"text":"Signature Club A By Retinol Wrinkle Penetrating Capsul: SERIOUS SKIN CARE ICE AGE WRINKLE CREAM WITH BEAU.. http://bit.ly/sE0k4","time":1255516711},{"text":"strange i only got 4 hrs of sleep last nite so i shud be sound alseep right now, im way past tired watchin ice age movie in bed until i KO.","time":1255508221},{"text":"ending my bad day with dinner and ice age 3","time":1255524702},{"text":"it\u0027s like the fucking ice age outside and you\u0027re wearinh SHORTS?","time":1255528785},{"text":"@bartbarber I think concerns about entering another ice age are more rational than AGW ones. We\u0027re overdue for an ice age, and AGW may help","time":1255529061},{"text":"@bobbyboucher59: comin to the stage we got the squirrel from off of ice age -----*Suicide*-----","time":1255521810},{"text":"is cuddled up on the couch with anna grace watching Ice Age..brr ... http://lnk.ms/3MdFT","time":1255522857},{"text":"@MrTeller It\u0027s interesting that there is never any discussion of the little ice age in the 12th century and that we may just be on a warm up","time":1255528627},{"text":"The Coming Ice Age - the real threat to humanity... http://bit.ly/uczY8 #tcot #ocra @glennbeck","time":1255532391},{"text":"If the temperature increases by 2degrees the gulf stream will cease flowing and we will enter an ice age in the uk............TRULY TRUE","time":1255535925},{"text":"RT @Drudge_Report Montana records fall... http://tinyurl.com/yja3hmw \u003c\u003eSomeone wake Al Gore and tell him we\u0027re in a new Ice Age... #tcot","time":1255525559},{"text":"The high tomorrow is 47. The average high for December in Fredericksburg is 44. ICE AGE","time":1255548207},{"text":"$10.26 (24.6% drop) Ice Age - The Meltdown (Widescreen Edition) http://rsstalker.com/g/1270420","time":1255548528},{"text":"Ice Age: Dawn of the Dinosaurs: Ice Age: Dawn of the Dinosaurs opens with the stitched-together prehistoric fam.. http://tinyurl.com/yza5ptg","time":1255536915},{"text":"@brendanguyen nice choice, mines a tie between the sloth from Ice Age or Jasmin\u0027s dad LOL","time":1255538755},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255537562},{"text":"We are over due for the next ice age. We better global warming is true or we will face real problems.","time":1255543182},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255545513},{"text":"RT @Rxrthepoet: @brandootr His ideas r gonna send us back 2 ice age.//But then all the pretty glaciers wouldn\u0027t be meltin\u0027\u003d\u003eThyr movin HERE!","time":1255543213},{"text":"Ice Age Dawn Of The Dinosaurs[2009]DvDrip Nice Rip Dont Miss it: Ice Age Dawn Of The http://bit.ly/6Jvf","time":1255560440},{"text":"Surviving Sid  Ice Age Short BRRip: Surviving Sid  Ice Age Short BRRip Sid the Sloth, a hilarious co-star i.. http://bit.ly/4Ekk7G","time":1255551634},{"text":"Sitting in the previews for Ice Age 3 w/ ElijahtheBoyWarrior, eating hamdogs as he calls hotdogs. Love my kid! .","time":1255553960},{"text":"@LordDad ah i know how you feel mate last one i saw in cinema was ice age 3 haha","time":1255555991},{"text":"@ckatana At the rate we are going, it\u0027ll be the ice age in freaking December. And I don\u0027t even own a pelt!","time":1255556985},{"text":"At tutoring w adelaide and we\u0027re learning about the ice age, with a focus on Europe from 1300-1850. Very interesting!","time":1255557655},{"text":"Sorry for the foul language, but why the F is it so COLD out??? Methinks the next ice age is looming!","time":1255560902},{"text":"At tutoring w adelaide and we\u0027re learning about the ice age, with a focus on Europe from 1300-1850. Very interesting!","time":1255563421},{"text":"Heylow ppl, @ school watching ice age 3. Kinda boring here\u0026 I feel sick 2day. Huhuhu anyway 2day is the last day for the exams! Wohooow","time":1255564624},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255553224},{"text":"@Laelaps Amen. Also, um, if I recall correctly dinosaurs (and pterosaurs) didn\u0027t die out in the Ice Age. Minor details you know....","time":1255562712},{"text":"sick :( YAY my tonsils coming out in 3 weeks!! I cant wait!!!!! :D:D:D YAYYYY! watching ice age 2 :P i love miley c ... http://lnk.ms/3Pmpj","time":1255563884},{"text":"i just put ice age on to watch:)","time":1255574825},{"text":"The baby from ice age My weapon is love","time":1255571664},{"text":"ICE AGE: DAWN OF THE DINOSAURS with RAY ROMANO http://moodbase.com/43GRSK","time":1255572129},{"text":"ICE AGE: DAWN OF THE DINOSAURS with RAY ROMANO http://moodbase.com/43GRSK","time":1255572129},{"text":"@officialTila It\u0027s called a meteor shower. And the ice age. Fucking hell.","time":1255576493},{"text":"I\u0027ve brought out my romantic side for you, I\u0027ve melted away the ice age that used to protect my heart.. and what for?","time":1255565195},{"text":"Syd from ice age RT @TAJrani: He looks like a sloth. I agree. RT @CourtneyxxLove: Drake is so fugly.","time":1255567719},{"text":"RT @Videobusiness: Ice Age: Dawn of the Dinosaurs is being promoted along with adoption PSAs http://tinyurl.com/ylen4bu","time":1255568674},{"text":"October is Washington State Archaeology month! Speakers at Burke Museum discuss how archaeologists understand Ice Age | http://bit.ly/2kcVds","time":1255567494},{"text":"So I missed the most of the awards last night but I have 2say this..4 those of u that have C\u0027n Ice Age--Ja rule looks like sid the sloth!!!","time":1255570884},{"text":"Postare noua : Gheata,ice age romanesc: A nins putin,si deja e jale in tara.Pe langa frig alt luc.. http://bit.ly/13rzFx","time":1255576521},{"text":"*DIES*RT @PongSanity @mrmakesitsoeasy is bored from RT-ing he is now watching ice age to learn the rite way Of how a squirrel can\u0027t get a nu","time":1255577932},{"text":"ice age 3,dawn of the dinosaurs..","time":1255587257},{"text":"and now it\u0027s time for Ice Age 3..","time":1255592280},{"text":"Watching Ice Age 3 after a fabulous yesterday with the cousins.","time":1255581119},{"text":"watching ice age, reading poetry, eating a fruit roll up, and sleeping. yep.","time":1255579762},{"text":"@simonpegg I\u0027m watching ice age 3 and just recognized you as Buck!! As always, you are awesome!! \u003c3","time":1255581527},{"text":"@nosuchuser how\u0027s the Ice Age working out for you, then? :)","time":1255582537},{"text":"Ice Age Dawn Of The Dinosaurs[2009]DvDrip Nice Rip Dont Miss it: Ice Age Dawn Of The Dinosaurs[2009]DvDrip Nice.. http://bit.ly/4pTX91","time":1255582303},{"text":"Gurls is like that squirrel off of that Ice Age movie... Just crazy for the nuts... lmao ... http://lnk.ms/20TSN","time":1255584230},{"text":"Ice Age Dawn Of The Dinosaurs[2009]DvDrip Nice Rip Dont Miss it http://bit.ly/1fT054","time":1255585562},{"text":"vazut Harry Potter and the Half-Blood Prince, slab, pentru mine, in 2009, Ice Age 3 ramane singura continuare reusita","time":1255588643},{"text":"@enostarr @Affelly @sleepingbeast okay i am so outdated when it comes to movies. kesian eh. aku balum liat drag me to hell sama ice age 3 ah","time":1255580378},{"text":"Rob Zombie you the man! Now back at my girls house mother-in-law and bro is asleep. Now were watching Ice Age then sleep time I\u0027m hungry :)","time":1255586074},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://bit.ly/WuvcO He follows back!","time":1255587651},{"text":"ust entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://bit.ly/WuvcO He follows back!","time":1255590273},{"text":"You\u0027d have though that Ice-caps are melting would have gone hand in hand with The Ice Age has ended. Scientists seem confused.","time":1255592001},{"text":"@newpct Ice Age 3 [DVDRIP][Spanish LINE][2009], disponible en: http://tinyurl.com/yj8y9dl","time":1255595895},{"text":"Freezing. Jeez, did Connecticut go through an ice age while I was gone?","time":1255597184},{"text":"Good morning. This is global warming. ...this is the precurser to the Ice Age. We\u0027ll see what happens in 7 years - some golf \u003c-- LMAO","time":1255606978},{"text":"@AttilaBS If we didn\u0027t do anything, we\u0027d only be heading towards another ice age, not the destruction of Mother Earth.","time":1255599004},{"text":"had fun with my hunny last night!We watched Charlie Brown-great pumpkin and Ice Age-dawn of the dinosaurs..\u0026he cook ... http://lnk.ms/20hHf","time":1255598014},{"text":"RT @TikahY: @sleepingbeast aku mau ice age 3!! heheh. eh kau ikut jua flash mob? Lagu ku kira kau main bola tu. -ikut lah. breakdance kau :P","time":1255603807},{"text":"why does it feel like the damn ice age i need longjons thigh high socks and some oreo cookies","time":1255611533},{"text":"Loving the feeling that were about to enter a second ice age. NY snow in oct, 78 in Miami?! Bring it on.","time":1255614779},{"text":"reading from the year 1972 @time Another Ice Age? triple phooey! http://bit.ly/TqCni","time":1255620230},{"text":"ICE AGE 3 @ DA DOLLA CINEMA... GOTTA SEE IT ON DA BIG SCREEN... (LOVEMYLIFE.COM SHOULD B MINE) ... http://lnk.ms/3RJMW","time":1255611089},{"text":"I think we are leaving out of the last ice age that\u0027s why things are getting warmer... Damn we need another big freeze.","time":1255612761},{"text":"sna r filmdjungelns konung: I samband med att familjefilmen Ice Age 3 intar biograferna, har LOVEFiLM bett ve.. http://twurl.nl/uwjpnb","time":1255613890},{"text":"1978s The Coming Ice Age Starring climate kook profiteer and fraudulent scam artist, junk .. http://bit.ly/eWN3C","time":1255616117},{"text":"Meat balls: Mood swing like UP, better 3D than Gforce, kinda funny..not hurt to watch, but don\u0027t expect it in the same league as Ice Age.","time":1255613536},{"text":"FORGET GLOBAL WARMING  WERE HEADING FOR AN ICE AGE!: By Charles Gardner and Nick Thompson MPs expenses are n.. http://bit.ly/LBXGo","time":1255616364},{"text":"Listening to Hot Protestants, reminds me of current Mock Orange. Listen to Sad About the Ice Age. http://bit.ly/3BQcal","time":1255634444},{"text":"BLUE DOGS SAY WHY CANT WE OPEN UP MEDICARE! NO GUYS WE NEED 2 TRILLION MORE DEBT TO TAX AMERICANS INTO THE ICE AGE..YOUR MONEY IS SHARED!","time":1255629910},{"text":"I am thinking the ice age must be coming to NY","time":1255638843},{"text":"Watching Ice Age with @emmiedanza. Its pretty sureal","time":1255648814},{"text":"@bigolerig i respect your opinion. ice age fucking rules","time":1255643112},{"text":"It\u0027s really freezing outside. Ice age is coming and 2012 is ready to happen.","time":1255649631},{"text":"Making another Twilight spoof, this time upon request. Coming Soon: Twilight and Ice Age.","time":1255642046},{"text":"@stead3408 im watching ice age, which i strongly believe comes in a close second","time":1255642673},{"text":"Heading of to Cinema to watch Ice Age 3 with my little godchild. This will be fun... http://ff.im/-4UbBU ...","time":1255643265},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255639394},{"text":"@Savanpl I know, right? Next they\u0027ll blame the previous Ice Age, the Lindbergh kidnapping, and solar flares on him. Him or Bill Clinton.","time":1255643486},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255649746},{"text":"Big kid night of feelgood comedys Ice Age 2.I have no shame that I like these kind of films I may have to watch Finding Nemo next lol","time":1255646931},{"text":"Ah, global cooling. I was promised global warming -- dammit, why can\u0027t we have the Medieval warming period back, not Little Ice Age? Dammit.","time":1255647820},{"text":"Win Ice Age 3 at Tiaras and Tantrums http://bit.ly/BcIyR","time":1255653930},{"text":"climate science: 1970\u0027s FILM DISCUSSES THE COMING ICE-AGE #news","time":1255662486},{"text":"@earthintelnet Isn\u0027t the opposite of the Ice Age, Global Warming? It\u0027s all cyclic.","time":1255664722},{"text":"Ice.Age.Dawn.of.the.Dinosaurs.2009.R1.NTSC.DVDR-BULLDOZER: *Ice.Age.Dawn.of.the.Dinosaurs.2009.R1.NTSC.DVDR-BULL.. http://bit.ly/Ixdyf","time":1255656997},{"text":"Hurdles overcome - West Linn gets new Ice Age trail. http://bit.ly/3KbHop","time":1255651864},{"text":"RT Good ole cable ! @KevinMHughes as I said earlier, I went long the $GBPUSD at 1.6350 \u0026 will be holding it till the next Ice Age","time":1255654726},{"text":"RT @freefilen Dupont  Entering The Ice Age (2009) http://bit.ly/48l89p","time":1255661058},{"text":"climate science: 1970\u0027s FILM DISCUSSES THE COMING ICE-AGE http://cli.gs/nB6WS","time":1255662424},{"text":"@kurby310 i\u0027ve been sick as fuk. But starting to feel better. I love ice age movies ;)","time":1255662715},{"text":"RT @jAykaZ:   3D Festival - S3D Festival 2009 CGV 10 17() . Ice Age3, Final Destination 4, Bloody Valentine ...","time":1255664118},{"text":"right , got it, the new ice age thingtweeted 3 birds below, in Archives hit September 2009 and the article will show up.","time":1255665519},{"text":"alah, kata2nya yg di ice age dawn of dinosaurs kan..we.RT: @naufalmep no pain no gain","time":1255658531},{"text":"win Ice Age http://bit.ly/BcIyR","time":1255666583},{"text":"WHo the hell got the room freezing, I feel like the squirrel in Ice Age.","time":1255671480},{"text":"bout to watch this shit then hit the bed. dont judge me. Ice.Age.Dawn.of.the.Dinosaurs.2009.R1.NTSC.DVDR-BULLDOZER","time":1255666562},{"text":"Global warming?na I predict the next Ice Age is coming br br br","time":1255668519},{"text":"New blog post: Ice-Age:-Dawn-of-the-Dinosaurs http://bit.ly/1OBmAM","time":1255669264},{"text":"@TwtMarketerPro In the 70\u0027s the word was we were going to be in an ice age by 2010. What happened?","time":1255670657},{"text":"RT @freefilen Dupont  Entering The Ice Age (2009) http://bit.ly/48l89p","time":1255672615},{"text":"my back is painful and my legs are numb.. i was indian sitting for about 1 hour and thirty minutes watching in school ice age... help","time":1255678334},{"text":"Ice age has arrived. the world it has peacefully frozen in time but to one naked survivor it\u0027s cold and lonely as hell http://bit.ly/ICSfK","time":1255668660},{"text":"ICEHOTEL: From ice age to the space age. ICEOHOTEL Entrance. Photo: Ben Nilsson/Big Ben pr... http://url4.eu/d9CT","time":1255674026},{"text":"#foramilliondollars I\u0027d watch Ice Age DotD, even though from the trailers the new character Scratte made me not want to watch the movie! \u003e:(","time":1255674584},{"text":"http://bit.ly/35rOOP THE birth of the US Appalachian mountain chain may have been behind a major ice age and a mass extinction.","time":1255676412},{"text":"RT @AdamRutherford: Daily Mail science is so bad it\u0027s not even wrong. Dinos died out in THE Ice Age? Huh? http://is.gd/4lL88","time":1255678342},{"text":"It\u0027s snowing in mid October. The next ice age is coming and in 100 million years we\u0027re all going to devolve back into fuzzy apes.","time":1255679513},{"text":"@SvenRecker wir freuen uns auf deinen Besuch! Unser DVD-Tipp:Ice Age 3: Die Dinosaurier sind los! Unsere Filialen: http://twiturl.de/silih","time":1255679120},{"text":"saw Ice Age (2002) and rated 8/10 http://moviemat.es/movies/2002/ice-age","time":1255687255},{"text":"I think an ice age is probabaly coming.","time":1255684881},{"text":"@SpiffOnDeck lmfaooo @ the ice age..br0* ur a FOOL!!","time":1255693619},{"text":"http://bit.ly/fmQAB Opposite Ice Age #OIA","time":1255680171},{"text":"Geeeemmpppaaaaaaaaa..*lari ala landak di ice age 3* http://myloc.me/13xZ2","time":1255681023},{"text":"Watch  Ice Age Dawn of the Dinosaurs 2009  Hollywood Movie http://surl.pk/aoozjita","time":1255681422},{"text":"Watch  Ice Age Dawn of the Dinosaurs 2009  Hollywood Movie  http://surl.pk/aoozjita","time":1255681442},{"text":"Thanks, @carlzimmer, for starting my day with this WTF: dinosaurs died out in the Ice Age. (from http://is.gd/4lL88)","time":1255691143},{"text":"[PRE] [DVDR] [Ice.Age.Dawn.of.the.Dinosaurs.2009.MULTi.READ.NFO.NTSC.DVDR-d0wnz]","time":1255691450},{"text":"A high of only 65 degrees? Jesus, I didn\u0027t know we were receding into the next ice age already!","time":1255691943},{"text":"Proof from: @jeanburman ~ This is a must read! Is it global warming or ice age? And what about that gyre in the Pacific?","time":1255692653},{"text":"Sciencedaily link was under-construction. thinking Crygentics(spelling)Dr. Gupta, ice age, survival of species. c where I\u0027m going?","time":1255682295},{"text":"Sound hypothesis about Ice Age@newscientist Birth of the Appalachians triggered mass extinction http://bit.ly/1uElZB","time":1255699454},{"text":"I would like the real/living/talking Sid from Ice Age. kkthanks (:","time":1255711340},{"text":"#randomfact its cold as fuck but @hail_zel refuses to turn the heat on...we livin in the ice age like shit","time":1255710111},{"text":"Viendo Ice Age 3 en el ave a Barcelona. http://twitpic.com/lrov4","time":1255714037},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255709785},{"text":"Reader: in science, the debate is never over. Thirty years ago, the next ice age was upon us http://bit.ly/3tUrlg #climate","time":1255712488},{"text":"Love Happens \u0026 Fame start tonight, plus Harry Potter, Julie \u0026 Julia and Ice Age are all in this weekend\u0027s lineup!... http://bit.ly/AdCb8","time":1255717810},{"text":"Watched Ice Age 3 in the plane... and cried! ahahaha","time":1255730644},{"text":"watching Ice Age. I love Sid the sloth!","time":1255733992},{"text":"watching Ice Age. ....no thanks, I choose life. I Love Sid the sloth!","time":1255734229},{"text":"Watching Ice Age with my 2yr old and 4yr old sons. They\u0027re snuggling on both sides of me. This is pretty cool!","time":1255731160},{"text":"LOL. I remember the last movie i saw with my poppy. It was ice age, and he fell asleep. My poppy is awesome! :D \u003c3","time":1255735857},{"text":"Kevin says we\u0027ll all be able to survive the ice age, as long as we go to his house and watch him do a striptease he\u0027s just that hot!","time":1255728209},{"text":"Hubby\u0027s watching the race, I\u0027m watching Ice Age....nothing like spending time together! Oh I\u0027ll give in and go watch the race...","time":1255732463},{"text":"End of ICE Age, Dawn of Smart Grid: The added scale of vehicle electrification and the advanced metering functio.. http://bit.ly/49GU7n","time":1255735022},{"text":"watching ice age 3 with kids and hubby","time":1255741157},{"text":"Hmm, I think im watching Ice Age. :)","time":1255737696},{"text":"Watching Ice Age with the grandkids! I love this movie!!","time":1255748763},{"text":"lord of touch me and your dead LOL i love ice age!\u003c3XD","time":1255746346},{"text":"It\u0027s Friday night and I\u0027m sitting here watching Ice Age on basic cable. sigh.","time":1255737948},{"text":"A mini ice age may be triggered by too much fresh water in the Atlantic ocean. This decreases the salinity of the ocean. #science","time":1255740173},{"text":"I\u0027m watching Ice Age by myself on a friday night. Wow I\u0027m cool lol.","time":1255741447},{"text":"Energy business transformation begins with the dawn of a #smartgrid and the end of an ICE age. - http://ow.ly/uVwL","time":1255742970},{"text":"@wimsy And speaking of long term trends, you are aware that we\u0027re just now recovering from the Little Ice Age, right?","time":1255747061},{"text":"Ice Age 3 Birthday Supplies For Your Little Sid and Friends http://HotAnnals.com/a/541","time":1255747712},{"text":"http://twitpic.com/jv2wh god is gonna punish me 4 this, but dont he like the mammoth off ice age??","time":1255749063},{"text":"Thank you Trinity Baptist Church, I am glad that you enjoyed my song about the Ice Age! http://bit.ly/2eAIc4","time":1255751168},{"text":"@AnaReds i like ice age 3, fame, new moon, idk i want to see 2012 n the stepfather i also want to see cloudy with c chance of meatballs.","time":1255740084},{"text":"woke up quite early in the morning, cooked myself breakfast, enjoying my fried noodles and hot tea,watching ice age 3 - i kinda feel AT HOME","time":1255745244},{"text":"Watching Ice Age3 guys dont talk to guys about guy problems, we just punch eachother on the arm...\u0026quot ... http://lnk.ms/3YZx1","time":1255746395},{"text":"Watching Ice Age3 guys dont talk to guys about guy problems, we just punch eachother on the arm haha :D ... http://lnk.ms/3Yb0q","time":1255746423},{"text":"RT @shittalky: what the FUCK ---\u003e http://twitpic.com/jv2wh son look like the mammoth off ice age \u003c\u003c bwahahahaha","time":1255747074},{"text":"WTF is that?! RT @ArieJones: RT @shittalky: what the FUCK ---\u003e http://twitpic.com/jv2wh son look like the mammoth off ice age","time":1255747180},{"text":"Ice Age 3 fails by having that stupid new character Scratte in it, it makes me not want to watch the movie, Scrat doesn\u0027t need her! \u003e:(","time":1255747604},{"text":"Watching Ice Age3 guys dont talk to guys about guy problems, we just punch eachother on the arm haha :D ... http://lnk.ms/27MwV","time":1255748449},{"text":"Eng 10/16: Nothing Like The Holidays, Stan Helsing, The Orphan, Ice Age 3, Blood The Last Vampire, Love n\u0027 Dancing, The Crew, Tinkerbell","time":1255750983},{"text":"@pottergirl7 Some movies which I like most are all harry potter series,titanic,sholay,ice age series,home alone,kal ho na ho,swadesh so on","time":1255737646},{"text":"RT @cunseedid RT @shittalky: what the FUCK ---\u003e http://twitpic.com/jv2wh son look like the mammoth off ice age -[*DEAD!* back *DIES AGAIN*]","time":1255747198},{"text":"RT @shittalky: what the FUCK ---\u003e http://twitpic.com/jv2wh son look like the mammoth off ice age\u003c------F.U.G.L.Y u aint got no alibi","time":1255747267},{"text":"watchin ice age!","time":1255756712},{"text":"Ptero Glide: Dit spel gaat ook over de film Ice Age 2 The Meltdown. Binnenkort komt Ice Age 3 Dawn of the Dinosa.. http://bit.ly/4xVmYG","time":1255753886},{"text":"So fucking pissed off, my train driver is trying to kick start the ice age with his excessive air con. Fuck you, asshole.","time":1255758019},{"text":"#Kostenlos Cool :)) \u003e 1.000 Kinofilm-Wallpaper zum Download wie Ice Age, Harry Potter, Matrix ... -\u003e http://TwitPWR.com/uLY/","time":1255758939},{"text":"GoodTimesSociety The Coming Ice Age: The Coming Ice AgeI mentioned several.. http://twurl.nl/j1ko75 The other HuffPost.","time":1255760470},{"text":"Ice Age: Dawn of the Dinosaurs - I just liked the newcomer one eyed beast, but the movie sucks from an angle. Dont know why!","time":1255763566},{"text":"Omygod? Just watched on the site of the cinema, And ice age 3 is still in the cinema? Please, It\u0027s old \u0026 Sucks.. Pff","time":1255765798},{"text":"@JonathanRKnight I\u0027m watching Ice Age and just remembered ur lil sloth friend! Sure it didn\u0027t sneak into ur luggage ???","time":1255755217},{"text":"When Lies become Truth: Apropos lyrics from the deceased MJ\u0027s Billy Jean. If Ignorance continues, cavemen will be blamed for last ice age","time":1255755429},{"text":"Aww Spidah! *memories* RT @sarahmarina or SPIDAH lol RT @CaliCG @JonathanRKnight watchin Ice Age and just remembered ur lil sloth friend!","time":1255756241},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255757371},{"text":"Greatest animation films of all time acc to a recent survey 1. Toy Story 2. Shrek 3. The lion king\u003cbr\u003e 4. Finding Nemo\u003cbr\u003e 5. Ice Age","time":1255758762},{"text":"Ice Age - Box Set Teil 1-3 [Blu-ray] ab 34,95 Euro @dvdregal http://bit.ly/tlM3Q #hitliste #bestseller #highlight","time":1255759803},{"text":"@2media RT #Kostenlos Cool :)) \u003e 1.000 Kinofilm-Wallpaper zum Download wie Ice Age, Harry Potter, Matrix ... -\u003e http://TwitPWR.com/uLY/","time":1255761889},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255762216},{"text":"RT @TheJohnTucker: ice age 3 is a odee good movie","time":1255780541},{"text":"Game : Ice Age: Dawn of the Dinosaurs SP v1.0: *_*Ice Age: Dawn of the Dinosaurs SP v1.0*_* _ *_Requirements:_*_ Smartphone ..","time":1255776719},{"text":"#10: Ice Age: Dawn of the Dinosaurs + The Scrat Pack http://ff.im/a0bjo","time":1255774612},{"text":"  Ice Age 3 : Dawn Of The Dinosaurs   http://bit.ly/35vDJO","time":1255776693},{"text":"Are we out of the economic ice age yet? http://bit.ly/aHqKn","time":1255775750},{"text":"[SymApp] Game : Ice Age: Dawn of the Dinosaurs SP v1.0 http://bit.ly/4C7IAi","time":1255776657},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255779163},{"text":"I\u0027m living in the Ice age","time":1255784003},{"text":"NOW SHOWING, Ice Age - Dawn of the Dinosaurs!!!! Diggin\u0027","time":1255786451},{"text":"New video: Ice age 2 funny http://bit.ly/1WLnmt","time":1255783241},{"text":"New blog post: Peruvian Glaciers Prove Little Ice Age Was Global | The Resilient ... http://rantnet.com/?p\u003d2354","time":1255783744},{"text":"If I hear the words \u0027ice age on gleasee mamma\u0027 one my time I may turn to self harming. Shrek is not a hit yet.","time":1255785742},{"text":"@robertbrook Ah! The emotional blackmail. I hated ET for that. I slightly resented Ice Age 2 for that...Bambi gave me nightmares of fires...","time":1255794239},{"text":"That\u0027s why I refuse to go Green...I\u0027m hoping the next ice age will knock off most of the population! Preferably the idiots!!!","time":1255787948},{"text":"just watched ice age 3 halfway with amelia, chin han and kok fei. i call them AAM. Hahah. yet to tell them why.","time":1255789958},{"text":"When did it start snowing in October? Ooh right I forgot that Global Warming was code for Ice Age. This sucks when your job is outside.","time":1255790902},{"text":"0 sunspots today. If the solar flares continue to be zero or minimal, we could go into another mini-Ice Age like the Maunder Minimum.","time":1255792060},{"text":"smoke so much weed you can call me oak tree, bitch im in space come and visit me, ice age man im in zone freeze.bored jst spittin lol","time":1255787927},{"text":"Ice age 3, rice, cholle and yoghurt.","time":1255807871},{"text":"Ice Age 3 (2009) http://bit.ly/2p3b7s","time":1255809191},{"text":"the ice age is coming, the sun\u0027s zooming in... but I have no fear.","time":1255809485},{"text":"here w a sleeping daddy and daughter...the kids are watching ice age and im waiting to go to the park :]","time":1255799387},{"text":"aye, but shrek 1 and ice age 1 are aboth made aroud 2000, like 9 years ago. http://po.st/Wqp","time":1255801058},{"text":"Big Mama Hollers: Farm City and Ice Age http://bit.ly/4uoI4R","time":1255802791},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255804329},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255806535},{"text":"California The End of the ICE Age, Rise of the Smart Grid  EV World: SYNOPSIS: Shifting from oi.. http://bit.ly/2z0Kut","time":1255808975},{"text":"vo ver the ice age 3 com a @jennyaudrey :D -QQ","time":1255816568},{"text":"I\u0027m on my stage Sid, the Ice Age - a truly moving sloth!","time":1255819559},{"text":"Some Ice Age. . . . Popcorn w/chocolate chips. . . . . And time to myself. Remix!","time":1255819920},{"text":"@InhofePress this whole administration is a joke and liars !!the earth is cooling ..FACT ! holdren predicts an ice age in 2020 !!","time":1255810085},{"text":"@MysticalStar86 Men come and go. Dinosaurs are forever. Unless there\u0027s another Ice Age. Or a breadcrumb shortage.","time":1255821069},{"text":"Ava and I - out for daddy daughter date night - watching ice age 3 http://yfrog.com/16y28lj","time":1255821800},{"text":"@MysticalStar86 Men come and go. Dinosaurs are forever. Unless there\u0027s another Ice Age. Or a breadcrumb shortage.","time":1255822471},{"text":"Recipe And Halloween Crafts Inspired By Ice Age 3: Dawn Of The ... http://bit.ly/2zVZIn","time":1255823599},{"text":"Big Mama Hollers: Farm City and Ice Age: I\u0027d so eagerly anticipated last night, putting nine kids into Brons.. http://bit.ly/3SRIcZ","time":1255816211},{"text":"Watching Ice Age: Dawn of the Dinosaurs (2009)","time":1255825841},{"text":"Went to see Ice Age with Dar, Elisa, and Nathan.","time":1255827265},{"text":"DINOS-LIVE Ice Age 3 in Ramstore Cinema: ) - The third sequel of animated film \u0027Ice Age 3\u0027, sub-ti.. http://bit.ly/TV5S9","time":1255832976},{"text":"Oom2 pd nemenin ponakan2 ntn Ice Age 3.. Tau2 bocah udh pd kemana, kitanya yg msh ngakak2.. :p","time":1255826618},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255829956},{"text":"RT @Seriou: You R a dumbass RT @NaiveAbroad: @fleckman Polar ice has been melting since the end of the last [!!] ice age. #p2","time":1255832439},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255834470},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255834815},{"text":"I\u0027m watching Ice Age.","time":1255850743},{"text":"Just finished watching the proposal \u0026now im watchin ice age xD","time":1255839878},{"text":"@stephxox13 thanks for telling me, and now I\u0027ll tell you ice age was really good. :P","time":1255840878},{"text":"Global warming? I don\u0027t think so... More of on a beginning of an ice age... Rain, rain go away pleaaasee!","time":1255847069},{"text":"Global warming? I don\u0027t think so... More of a beginning of an ice age... Rain, rain go away pleaaasee!","time":1255847109},{"text":"ooo movie night was fun!! wached da movie on da computer! ice age was asome and FUNNY!!! gonna whach the movie UP m ... http://lnk.ms/3d9jn","time":1255838446},{"text":"Back to watching Ice Age.","time":1255856472},{"text":"Cryotherapy - Ice Age http://www.tatame.com/2009/10/05/Ice-age http://bit.ly/CzyCW","time":1255857648},{"text":"#thingssaidb4sex Damn when is the last time you shaved down there, the Ice Age?","time":1255857240},{"text":"#thingssaidb4sex Damn when is the last time you shaved down there, the Ice Age?","time":1255862633},{"text":"@Ukania not bad. Been having a play with CS4 this morning, watching Ice Age 3 with the Kids now.","time":1255854106},{"text":"Sitting in the previews for Ice Age 3 w/ ElijahtheBoyWarrior, eating hamdogs as he calls hotdogs. Love my kid! :-p","time":1255854148},{"text":"ice age 3 kijken voor de 3e keer... gewoon, omdat het kan!","time":1255856679},{"text":"eee a busy morning! i\u0027m thirsty and wanna watch ice age D: work to do though :(","time":1255857608},{"text":"I bet it wouldn\u0027t take too much indoctrinating to convince everyone in Atlanta of a coming ice age on a day like today.","time":1255860493},{"text":"soooo cute...watched ice age3 and we laughed so much..thanks for a nice romantic evening..","time":1255860802},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255856253},{"text":"http://bit.ly/13rhUD Ice Age 3, Funny All The Time! It Got Familiar Humors So You Dont Even Watch Any Other Movies, Still Makes You Laugh.","time":1255860248},{"text":"Is up with the kids watching ice age 2 then gotta go feed horses and hopefully gonna get out on the Harley today. What are you doing today?","time":1255860943},{"text":"Check out these great coupons for your favorite moview, Ice Age, Flicka, Horton Hears a Who and more. http://bit.ly/1vbHeJ","time":1255865114},{"text":"december weather in october (continued from last year)... maybe the next ice age in the north east, global warming for everyone else","time":1255865353},{"text":"i just went to the cinema to see ice age 3 :D","time":1255867376},{"text":"Are fat people a sign of the coming ice age?","time":1255877902},{"text":"What am I going to do with 3 kids all day - stuck in the house, rain, rain, rain! I wish my 10 month old twins liked Cars or Ice Age!","time":1255868381},{"text":"THE ICE AGE I - II - III DVDrip [Mediafire]: Download HEREPassword: www.thaiphienonline.net http://bit.ly/YhrOO","time":1255868511},{"text":"Recipe And Halloween Crafts Inspired By Ice Age 3: Dawn Of The ... http://bit.ly/K4WLT","time":1255868934},{"text":"# Dnbheaven Radio - Now Playing: Concord Dawn \u0026 Chris SU - The Ice Age www.dnbheaven.com","time":1255881077},{"text":"You punched {OTSS} Eddie Bagga Donuts in the face, dealing 3 damage damn that punch hit back to the ice age...... http://bit.ly/1QQRmC","time":1255875705},{"text":"had a good time last nite wit my Gordito (my son) watchin Ice Age \u0026 eatin junk food! (K tus labios nunca pronuncien ... http://lnk.ms/3dqM3","time":1255871301},{"text":"had a good time last nite wit my Gordito (my son) watchin Ice Age \u0026 eatin junk food!! (K tus labios nunca pronuncie ... http://lnk.ms/2CfhX","time":1255874760},{"text":"I am a mammoth in the ice age..walking alone, I am a journalist.","time":1255887445},{"text":"- Ice Age 3: Hell on Earth! ... http://lnk.ms/2Djkh","time":1255895586},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255885720},{"text":"Polar ice and glaciers have been melting for 11,000 years, since the last [!] ice age. Were there three ice ages? #p2 #tcot #sgp","time":1255886111},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255888105},{"text":"and the Earth was in an another ice age","time":1255904112},{"text":"Watching all the ice age movies with my mom and sister","time":1255904486},{"text":"Anybody else think of the @common_squirrel and see scrat from ice age?","time":1255906222},{"text":"Max is counting down the days to Ice Age Dawn of the Dinosaurs is released on the 27th","time":1255908622},{"text":"#yomama So fat she could block out da sun and start another ice age...","time":1255903447},{"text":"guess what everybody? it\u0027s snowing real hard outside! boston is gonna be the first to get frozen in an ice age lol","time":1255904310},{"text":"I\u0027ma finish the story: So, in this ice age, the Chobits were the only thing left. They had failed to destroy all of technology","time":1255904563},{"text":"@TeamToBeat metaphor for ya dodgers are the dinosaurs the phillies are the ice age (or more correctly metor)","time":1255908657},{"text":"http://twitpic.com/m2blv - Giving the Stone Elephant a nudge, hiking the Ice Age Trail in the Kettle Moraine State Forest. #VFFF","time":1255901960},{"text":"I look hilarious right now; I\u0027m like dressed for an ice age or something... \u0026 it\u0027s only like 58 degrees outside lol.","time":1255903804},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255904365},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255910312},{"text":"RT @N287: RT @Somuchpain: @CO2HOG Oh now Gore is saying that the new Ice Age will kill millions. LOL what a con man. Joke of the century.","time":1255897583},{"text":"Watching Ice Age 3 on the bus and laughing my ass off...don\u0027t judge me","time":1255911044},{"text":"Hey #JustWrong i want to know what caused the end of the last ice age?","time":1255911484},{"text":"@stephxox13 yah I was talking about ice age the movie silly","time":1255918853},{"text":"@krmartel Seriously this time: friendship was the central theme to Ice Age. (That\u0027s all I\u0027ve got right now. I\u0027ll think more.) #friendsinfilm","time":1255911861},{"text":"Watching ice age with my kids. How come the dinosaurs can\u0027t talk but all the other animals can?","time":1255913452},{"text":"@missusP True, true. Did you like the Ice Age movies and Harry Potter? My daughters and I did.","time":1255915657},{"text":"Hey #JustWrong what kind of SUV\u0027s caused the end of the previous ice age? (Not Evil Just Wrong live \u003e http://ustre.am/6NTs)","time":1255910700},{"text":"Hey #JustWrong i want to know what caused the end of the last ice age? (Not Evil Just Wrong live \u003e http://ustre.am/6NTs)","time":1255911393},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255911837},{"text":"Busy working on a Global Ice Age brief using colorful graphs and scary images to mask the skewed data. Nobel deadline is Feb.","time":1255913461},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255916661},{"text":"My Friday! Had 500 ppl in the museum today for Ice Age Day. I\u0027m ready to sleep in. Hopefully I\u0027ll wake up and it\u0027ll be lunch not breakfast.","time":1255918983},{"text":" Who was burning the fossil fuels that melted the ice age? Its polution we probably need to address not global warming!!!!","time":1255923135},{"text":"Ice Age 3! jajaajajaaj muy buena","time":1255924947},{"text":"I\u0027m watching Ice Age 2 now. :)","time":1255927880},{"text":"ice age 2 the meltdown \u003d) ....so i have pneumonia..nice","time":1255929701},{"text":"Ice Age - Going Down On The Dinosaurs #moviesturnedxxx","time":1255931034},{"text":"@hvdklauw I have also heard that the 3D in Ice Age 3 was not much of a wonder. Haven\u0027t seen it --didn\u0027t quite like the prev Ice Age movies","time":1255932878},{"text":"wow RT @Reddkendoll: I\u0027m watching Ice Age 3 and eating Reese Puff cereal with a hard on...dats not rite lol","time":1255925561},{"text":"@grimborg @hvdklauw I didn\u0027t see much difference, but I found Ice Age 3d quite entertaining, which had nothing to do with the 3d element","time":1255933690},{"text":"Ice Age is officially my son\u0027s fave film. God help me. He won\u0027t watch Wall-E, Nemo, or Disney. Toy Story is good but he\u0027s scared of the dog.","time":1255929642},{"text":"watching ice age 3 in the way home \u003d]","time":1255943829},{"text":"Its the ice age outside today.","time":1255946473},{"text":"@bossygirlash09 the world finna have an ice age","time":1255953438},{"text":"@organizedwife damn ur chirpy and bouncy like scat from Ice Age","time":1255942627},{"text":"ice age heat wave if the worlds at large why should i remain","time":1255944354},{"text":"Its like the fricken ice age in my Spanish room. Fuck this.","time":1255950381},{"text":"LMBO! *waving* hi! RT @sandmaxprime: @organizedwife damn ur chirpy and bouncy like scat from Ice Age","time":1255942944},{"text":"ice age heat wave cant complain if the worlds at large why should i remain??","time":1255944693},{"text":"Ice Age 3 is something you\u0027ll never get tired watching. Never a dull moment. The best animated thing ever created.","time":1255950223},{"text":"HANNAAAAH ! Warum willst du unbedingt das ich mit dir ins Kino gehe ? Und dann auch auch noch in ICE Age 3 !!??!!","time":1255941889},{"text":"Lets recount the Green lies, first it was Ice Age scare (not the movie), then Global Warming scare. We are in 8 yrs cooling! #DPOST","time":1255945888},{"text":"Gordon Brown is trying to rubbish the world about climate chane. Aren\u0027t we all at the beginning of an ice age?(Naked scientsts RP..","time":1255946731},{"text":"I\u0027d like to thank Queen Latifah and the 3rd Ice Age movie for bringing 1987\u0027s Walk the Dinosaur back to everyone\u0027s attention. Not really.","time":1255950026},{"text":"RT @Mr_Undeniable @bossygirlash09 the world finna have an ice age \u003c-- lmfao \u0026 its fuckin october!","time":1255953618},{"text":"@lilman27 Well at this point i am the same way with the movie Ice Age and Cars. My little cousin will NOT let those go!!","time":1255956990},{"text":"@tsxstocks There will be plenty. Hopefully natgas prices will rise again as the next ice age approaches ;-)","time":1255957474},{"text":"Chick Totally Looks Like Sid From Ice Age http://bit.ly/1NY519 #cheezburger","time":1255958141},{"text":"It\u0027s a dreary and cool morning here right now. My furnace has only 2 settings: Ice Age and Supernova.","time":1255967044},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255956835},{"text":"The Complete Ice Age: How Climate Change Shaped the World (Hardcover) is out today http://merecal.com/1K96 #science #books #merecal","time":1255960963},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255961737},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255961779},{"text":"The Complete Ice Age: How Climate Change Shaped the World (Hardcover) is out today http://merecal.com/1K96 #history #books #merecal","time":1255962136},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1255966020},{"text":"Ice Age (2002) (Resumable Direct Link): Ice Age (2002) (Resumable Direct Link) Size: 700MB http://bit.ly/YidAy","time":1255976260},{"text":"i got new sunglasses purple and i wan a ice age toy for my bro lol","time":1255978031},{"text":"The Complete Ice Age: How Climate Change Shaped the World - Thames \u0026 Hudson. http://bit.ly/3WIYrK","time":1255974114},{"text":"@chrisboylescopy I shall blot out the sun with your logo, and usher in a new ice age of darkness, hunger and want. With your logo.","time":1255974317},{"text":"Headed home. It\u0027s Carters bday so we r going to see Ice Age:dawn of the dinos. I think he will like it.","time":1255972109},{"text":"I think I\u0027ll watch both Ice Age 3 and Orphan. Leaving work early, so will have time or both. Thanks @shakyjake214 and @Thatchapdean","time":1255976266},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://bit.ly/WuvcO He follows back!","time":1255978123},{"text":"@Vivacions Lil and I want the ice age tray, too. :-)","time":1255992852},{"text":"Also i noticed that ice age is a mix of monsters Inc and the lion king... Weird...","time":1255984121},{"text":"Ice Age: Dawn of the Dinosaurs:  Ice Age: Dawn of the Dinosaurs is now available for Download! The cast and crew of t http://bit.ly/16HXor","time":1255993290},{"text":"played Ice Age 3: Dawn of the Dinosaurs (PC) and 3 other games in the last 24 hours. http://raptr.com/DziugasMakaras","time":1255993532},{"text":"Global(Arctic)Melting?while Antarctic freezes up?Hard to know whats up or down but Ice Age has Higher Probability http://tinyurl.com/yjsbalu","time":1255983334},{"text":"Horton, Ice Age \u0026 More Movie Coupons!: Here are some great Movie Coupons I ran across when doing my weekly deal.. http://bit.ly/Btm9i","time":1255986163}]
[{"text":"Haaha...xD Ich schaue gerade Ice age 3 an.","time":1259869105},{"text":"My son is 4months old and watchin ice age 3","time":1259881489},{"text":"@skiingexaminer Ahh, I meant we should be cooling right now, lol - sunspot minimum should lead to cooler temps / mini ice age :P","time":1259875976},{"text":"Ha ha. So house of video just called and we rented ice age like forever ago. Seems as if we returned only the case. Lmao! Oops","time":1259879553},{"text":"Watching Ice Age 3...again... My 3-year-old is relentless!","time":1259895932},{"text":"@alittlepregnant HA. my bro worked for commodore back in the day. you know, in the ice age.","time":1259886182},{"text":"Ice Age 3 just looked so cute, I hadda order it.. watching this w/ Trixi cat :)","time":1259888990},{"text":"@WesLove - Hmmm, probably Up or the new Ice Age movie - those seem age appropriate for you. Katie might get bored though.","time":1259896111},{"text":"Now Scientists Say Earth May Experience Sudden Ice Age: In the film, The Day After Tomorrow, t... http://bit.ly/5JaDY3 #altnews","time":1259886734},{"text":"[Via BN] Now Scientists Say Earth May Experience Sudden Ice Age: In the film, The Day After Tomorrow, t... http://bit.ly/5JaDY3","time":1259886770},{"text":"Went to redbox to rent Terminator: Salvation. Didn\u0027t have it, rented the polar opposite, Ice Age 3 instead. I had no idea they made a 3rd","time":1259897653},{"text":"@mini_mia also correct, but you must remember, we are coming out of an ice age. So, debating minutae of a silly anthropocentric theory \u003e\u003e","time":1259898335},{"text":"I swear ice age 3 is fucking hilarious... yall need to see this shit... lol ;)","time":1259899446},{"text":"@tanyamc79 Yeah there\u0027s 3 it\u0027s called ice age 3 dawn of the dinasaurs","time":1259906415},{"text":"Ice Age 3 it iiiiiisssss!!! YEAH!!!!! Can I handle the idiots, tho??? Hmm......","time":1259910192},{"text":"\u0027The names Buck. Short for Buckminster, long for Baa!!\u0027 Ice Age 3\u0026lt;3","time":1259912453},{"text":"Just starting to watch my recording of Ice Age: The Meltdown. If the whole movie is as good as the start I\u0027m gonna love it!","time":1259904711},{"text":"Turning off Ice Age: The Meltdown. Too funny! I can\u0027t read tweets and watch it at the same time!","time":1259904942},{"text":"How cold was it today? I actually wore my coat. That means an Ice Age is about to occur. Soon we will be burning hobos for warmth.","time":1259906885},{"text":"@nelly061 LOL The examples it lists are Finding Nemo, Kung Fu Panda, A Bug\u0027s Life, Bambi, Ice Age, Lady and the Tramp, Babe, Happy Feet, etc","time":1259910446},{"text":"lol my mom is watching ice age 3 :)","time":1259926631},{"text":"New Movie Added: Ice Age http://www.watch-movies-online-free.tv/watch-online/ice-age/","time":1259917035},{"text":"I won 22 achievements in Ice Age: Dawn of the Dinosaurs for 755 trueachievement points","time":1259915679},{"text":"Earth could plunge into sudden ice age - LiveScience- msnbc.com: http://wp.me/pBjub-gF","time":1259914029},{"text":"@rowzyrose toe nails! lmfao lmfao.! imma find that part of ice age I told u about lmfao watch! hahaha","time":1259920051},{"text":"RT @MysticPolitics Earth could plunge into sudden ice age - http://mysticpolitics.com/climate/1353","time":1259925642},{"text":"Well I don\u0027t hate you, I actually kind of like you, a lot. Get your phone back and text me before the next ice age please \u003c3","time":1259916189},{"text":"@robday if there was no such thing as climate change, we\u0027d still be under 1km of ice from the last ice age","time":1259919480},{"text":"Dear Santa: 1 Cray Supercomputer. If I have to stare at an ice-age slow blue upload bar one more time... er, I mean, I\u0027ve been good.","time":1259921306},{"text":"#WorthaF @EmmaJaneR Squirrel in Ice Age thaws an acorn over fire \u0026 it turns into: Popcorn? I\u0027ve tried not to care. It\u0027s trivial. And yet.","time":1259925044},{"text":"Yeah I think I\u0027m gonna label the snow and ice warnings a failure. I was expecting the next ice age and I get cloudy and cold. smh","time":1259926716},{"text":"Now I\u0027ll finish watching Ice Age 3 lol","time":1259936204},{"text":"watching ice age 3 with my neighbours. Haha this movie is so funny!","time":1259938896},{"text":"Watching Ice Age 3 BD with my son. Looks and sounds so coooool. ","time":1259928357},{"text":"I\u0027m sick :/ and I\u0027m going to watch ice age 1,2,3 sooo cool ;)","time":1259928555},{"text":"I think I\u0027ve gone and entered another ice age, absolutely freeeeeezing","time":1259928954},{"text":"Review of Ice Age 2: The Meltdown movie by Marianita G Ebrole (nita) on www.trustedopinion.com/review/1259508","time":1259928921},{"text":"Watching Ice Age 2 in forensics. Txt if you wanna talk because i refuse to turn my updates on","time":1259930928},{"text":"Work was good. Watched Ice Age 3 afterwards. It\u0027s midnight and I have to finish drying my hair, tidy my room and pack...","time":1259932232},{"text":"RT @Pepper_10: RT @1ststarfighter: Stop the coming ICE AGE! Drive those SUVs! /I agree and do my part!","time":1259936010},{"text":"27 degrees this morning? Are you kidding me?? Did the Ice Age happen while I was asleep last night? BRRRRRR!!!!!","time":1259937236},{"text":"Hey baby @SirentaLahvea, I\u0027m so ready for you to get home too....so I can umm, watch Ice Age 3 with you :)","time":1259941558},{"text":"RT @Laubach: Global warming has been occurring since the last Ice Age ~18,000 years ago. Warming from Natural causes not man made. #truefact","time":1259934662},{"text":"RT @TIG954: #FF @Young_Nard cuz he COOLER den da ICE AGE !","time":1259943033},{"text":"I\u0027m so sick of @al_gore \u0026 world\u0027s bed-wetters!! In the 70\u0027s it was the impending return of the ice age terrified entire elem. schools!","time":1259950516},{"text":"Lg apacihh,akhrnya gue new moon jg nih RT @marshadhea: ice age 3 http://myloc.me/1T9II","time":1259964928},{"text":"Ice age 3. Why is Sid green?? Continuity people?? It\u0027s confuses the little folk like me when you change his colour :(","time":1259966495},{"text":"http://twitpic.com/s5yc4 - me and the girls watching ice age, wish mom were here.","time":1259968233},{"text":"watch Ice Age for the second time tonight - that\u0027s what 2 year olds do -watch things over and over and over and over.......","time":1259969622},{"text":"@MsVideoLight til they explain the med-evil warming period and the Little Ice age and produce some data for others to see then #badscience","time":1259960137},{"text":"Ancient volcano\u0027s devastating effects confirmed... http://is.gd/5cEte ...plunged Earth into an ice age that lasted 1,800 years...","time":1259970213},{"text":"ICE AGE: Dawn of the dinosaurs. #favorite","time":1259984242},{"text":"@mysilenttragedy I\u0027m doing ok. Watching Ice Age. You?","time":1259982275},{"text":"ICE AGE!?!?!?! This is DC snow. Not REAL snow. @Kagrox RT @Hissyspit: Obviously the charcoal is for surviving new Ice Age","time":1259980839},{"text":"Scrap the idea of watching ice age 3 I\u0027m now outside with the laptop S:","time":1259983566},{"text":"@mississippiDAWN That\u0027s just like my nephew with Shrek. Brought him Ice Age, he still wanna watch SHREK! #epicfail.","time":1259971589},{"text":"From 1350 to 1850 the world was under the affects of a mini ice age. It would make sense that the earth would be warming since 1850!","time":1259978460},{"text":"Cant help to think about him when I watch Ice Age .ovies!! Ready to open my hart I\u0027ve had it closed for way 2long!","time":1259976775},{"text":"Broke in the new Parasound theater rig with Ice Age, Dawn of the Dinosaurs. Kids thought it was cute. I thought it was SICK, SICK, SICK!","time":1259977012},{"text":"@nicholasbraun I\u0027m watching ice age! Haha. You?","time":1259997292},{"text":"Being bored has taken over my life!! Just finnished watching Ice Age 3","time":1259989926},{"text":"@the_daemon_ I love Ice Age. I watched the most recent one in 3D at the theatre. I thought it was pretty cool.","time":1259987972},{"text":"someone out there is \u0027bout to tell me something so important \u0026 I\u0027m surely freakin\u0027 out, I never heard from him since like the ice age. lol","time":1259989528},{"text":"@MazingAmy oh, yeah. Tonight\u0027s highlight was napping during Ice Age. Hadn\u0027t seen the BF all week, and I feel asleep on him \u0026 the kid.","time":1259991194},{"text":"@libertyrant Ive been screamin for years that the data they used didnt add up plus in 1970s they said ice age comin Liars allof them","time":1259995172},{"text":"@Smakdaddy422 Sshhh Holdren might hear you and declare another Ice Age coming :)","time":1260012977},{"text":"feels like a could sleep through the ice age. who ever came up with powerade is a genius","time":1260000949},{"text":"Enjoying time @ home with my family, doing absolutely nothing! Feels GOOD. about to watch Ice Age 3!!","time":1260011050},{"text":"College road trip was really good going to watch ice age 3 then orphan! X can\u0027t wait!!!! X","time":1260009467},{"text":"@MazingAmy oh, yeah. Tonight\u0027s highlight was napping during Ice Age. Hadn\u0027t seen the BF all week, and I feel asleep on him \u0026 the kid.","time":1260010601},{"text":"@Adore_Ash lolll yeah it is cold and in Winter time its Ice age! lol","time":1260022641},{"text":"Ice Age: Dawn of the Dinosaurs http://ff.im/ctNK8","time":1260027435},{"text":"Just woke up and found out that my parents and my bro are watching ice age","time":1260028622},{"text":"me and my sister, and going to the movies later to watch.. planet 51!!! but at the moment, we are still watching ice age.. at the house.","time":1260018416},{"text":"Big Freeze Plunged Europe Into Ice Age In Months http://bit.ly/8IHhha","time":1260020643},{"text":"iTunes best selling movie #17: Ice Age: Dawn of the Dinosaurs Just when you thought they couldnt get any... http://dealnay.com/125357","time":1260023926},{"text":"Once again, Mr. James Spann blew the weather outta context. He made it seem like the 2nd Ice Age. Thank you James....","time":1260017827},{"text":"Who says men can\u0027t multi-task?! Currently I\u0027m doing a presentation, watching Ice Age, following Blues and avoiding Xmas decs!","time":1260026643},{"text":"RT @FemmePatriot: Antarctica was climate refuge during great extinction http://bit.ly/8u3U5L Hey, I saw that movie, Ice Age was funny \u003d LOL!","time":1260018053},{"text":"going to watch ice age 2 soon. i \u003c3 ice age","time":1260032855},{"text":"RT @CFACTorg: No global warming ice age http://www.cfact.org/a/1394/No-global-warming-ice-age","time":1260041451},{"text":"@gomckane ok final offer....40 cent and an Ice age mixcd!!!!!!","time":1260032437},{"text":"Now going to watch ice age 3 with my parents and brother hihi :)","time":1260036438},{"text":"im watching ice age 2. and playing le piano. at the same time. woop","time":1260039041},{"text":"i\u0027ve got very cute gifts from grandma! Now we\u0027re going to eat with eachother, and after that ICE AGE 3!","time":1260029898},{"text":"RT @gu_heffner: @gomckane ok final offer....40 cent and an Ice age mixcd!!!!!!","time":1260032510},{"text":"RT @greygirlbeast: Ice-age sloth skull found in Riverside County, CA: http://bit.ly/8HzzdR","time":1260032517},{"text":"RT @gu_heffner @gomckane ok final offer....40 cent and an Ice age mixcd!!!!!!\u003c-------- ROTFLMAO","time":1260032536},{"text":"Bet it snowed a lot in Texas during the last \u0027ice age\u0027 and we\u0027re not talking about those silly cartoon movies.","time":1260032709},{"text":"@no_ones_hero yeah its weird but I will sit and watch Gone in 60 Seconds anytime I come across it, and Ice Age is good","time":1260029613},{"text":"@ardor_or_else Just and a prayer clause that begs for no \u0027Ice Age 3\u0027. 13 hours of it on repeat was enough. Thank you, weird Danish airline..","time":1260030019},{"text":"It\u0027s the cutest thing, bri and her brother are watching ice age intenselyyy (: shh but I don\u0027t like this movie hahaha","time":1260034699},{"text":"I would get sent to the store when it\u0027s sleeting out and NJ peeps are mobbing the stores like the 2nd ice age is nigh, could be home on PS3.","time":1260039045},{"text":"@niinacakes babygirl, you take forever and an ice age to get ready.","time":1260043458},{"text":"RT @CFACTorg: No global warming ice age http://www.cfact.org/a/1394/No-global-warming-ice-age","time":1260044475},{"text":"Bout to watch... Ice Age_ Dawn of the Dinosaur http://myloc.me/1UqD7","time":1260043876},{"text":"RT @TheRealJakeHall: Watching ice age 3 and watched the Xmas Madagascar , preety good!","time":1260044398},{"text":"Mooie still uit ice age http://twitpic.com/sarku","time":1260046031},{"text":"@meff0d Um... this is a bit late to answer, but what the hayWatching Ice Age 3","time":1260047754},{"text":"Sitting down to watch the new Ice Age with my family. I\u0027m a bit of a Pixar snob so I don\u0027t have high hopes.","time":1260047857},{"text":"ok i gotta do a secret santa thing, should i get a porno and put an ice age cover on, OR..","time":1260048206},{"text":"yeeiiii. family movie night. first: the ice age 3. then jb 3D concert. and last one the grudge 3.","time":1260052321},{"text":"is considering that the propensity of theorums scouring for proof of near to post ice age civilistation are missing ... http://lnk.ms/4l535","time":1260052356},{"text":"Arondoho~There were serious civilizations (100,000s in cities) before the end of the last ice age","time":1260053855},{"text":"@mathman72 This is temporary. It will change again. Was recently Ice Age toys. Oh, I hated those!!! The mini TY beanie babies weren\u0027t so bad","time":1260046719},{"text":"BRRRRR! Baby, it\u0027s cold outside! Curl up with the kids around some family flicks: Eight Below, Ice Age, Jack... http://bit.ly/4DtDHG","time":1260048514},{"text":"RT @FUEGO: Why do girls always wanna go to the club? No matter the weather. It could be ice age outside they still go.","time":1260050665},{"text":"@Linds_STEREOS Duuude. That would be major fun. But i dont remember the last Ice Age. Im just chillin like a villain alone. (Y)","time":1260057122},{"text":"Ice Age 3...love this movie. Are you pulling my wiskers?","time":1260071711},{"text":"Ice Age 3 (c) Activision CLONEDVD http://forum.nf0.pl/sitemap/t-129090.html","time":1260071669},{"text":"Ice Age 3 (c) Activision http://forum.nf0.pl/sitemap/t-129086.html","time":1260071710},{"text":"@Massawyrm Sweet This year seem to have so many great animated film(escape for Ice Age 3 and Planet 51) and I\u0027m glad we have another.","time":1260059399},{"text":"A hoofed Ice Age predator as big as two bears? Check out Andrewsarchus, one of the weirdest animals ever to have... http://bit.ly/7oLIGt","time":1260066319},{"text":"CDInsight.com -Here\u0027s one to please adults and children News: Review - Ice Age 3: Dawn of the Dinosaurs: http://bit.ly/6QrDtp via @addthis","time":1260069850},{"text":"Watchin Ice Age 3, and Sid fareal jacked off a buffalo...Wtf! OmManiPadmeHum","time":1260081429},{"text":"this is how we study, in n out and watching ice age 3 (: http://yfrog.com/4i8v7oj","time":1260081213},{"text":"CanadaRights.com Snow falls on north shore; three inches may accumulate in ...: There was an ice age and a time whe... http://bit.ly/5hNGa5","time":1260082508},{"text":"Ice age 3 RT @fauzianisa: dear tweeps, what\u0027s the funniest movie you\u0027ve ever seen? reply ya, butuh buat tugas b. ing. tengkyuu :D","time":1260077121},{"text":"Watchin Ice Age 3 with my critters. Dope movie!!!","time":1260096406},{"text":"Ice age 3 with mac\u0026cheese and mash potato is awesome \u003c3","time":1260097603},{"text":"tour movie checklist - cloudy with a chance of meatballs, law abiding citizen, astro boy, ice age 3, the carter docu.","time":1260094241},{"text":"Last Night: Ice Age 3 (weak), Coraline (brilliant), Drag Me To Hell (very funny), Night Watch (fantastic) and Day Watch (not so much).","time":1260094709},{"text":"@keynoshewa just got back to ATL, its Ice Age around this bitch aint it?? Lol","time":1260100003},{"text":"Why does my son (4 yrs old) refuse to go to sleep until I get home. Everybody in the house is sleep but him. Bout to turn \u0027Ice Age\u0027 off!","time":1260087309},{"text":"RT @K_Smoov Idk how cold da Ice Age was but it feels like half that temperature right now in Atlanta! Brrrrrr!!! Lol \u003c---I kno","time":1260088112},{"text":"urgh still feeling ill today. didn\u0027t go out after all last night. :( curled up on the sofa and watched Ice Age 3 instead.","time":1260092594},{"text":"\u0027Icycle\u0027 http://bit.ly/91CotI The next ice age has arrived and the world as we know it has peacefully frozen in time, but to one naked su...","time":1260097591},{"text":"watching ice age 3 with julia allie and julie","time":1260111009},{"text":"Below article link references the coming ice age (via 1975). (laughs). In 1989 I bought into that ice age movement for a bit. Just a bit.","time":1260109056},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027 http://bit.ly/7cAfK3","time":1260107315},{"text":"RT @debster7301: RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260105689},{"text":"RT @debster7301: RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260105760},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g #tcot #utot","time":1260106063},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027. http://bit.ly/6l7SFb #tcot","time":1260106106},{"text":"RT @tweetdrudge In 1975 US government pushed the coming ice age... http://bit.ly/5g2rQg #tcot","time":1260106206},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g Great read.","time":1260107015},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260107182},{"text":"RT @SamiShamieh: In 1975 US government pushed \u0027the coming ice age\u0027. http://bit.ly/6l7SFb #tcot","time":1260108115},{"text":"hey im awake and im watching ice age, lolz u dont really need to know that","time":1260108852},{"text":"The Fiction of #Climate #Science: In 1975, the Government was pushing \u0027The Coming Ice Age\u0027 - http://ow.ly/JdXa #environment","time":1260110016},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260111058},{"text":"RT @Drudge_Report In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260111214},{"text":"Just a reminder for you youngsters..iIn 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260111219},{"text":"I remember in 1975 our government pushed the coming ice age.... http://tinyurl.com/yzns63j","time":1260112590},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260112770},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g #tcot #climategate","time":1260113059},{"text":"RT @digitaljournal: Ice Age skull of giant sloth unearthed in Southern California http://bit.ly/8QO2tu","time":1260113090},{"text":"Just watched Ice Age for the 4th time. It still makes me laugh and cry. I want a sloth for Christmas.","time":1260113285},{"text":"RT @digitaljournal: Ice Age skull of giant sloth unearthed in Southern California http://bit.ly/8QO2tu","time":1260113429},{"text":"I will remember... lateglacial, holocene, last termination, climatic optimum, little ice age. And repeat","time":1260113478},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260113805},{"text":"Task #1 (develop myself Physically) completed. Just got back from the gym. Now let\u0027s work on task #3 (develop Emotionally) with Ice Age 3 :)","time":1260103036},{"text":"WORLD MYSTERIES features amazing discovery ICE AGE ATLANTIS fringe science japan http://www.world-mysteries.com/mpl_10_atlantis_asmith.htm","time":1260105345},{"text":"Nothing to see here.. #climategate RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260107324},{"text":"Digital Journal Ice Age skull of giant sloth unearthed in Southern California: Many archaeological finds are accide... http://bit.ly/8QO2tu","time":1260108479},{"text":"GMLive Ice Age skull of giant sloth unearthed in Southern California: by a construction crew and could be on its wa... http://bit.ly/719frm","time":1260113090},{"text":"RT @danielvgarner: RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g #tcot #climategate","time":1260114510},{"text":"Earth could plunge into sudden ice age! http://tinyurl.com/yj3qgyx I don\u0027t think this will happen.","time":1260114858},{"text":"20 yrs ago everyone was talking abt global cooling aka the coming ice age. http://bit.ly/4Bj7LM when will the extreme propaganda end? #tcot","time":1260106179},{"text":"Since, we\u0027ve been around since last ice age and the climate certainly is warmer now than then and we\u0027re still here. #tcot @WarriorBanker","time":1260113288},{"text":"is watching Ice Age 3: Dawn of the Dinosaurs.","time":1260122977},{"text":"Watching ice age 3 with mum, dad and my sister. haha (:","time":1260123393},{"text":"RT @StrictlyHonest Timeline to 2012  Ice Age? http://retwt.me/1KPW6","time":1260117492},{"text":"Why Climatologists Get It Wrong: In 1975 The U.S. Government Pushed The Coming Ice Age. #libertarian http://bit.ly/79IFyD","time":1260116491},{"text":"Watching ice age with the babies while the fairy lights on the christmas tree flicker on and off gently. So gay but so relaxing!","time":1260116550},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260118770},{"text":"Timeline to 2012 - Ice Age?: This video explores the timeline of events leading up to December 21, 2012. Topics of ... http://bit.ly/7NkKcm","time":1260118967},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ydvlmgq (via @mikepfs)","time":1260120107},{"text":"RT @mikepfs: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ydvlmgqidiots morons liars greedy bastards","time":1260120137},{"text":"RT: @libertyideals Why Climatologists Get It Wrong: In 1975 The U.S. Government Pushed The Coming Ice Age. http://bit.ly/79IFyD","time":1260120430},{"text":"A must read: RT @mikepfs: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ydvlmgq","time":1260120719},{"text":"talking to my g/f ... just got off the phone..about to watch ice age 3 dawn of the dinosaurs...this should be fun","time":1260121917},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260124993},{"text":"I\u0027m just sayin\u0027... RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260128256},{"text":"@guardianeco But when things warm, and we have come out of the mini ice age, ice melts. The polar bears survived the medieval warm OK.","time":1260115677},{"text":"Must read RT @libertyideals Why Climatologists get it wrong: In 1975 The U.S. Government Pushed The Coming Ice Age. http://bit.ly/79IFyD","time":1260118666},{"text":"Excellent RT @michaeljohns 3 decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #cop-15","time":1260125588},{"text":"RT @edtroy: Excellent RT @michaeljohns 3 decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc ...","time":1260127417},{"text":"RT @michaeljohns Three decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #tcot #climategate","time":1260127616},{"text":"http://bit.ly/5WAkpc Interesting article on The Coming Ice Age. 1970\u0027s. National Science Board. Actually not a comedy bit!","time":1260128896},{"text":"RT @michaeljohns: Three decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #tcot #tlot #rs","time":1260125249},{"text":"RT @michaeljohns: Three decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #tcot #tlot #rs","time":1260128100},{"text":"RT @Beaufort_TParty: Three decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #tcot #tlot","time":1260128172},{"text":"Chillin @ the crib watchng ice age wondering what @iamkharma is going to do tonight?","time":1260132343},{"text":"got ice age game on ipod touch... Forgot everything and played almost all night long. Tried going to be but the wind was horrible! The","time":1260129830},{"text":"RT @AmyAtlantis: Ice Age Megaflood destroyed ATLANTIS in 10,000 BC WORLD MYSTERIES.COM fringe japan http://bit.ly/2Ksawg","time":1260131870},{"text":"is reading The Fiction of Climate Science at forbes.com: http://bit.ly/4Bj7LM // I remember the new Ice Age scare when I was a kid.","time":1260140584},{"text":"RT @michaeljohns: Three decades ago, those climate experts were predicting a coming Ice Age: http://tinyurl.com/ycqsc3g #tcot #tlot #rs","time":1260131034},{"text":"Watching ice age dawn of the dinosaurs with james and joshua","time":1260153363},{"text":"Watching 10,000 BC kinda lame lol I already seen this shit on ice age","time":1260145994},{"text":"Watching Ice Age 2 on FOX! I totally love it, so my mom does.","time":1260150430},{"text":"What will the media try to make us worry about when the ice age/global warming event does not occur and 2012 passes without event?","time":1260148037},{"text":"Since ur last one was when we went to Ice Age after July 4th... Yea, about time. RT @BubblyNole: I\u0027m finally back on Twitter. About time?","time":1260150815},{"text":"hey, @algore what caused, and ended the ice age? Was it trucks and coal fired power plants? #tcot #tlot #green #globalwarming #bullshit","time":1260153300},{"text":"I chose Ice Age 3. Hope it\u0027s a good movie.","time":1260161439},{"text":"Watchin ice age 3 :) i looove diego the tiger! He is awesome! Lol","time":1260158460},{"text":"going to watch ice age 2 i miss u boo \u003c3 ur amazingi \u003c3 u","time":1260160211},{"text":"We were headed for ICE AGE in 1970\u0027s..... http://bit.ly/6itTfr","time":1260170131},{"text":"RT @LTLV613: OOPS! Flashback to 1975: Covers of Time Magazine warning America of global cooling and the coming Ice Age. http://bit.ly/ ...","time":1260158421},{"text":"@Shujinkou Yikes, I feel your pain. That happened to me last time. REVERSE GLOBAL WARMING. Let\u0027s call in the new ice age!","time":1260161499},{"text":"Ice Age Megaflood destroyed ATLANTIS in 10,000 BC WORLD MYSTERIES.COM fringe japan http://bit.ly/2Ksawg","time":1260164885},{"text":"RT @Kristokoff: In 1975 US govt pushed \u0027the coming ice age\u0027... http://is.gd/5eCj9 #tcot The Fiction Of Climate Science..","time":1260165911},{"text":"I\u0027m #reading The ice age by Kirsten Reed - http://bit.ly/7761Sx","time":1260166973},{"text":"RT @Drudge_Report: In 1975 US government pushed \u0027the coming ice age\u0027... http://tinyurl.com/ycqsc3g","time":1260167188},{"text":"Got the fire place going about to watch ice age w/ my lover....we love kiddy movies:)","time":1260169731},{"text":"RT @cutprintreview After Planet 51 and Ice Age 3, it seems children\u0027s animation and penis jokes go hand in hand. (Me: And it irks me a lot.)","time":1260165668},{"text":"Time to text out my new cozy bed. It has a comforter on the mattress that is amazing. I can\u0027t keep it though. :( oh well! Off to ice age!","time":1260166081},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027... http://bit.ly/6jwggW","time":1260173121},{"text":"[App Store] Ice Age:   http://tinyurl.com/yh4nsur","time":1260183077},{"text":"New classified: ICE2: The Second Ice Age VIP http://is.gd/5eUW1","time":1260187159},{"text":"Film | Ice Age Dawn of the Dinosaurs (2009): Name: Ice http://forum.multihack.pl/alt-binaries/9794-film-ice-age-dawn-dinosaurs-2009-a.html","time":1260178836},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027...: In 1975 US government pushed \u0027the coming ice age\u0027...(Firs.. http://bit.ly/8D1rO7","time":1260182959},{"text":"Knitting like crazy for upcoming ice-age. Hurry home mum, I need a human blanket to snuggle up to.","time":1260172941},{"text":"ice age? RT @m4rlonalexander: and it has nuthin to do with ice breaking LOL RT @salehumar I found the opposite of expression brain","time":1260177673},{"text":"@DavidBrain so you\u0027re a denier that the mini ice age existed? and that the medieval warm period existed?","time":1260178340},{"text":"Impact of the Toba Supervolcano, Sumatra 73,000 yrs ago: 6 years of instant ice-age, temp dropped 16 degC http://bit.ly/6Uh86d","time":1260178524},{"text":"RT @antoineclarke: Funny how people who deny the mini ice age and medieval warm period accuse their critics of believing in a flat Earth","time":1260178662},{"text":"... and in the evening, we have watch Ice Age 3 *-* SOOO FUNNY xD ... I almost forgot we are TEAM JADWARD xD NOW...HAHA...right @MiasUli ???","time":1260181121},{"text":"Nature is more than any human, nothing we can do can change it short of retreating to the stone age. The ice age is coming! #Copenhagen","time":1260182698},{"text":"Get this Video on Demand right now and watch \u0027Ice Age: Dawn of the Dinosaurs\u0027 in few minutes @ http://bit.ly/4D8d7w","time":1260184682},{"text":"That GW must be staving off the Ice Age RT @La_Coqui: It is 6 in Colorado Springs! We really MUST do something about this global warming...","time":1260186432},{"text":"This has to be the coldest day ever... colder then the ice age!","time":1260194979},{"text":"The coming of the ice age: the death of the dinosaurs and the rise of the music industry as artisan economy -... http://tumblr.com/xcx4imqin","time":1260187561},{"text":"General Discussion : Religion \u0026 Politics : In 1975 US government pushed \u0027the coming ice age\u0027... http://bit.ly/7S3O2N","time":1260192598},{"text":"General Discussion : Religion \u0026 Politics : In 1975 US government pushed \u0027the coming ice age\u0027... http://bit.ly/73AFCT","time":1260198026},{"text":"and here\u0027s the warning from 1978 about the encroaching ice age http://bit.ly/7qPyfM #fb","time":1260198288},{"text":"Radiohead- Idioteque: Ice Age coming... Throw it in the Fire! Throw it in the Fire!  http://blip.fm/~hfdzd","time":1260201528},{"text":"mau nonton alvin and the chipmunksnya si @finapinceek gak sempat jga RT @finapinceek: Mau nonton ice age si @rijaghija tapi gak sempat","time":1260189266},{"text":"I\u0027d like to know if C02 emissions caused the retreat of the ice age around 9600 BC!! Or was it just natural global warming? hmmm #climate","time":1260194410},{"text":"http://ping.fm/OtTSL present time of high temps drawing to an endleading into the next ice age. Natl Science Board #76wire #tcot","time":1260199164},{"text":"Animation\u003d\u003e Ice Age - The Meltdown - BLURAY \u003d\u003e http://vix.ir/article40.html","time":1260214812},{"text":"Ice Age DoTD! Funny stuff! hahahah. But nothin beats the @UTURN Horton Hearsawho watch.","time":1260201851},{"text":"Uh-oh ...: ... Science: Another Ice Age? and The Cooling World. http://bit.ly/7yOyfB","time":1260211587},{"text":"i think i am going to watch a movie on my phone in a little bit. either Hell Boy 2 or Ice Age 3. i\u0027m not sure- having a hard time deciding","time":1260207000},{"text":"Are executive salaries headed for a new ice age?: The big freeze for salaried workers\u0027 pay will start to thaw in 20... http://bit.ly/5mwMuM","time":1260213867},{"text":"Discharged papaa bear today. Cnt wait to go home. I\u0027m definitely not lookin fwd to the ice age weather outside","time":1260215519},{"text":"RT @RodDMartin: 1975: US gov\u0027t \u0026 top scientists pushed global cooling and an immenent ice age. http://bit.ly/5e4qfe #tcot #NFRA #climategate","time":1260203792},{"text":"Dates to note for our Facebook contests: ICE AGE contest ends. Dec. 21; UBISOFT Style Lab DS games contest ends... http://bit.ly/4rUOPH","time":1260213167},{"text":"I thought in 1975 the great fear was the coming ice age http://bit.ly/7IBPmH and NOT the BBC\u0027s http://bit.ly/3A08le How quickly they forget.","time":1260215606},{"text":"my only homework today is to watch ice age lol","time":1260221718},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027... http://www.forbes.com/fdc/welcome_mjx.shtml #tcot","time":1260219499},{"text":"are you my my momma?!? - !LOL, I love that saying from Ice Age. http://tumblr.com/xj94izhgz","time":1260224694},{"text":"RT @GordonDeal: Might need an extra layer soon. How an Ice Age could easily return. @wsjthismorning. Water cooler radio. No name-calling.","time":1260225653},{"text":"Har ont i kinderna efter Ice Age 3. S jvla bra! :D","time":1260239686},{"text":"The ice age is coming, the sun is zooming in Meltdown expected and the wheat is growing thin.","time":1260244402},{"text":"Anybody noticed that in Ice Age 3, there\u0027s a part when Crash and Eddie sing like the Chipmunks?","time":1260232338},{"text":"I remember the coming ice age back in 1975 looks like its back. http://skyfire.me/?i\u003d9e2b","time":1260238202},{"text":"@irishspy Snow dropped to 500 feet locally, covered the hilltops and Mt. Diablo. With warming like this, who needs a Little Ice Age?","time":1260241769},{"text":"RT @wrighter Ice Age Disaster Photoshop Tutorial http://bit.ly/78XMAX #photoshop","time":1260244746},{"text":"RT @roaring_repub: In 1975 Gov \u0026 scientists were pushing a Coming Ice Age \u0026 Global Cooling http://bit.ly/4Bj7LM #tcot #ocra","time":1260232282},{"text":"@MKinMotion I love how the fanatics have stopped calling it global warming in an effort to backtrack. Climate change my ass. ICE AGE \u0026gt;.\u0026lt;","time":1260240448},{"text":"Remembering 4th Grade science: carbon dioxide was good for plants, and we were all supposed to help Jimmy Carter stop the coming ice age...","time":1260240762},{"text":"Just remener the largest creatures ever to roam earth were made extinct from ice age! @the1klamb: #tcot #tlot #cop15 Exhaling is so passe\u0027.","time":1260240776},{"text":"Once the earth gets warm enough, it will seek balance, which will be achieved by closing the NAtlantic current, plunging us in to an ice age","time":1260240876},{"text":"@SharkGoddess They have to melt sometime. They are remnants of the Ice Age.","time":1260249985},{"text":"Now all I need is Scrat and I\u0027d have a complete ice age!!","time":1260252069},{"text":"Shall ta pao and watch Ice Age 3 at home today XD Weeee...","time":1260258981},{"text":"@adamsbaldwin AGW expert, if by expert you mean GW started back at the end of the ice age. Hey, I get that!!!","time":1260246574},{"text":"@BrotherDante ALSO we actually had a little ice age from the 1900s to 1980s.. now the earth is just renewing and doing the processes","time":1260253996},{"text":"WORLD MYSTERIES features amazing discovery ICE AGE ATLANTIS fringe science japan http://www.world-mysteries.com/mpl_10_atlantis_asmith.htm","time":1260248181},{"text":"15. Picture_2_normal todayswall Ice age 2: http://alturl.com/2oii Enjoy! #IA2 #movies #wallpapers #android 4 days ago from web","time":1260251656},{"text":"@ImARi0t what a ka-wink-e-dink i\u0027ve been watching movies wit my lil bro \u003d) resident edil 1\u00262 and ice age: meltdown *I lOvE eLaDiO*","time":1260251917},{"text":"watching Ice Age 3 with my sis. its so funny!","time":1260265075},{"text":"A new ice age http://bit.ly/6mb3g7","time":1260260869},{"text":"RT @whitneyjene: watchin Ice Age, cute! What happened to the kissing part?","time":1260267284},{"text":"all the squirrels in the world will be totally oblivious to this because they are busy storing nuts for the upcoming ice age...TOMORROW!!!","time":1260267970},{"text":"With Gordon Brown backing the climate change agenda expect a new ice age to commence shortly","time":1260268523},{"text":"Many of you are too young to remember, but in 1975 our government pushed the coming ice age. http://bit.ly/4Q5rh2 #tlot #tcot #climategate","time":1260259650},{"text":"@McGiff I agree with you 100%! almost arrogant to assume man can alter the planet\u0027s climate! Look at Ice Age, they\u0027ll tax us for that next!","time":1260263103},{"text":"@bobsaget Slothman Cometh! Sounds like a movie title, they already parodied Mr. and Mrs. Sloth move fast they just found ice age sloth.","time":1260269777},{"text":"RT @JonChevreau: RT @financialpost: Executive salaries headed for new ice age?:Not a gd time to negotiate a major raise http://bit.ly/89nnkJ","time":1260273474},{"text":"Did you watch Man On Earth? I\u0027m scared. We have been here for such a short time and next Ice Age will kill billions of us! http://ow.ly/JPKI","time":1260266220},{"text":"@SEANLOCK You still use fingers? What is this the ice age?","time":1260276537},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027... http://bit.ly/6kMOeB","time":1260275912},{"text":"CLIMATE CHANGES ARE CYCLICAL: We do not have any record of The Ice Age, or Of The Period When","time":1260284772},{"text":"RT @SkuterP: In 1975 US government pushed \u0027the coming ice age\u0027...: http://bit.ly/4PTNIW via @addthis","time":1260285740},{"text":"RT @SkuterP: In 1975 US government pushed \u0027the coming ice age\u0027...: http://bit.ly/4PTNIW via @addthis","time":1260285798},{"text":"RT @SkuterP: In 1975 US government pushed \u0027the coming ice age\u0027...: http://bit.ly/4PTNIW via @addthis","time":1260285962},{"text":"Bought some nice stuff to decorate my house with..and some presents for friends..oh yea and ice age 3 on blueray :D w00h00","time":1260276234},{"text":"The dark ages/ mini ice age had less atmospheric CO2 than now. We can freeze, live with rats, and make babies","time":1260277040},{"text":"It was the warmest decade since temp. record keeping began in the 1850\u0027s. That was the end of theLittle Ice Age now it\u0027s warmer.thank God.","time":1260277629},{"text":"@TheGourmetGirl Have we slipped into Ice Age and somebody forgot to tell me? \u003c -35 with wind chill here in #yeg this morning...I\u0027d say yes","time":1260277660},{"text":"RT @Rxrthepoet: It was the warmest decade since temp. record keeping began in the 1850\u0027s. That was the end of theLittle Ice Age now it ...","time":1260277676},{"text":"Gar nicht mal so einfach sich die Zhne zu putzen und dabei mit The Horrors New Ice Age zu singen.","time":1260278973},{"text":"GUD MORNIN GOT 1 CLASS 2DAY THIS IS DA FINAL PROJECT BIG SCENE 4 AN ACTING CLASS I PRAY I DO GUD 2DAY N IT IS DA ICE AGE 2DAY!!!","time":1260280403},{"text":"RT @ArtJonak: In 1975 US Govt pushed \u0027the coming ice age\u0027 \u003d\u003e http://su.pr/1idKr1 | With Govt it\u0027s always been about $ \u0026 power, not the","time":1260284921},{"text":"I wonder if the Climategate folks will abandon global warming \u0026 return to their Ice Age position again, warning of impending doom? #DPOST","time":1260286104},{"text":"RT @ArtJonak: In 1975 US Govt pushed \u0027the coming ice age\u0027 \u003d\u003e http://su.pr/1idKr1 | w/ Govt it\u0027s always bn abt $ \u0026 power, not the earth.","time":1260282621},{"text":"Back in 1974 we were doomed to have another ice-age. I don\u0027t make this stuff up. I PROMISE. Climate dudes did. http://tinyurl.com/ycqsc3g","time":1260286149},{"text":"HOLLY CRAP IS THIS A NEW ICE AGE OR WHAT ??? 37 \u003c\u003c at my house right now !!","time":1260288558},{"text":"I was taught; a \u0027wobble\u0027 in the earth\u0027s axis anglle;caused the Great Ice age; now it\u0027s all due to \u0027global warming\u0027#.","time":1260288799},{"text":"@DemiDelia same jus tryin to stay warm and not get sick during this ice age we goin thru lol","time":1260291321},{"text":"RT @KOSMOSNET: In 1975 our government pushed the coming ice age. http://bit.ly/4Ot76j #tcot #tlot #globalwarming","time":1260301535},{"text":"Just entered the Ice Age 3 Blu-ray contest! 1 Copy! Win by following @WeekinRewind and RT. http://xr.com/ofi He follows back!","time":1260288780},{"text":"WORLD MYSTERIES features amazing discovery ICE AGE ATLANTIS fringe science japan http://www.world-mysteries.com/mpl_10_atlantis_asmith.htm","time":1260297216},{"text":"I rented Away We Go, Ice Age 3 and Spinal Tap.","time":1260313056},{"text":"I guess I missed the point at which the Earth entered the next ice age. http://twitpic.com/spps2","time":1260306536},{"text":"RT @jamessanford: Why is it every time we have accumulating snow people behave as if the new Ice Age has begun? Stay home, shut up and c ...","time":1260310766},{"text":"In 1975 US government pushed \u0027the coming ice age\u0027... http://plu.gd/4A4","time":1260319618},{"text":"SnowDay 120709: NorCal Ice Age Terror Update http://post.ly/EVrn","time":1260327309},{"text":"I WAS watching the changling but Jordan wanted to interrupt it to watch Ice Age...wutever;)","time":1260329946},{"text":"@nickjonas, One day, Nicholas, one day you will tweet me back. let\u0027s just make it before the next ice age. okay? THANKS. : )","time":1260322616},{"text":"RT @MOLA1: @questmcody By the way, I watched that battle. Hahahaha! You killed it. Zambony, Ice Age, 8yrsOld, too many hits to count.","time":1260319463},{"text":"Time Magazine, 1974: Scientists suspect climatic upheaval; weather aberrations may be harbinger of another ice age http://bit.ly/6UKzCf #p2","time":1260320447},{"text":"Got a little overboard renting movies tonight. Our selection: Ice Age 3, My Sister\u0027s Keeper, Coco Chanel, Julie \u0026 Julia, Entourage season 5","time":1260322401},{"text":"@TonyDurant35 Yeah I know right...lil will had me watching Ice age dawn of the dinosaurs again tonight and that movie is funny...lol","time":1260328062},{"text":"I WAS watching the changling but Jordan wanted to interrupt it to watch Ice Age...wutever;)","time":1260333885},{"text":"Watchn ice age.!! Can\u0027t sleep lots on my brain.!!","time":1260344162},{"text":"A world so cold, we live in the new ice age trust what I\u0027m sayin....just look at what\u0027s going on in the world","time":1260338882},{"text":"@imalbert OMG it\u0027s so cold I think we are in an ice age. Not global warming this is painful!!!","time":1260341039},{"text":"Watchin ice age 3 then goin to look at the xmas liks in palos verdes ,not the same w/out her around","time":1260341801},{"text":"i\u0027ve been down here so long, it feels like out to me. buckminster - Ice Age III. like this !","time":1260344285},{"text":"RT @10thAmendment: RT @katyinindy: In 1975 US government pushed \u0027the coming ice age\u0027 http://tinyurl.com/ycqsc3g #tcot #gop #hhrs #sgp","time":1260344106},{"text":"Which country was responsible for the last ice age, and all the extinctions of animals from dinosaurs to mammoths? (Can\u0027t blame the U.S.)","time":1260344255},{"text":"DNN Radio: Are We on the Brink of An Ice Age?: Are we so focused on global warming that we\u0027re unprepared for th.. http://bit.ly/4SnP3D","time":1260333580},{"text":"@ThisIsJamieWatt haha you so have to see ice age 3!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","time":1260351440},{"text":"@VintageDeli Try the Cliffs at West Runton - they\u0027re full of ice-age remains and forestry, all layered at the bottom of the cliff. Cool!","time":1260351413},{"text":"@tyseale I said that 5 years ago and my mother almost disowned me. We see a microview, whereas the macroview has ice age cycles.","time":1260353146},{"text":"on my own at the back of the class watching ice age 3, because I\u0027m ill and noone wants to catch it lool","time":1260354989},{"text":"Big Freeze: Earth Could Plunge into Sudden Ice Age http://tinyurl.com/ykxvrxd","time":1260357600},{"text":"BACK WHEN OBAMA WAS JUST A SNOT NOSED KID:In 1975 our government pushed THE COMING ICE AGE. http://ow.ly/K9Je #tcot #tlot #COPENHAGEN","time":1260346073},{"text":"I unlocked Ice Age in Charmed! http://bit.ly/5cJ4oJ","time":1260362149},{"text":"Tupai ice age namanya seat kan? :p RT @nessaleo: @verenaccc wakkkkakak.. Asikan ngatain lo MIRIP TUPAI ICE AGE dong! Hahahhah..","time":1260363540},{"text":"Read: The Coming Ice Age by @KevinDayhoff #TheTentacle on #Climategate #Cspan @Cspan http://thetentacle.com/ShowArticle.cfm?mydocid\u003d3501","time":1260368577},{"text":"If u black and ya baby look like the baby from ice age #188845maury","time":1260372932},{"text":"@brcannady We didn\u0027t listen. Global Warming has brought on a new ice age. You can\u0027t go outside, you\u0027ll freeze to death.","time":1260372359},{"text":"A penguin just walked by my window RT @sarahk47 Maybe those guys in the \u002770s who predicted we were heading for an ice age were right.","time":1260373671},{"text":"well at least i know one thing, when the next ice age comes, those of us used to the cold are better off than the palm tree clans!","time":1260374167},{"text":"Ada di pencil gua loh RT @luisahartana: Tupai ice age namanya seat kan? :p RT @nessaleo: @verenaccc wakkkkakak.. Asikan ngatain lo MIRIP TUP","time":1260363709},{"text":"We have a few New Relese Dvds in this week in Albox!! The Proposal Genova My Sisters Keeper Ice Age 3 Why not pop... http://bit.ly/7P8TXU","time":1260364885},{"text":"@jane_l I haven\u0027t seen enough snow for a sled in years, but the way things are going w global warming we\u0027ll have another ice age in no time","time":1260373401},{"text":"holy cow Batmen It\u0027s the Return to the Ice Age at www.yourpersonalbutler.net","time":1260384793},{"text":"and it just keeps snowing... and snowing... and snowing. I swear there is going to be another Ice Age! :O","time":1260375670},{"text":"RT @CindyTingley: Possibly...the ice age may be back! LOL/no, I\u0027m actually serious. you\u0027re very welcome. at any time!","time":1260383385},{"text":"@mediaRif That was the Ice Age III billboard advertisement... And fix your car heater!","time":1260383482},{"text":"http://twitpic.com/st4px My friends, it\u0027s storming outside. It feels like an ice age in my own yards. #winter","time":1260374874},{"text":"Word to the Eco idoits! Were going into an ice age! Put down the bong and everything will be fine. We to warm the planet more!","time":1260382268}]
[{"text":"The premiere of Ice Age 3!! - http://tweet.sg","time":1245857005},{"text":"iTunes top movie: Ice Age: The Meltdown - Carlos Saldanha http://tinyurl.com/mhe845","time":1245853744},{"text":"see ice age 3D before the rest of the UK , listen to my show from 3 Thursday and Friday !!!","time":1245853761},{"text":"http://twitpic.com/8aeee - Aaah die zijn ook al super sgattig, net als die van ice age! \u003d)","time":1245853600},{"text":"At least 35k years ago, in the depths of the last ice age, the sound of music filled a cave in what is now SW Germany http://bit.ly/Ns0RN","time":1245859181},{"text":"I asked for a fucking ice age toy.","time":1245865090},{"text":"ice age is oot nxt weds :D","time":1245861513},{"text":"Just saw an Ice Age advert. WTFing at the dinosaurs ???","time":1245862302},{"text":"@thehorrorsnews i \u0026lt;3 new ice age (: [-the-new-album-]","time":1245863958},{"text":"Ice_Age_3_DVDFiX_XBOX360-iCON http://tinyurl.com/l7zuvr","time":1245863092},{"text":"vendo o novo trailer de ICE AGE 3 - Dawn Of The Dinosaurs...","time":1245867966},{"text":"Ice Age 3: El origen de los dinosaurios. Estandarizacion prehistorica http://tinyurl.com/lyzqgk","time":1245861954},{"text":"David\u0027s excited to see Ice Age 3D. Of course he is. *grins ridiculously*","time":1245864929},{"text":"Carbon dioxide not to blame in ice age mystery http://bit.ly/q1rKp","time":1245865573},{"text":"Tem safra boa chegando nos cinemas. Public Enemies, Ice Age, Bruno... #contagemregressiva","time":1245868425},{"text":"wat is this the bloody begining of ice age and am i supposed 2 b dragging my ass off 2 skwl ha ok relaxe k its jus 2 mre days ryt","time":1245861316},{"text":"RT @flower_mound: Dive in Movie at the CAC indoor pool Friday at 8 p.m. Showing of Ice Age: The Meltdown included with paid admission.","time":1245868552},{"text":"Sentado en el cine a punto de ver Up!. Aqui una foto con el de Ice Age 3, jaja http://twitpic.com/8b1ou","time":1245866455},{"text":", . ..~~3 ICE AGE 3 DAWN OF THE DINOSAURS ,, ,","time":1245882960},{"text":"Ice Age: The Great Depression in 4!!!","time":1245886454},{"text":"Ice Age 3 looks good. I\u0027m excited to see it.","time":1245887507},{"text":"Ice Age 1 und 2 http://digg.com/u16c6X","time":1245885220},{"text":"how good are 3D films now? Just saw Ice Age 3 - felt like I was there!","time":1245874189},{"text":"http://bit.ly/6j4SL She\u0027s just like her mother. Thank Godness xD (Ice Age 3)","time":1245876904},{"text":"Ice Age 3 Goodie Bag for every reader - only in The Sun\u0026#8207; http://bit.ly/193aRZ","time":1245877304},{"text":"aw man why did they have to throw in the Ice Age advertisement as part of the wipeout qualifier. boooo!","time":1245880945},{"text":"ICE AGE: DAWN OF THE DINOSAURS - IN THEATERS WORLDWIDE JULY 2009 http://ow.ly/fMRL","time":1245884473},{"text":"RT @PoetryChaikhana: People have always made music... Flutes from the ice age are discovered. http://bit.ly/FovJ1 \u003c- WOW!","time":1245877978},{"text":"RT @PoetryChaikhana -People have always made music... Flutes from the ice age are discovered. http://bit.ly/FovJ1","time":1245878089},{"text":"@candesgirl That\u0027s why I included the \u0026lt;3. :D Also there is never any reason to not be excited about cake. And Ice Age 3 ftw!","time":1245879957},{"text":"watching ice age","time":1245896486},{"text":"Public enemies and ice age look","time":1245897602},{"text":"my little ones can\u0027t wait to see ice age","time":1245888572},{"text":"  Ice Age 3  orz http://plurk.com/p/13p9r3","time":1245888657},{"text":"[]3 Ice Age: Dawn of the Dinosaurs http://bit.ly/ayDwD","time":1245889872},{"text":"The Great Lakes formed by end of Ice Age. http://tinyurl.com/396lbp What caused that? Methane from Dinosaurs? #energy #economy","time":1245892302},{"text":"funderar p hur det blir med Ice Age 3","time":1245908589},{"text":"Ice Age 3 - Eggsicles --http://bit.ly/2c0NBi","time":1245909642},{"text":"ICE AGE 3 - Filmstart - Stuttgart - Esslingen http://bit.ly/5yHYW","time":1245910892},{"text":"Ice Age: Dawn of the Dinosaurs (2009) http://bit.ly/PHgTE","time":1245911988},{"text":"dinosaurs pictures  McDonald\u0027s Announces \u0027Ice Age\u0027 Happy Meals ... http://tinyurl.com/ltrrm8","time":1245911543},{"text":"win tickets for an EXCLUSIVE preview of ICE AGE 3 at the Odeon, Printworks Manchester http://tinyurl.com/kjuqx7","time":1245914246},{"text":"That\u0027s the kind of email I like to see, Ice Age is on the way for me to review. Certainly not expecting much but it\u0027ll make a change!","time":1245915919},{"text":"@akosimarj mag-twister fries ka na rin dyan! :) get the ice age meal \u0026gt;\u0026gt;\u0026gt; comes with a blue-colored soda float. :)","time":1245903914},{"text":"boom boom akkalakka akkalakka boom boom akkalakka boom boom...I love that commercial I gotta go see ice age and its in 3d!!!!!!!!","time":1245909016},{"text":"Exclusive: The Ice Age: Dawn of the Dinosaurs Cast: ComingSoon.net talked exclusively to Ray Romano, John Leguiz.. http://migre.me/2Nxh","time":1245909885},{"text":"Exclusive: The Ice Age: Dawn of the Dinosaurs Cast: ComingSoon.net talked exclusively to Ray Romano, John Leguiz.. http://migre.me/2Nxh","time":1245909906},{"text":"Exclusive: The Ice Age: Dawn of the Dinosaurs Cast: ComingSoon.net talked exclusively to Ray Romano, John Leguiz.. http://bit.ly/SLIt8","time":1245914552},{"text":"Ice Age 3-ViTALiTY http://tinyurl.com/n27m3d","time":1245921267},{"text":"Jeeee jau ijo Ice Age 3. Varom kapot :D","time":1245925798},{"text":"Walk the dinosaur - Ice Age 3: http://bit.ly/LJQgN LOL","time":1245926474},{"text":"Ice Age - Dawn of the Dinosaurs - Hollywood movie stills http://tinyurl.com/lxagnw","time":1245917116},{"text":"Drukdrukdruk met repo over Ice Age 3, om te gieren!! @ Boulevard. http://www.iceagemovie.com","time":1245918477},{"text":"http://twitpic.com/8d5fs - mcd\u0027s ice age happy meal","time":1245924489},{"text":"says Ice Age 3: Dawn of the Dinosaurs looks cute as ever ! HAHAHA . http://plurk.com/p/13v0pl","time":1245924983},{"text":"RT: @anca_n: Ice Age 3! abia astept!! http://bit.ly/dmWUK (via @OLiXbOLiX)","time":1245924995},{"text":"Ice Age 3 drinking game. Every time you spot an anachronism have a drink. Can u make it through the first halfhour.","time":1245929071},{"text":"10k b.c. Have giant mammoth, sabertooth n dodo bird. Compare 2 ice age.. Tat\u0027s super size - http://tweet.sg","time":1245922738},{"text":"Ice Age 3-ViTALiTY:  Size: 3.78 GB Genre: Platformer Gamespot : Click here IGN: Click here IGN Rating: N/A.. http://snipurl.com/kujmx","time":1245922743},{"text":"Ice Age 3 [PAL] [Multi6] [Spanish] [PS2DVD] [www topeconsolas com]: Category: Games Subcategory: PS 2 Size: 4.. http://tinyurl.com/kqrgyc","time":1245923205},{"text":"Ice Age 3-ViTALiTY ***XtremeSpeeds.Net***: Category: Games Subcategory: Windows - Kids Games Size: 3.78g.. http://tinyurl.com/knknjt","time":1245923220},{"text":"Ice Age 3!!!","time":1245945592},{"text":"WHO WANTS TO SEE ICE AGE 3 ON WEDNESDAY?!","time":1245944416},{"text":"RSS: Ice age quest http://tinyurl.com/ksuzrb","time":1245931664},{"text":"Convites Ice Age 3 :D eheh http://twitpic.com/8dku9","time":1245936777},{"text":"Ice Age game that I found on itunes store today. http://mypict.me/5D10","time":1245943800},{"text":"I really liked the movie. now I can go see the new Ice Age!","time":1245944741},{"text":"Ice_Age_Dawn_Of_The_Dinosaurs_USA_Wii-WiiZARD: Release:Ice_Age_Dawn_Of_The_Dinosaurs_USA_Wii-WiiZARDReleas.. http://tinyurl.com/ngv4tv","time":1245940638},{"text":"RT @mountainxpress That WipeOut episode also reeled me into wanting to see the new Ice Age. #wipeout","time":1245937569},{"text":"RT @oceandata: RT @LabSpaces: Ice age ocean full of life - http://is.gd/1dakr","time":1245941048},{"text":"Ice_Age_Dawn_Of_The_Dinosaurs_USA_Wii-WiiZARD http://tinyurl.com/m5pluv","time":1245942133},{"text":"ICE AGE: DAWN OF THE DINOSAURS - Jun 27 - Leawood, KS: Saturday Jun 27 AMC Town Center Leawood, KS http://bit.ly/nmp8Q","time":1245935937},{"text":"Se sumerge Ice Age 3 en el mundo de los dinosaurios y la maternidad http://tinyurl.com/ls6s3g","time":1245936885},{"text":"@kkfriska ohh.. kalo vd lauch ice age 3.. hhe.. kalo echa ga tau deh.. paling nemenin tompi nyanyi.. :D","time":1245937274},{"text":"El videojuego de Ice Age 3: El Origen de los Dinosaurios llega a los moviles http://bit.ly/xUwch","time":1245942590},{"text":"\u0027Ice Age #?\u0027 ads have original (rockin\u0027) version of Walk the Dinosaur in my head. For days. Was (Not Was). http://tinyurl.com/5uxun7","time":1245943918},{"text":"Ice Age 3 *2009* PAL( EN DE FR IT NL KOR ESP CHN)(wii) 2Lions-Team: Category: Games Subcategory: Wii Size: 4.3.. http://tinyurl.com/mjvfwf","time":1245941331},{"text":"@prettylidy When does Ice Age come out?","time":1245950203},{"text":"@ELmattic mark called you SId from ice age hahah","time":1245946852},{"text":"Still in love with Ice Age 3 artwork! http://bit.ly/jj8sf","time":1245949811},{"text":"@ReaganGomez CANT WATE TO TAKE LIL STEVEN TO SEE ICE AGE","time":1245955343},{"text":"http://twitpic.com/8e702 - ICE AGE 3 Teens chillin in wave pool @rfunhfalls","time":1245948684},{"text":"@Ze3ky u no there\u0027s a new ice age movie coming out","time":1245950980},{"text":"ICE AGE: DAWN OF THE DINOSAURS - Jun 26 - Fenton, MO: Friday Jun 26 Great Escape at Gravois Bluffs Fent.. http://bit.ly/bksX7","time":1245950414},{"text":"RT @RFunFalls: The Ice Dump was crzy!!! The kids luvd it-look 4 it on the news 2nite! Come back @ 5pm for another 1! See Ice Age 2 @ dusk!","time":1245954028},{"text":"Ice age ocean full of life: The equatorial Pacific Ocean was better at locking carbon away at the bottom of the .. http://tr.im/pLHF","time":1245954463},{"text":"Area51 Downloads: Ice Age 3: Dawn of the Dinosaurs [PS2] http://twurl.nl/wisamv","time":1245973669},{"text":"OK I was on last nite! They said my real name Allanna Warren, not my nick name. U need to watch the entire show, I luv Ice Age!","time":1245968658},{"text":"Ice age 3!!!","time":1245980909},{"text":"Ice Age: Dawn of the Dinosaurs (2009) http://bit.ly/Ftgvi","time":1245983776},{"text":"Ice Age: Dawn of the Dinosaurs (2009) http://bit.ly/14Nxkk","time":1245983778},{"text":"Ice Age: Dawn of the Dinosaurs (2009) http://bit.ly/30Upv","time":1245983779},{"text":"New Ice Age 3 Pics: 20th Century Fox just sent us over a slew of pictures from the upcoming Ice Age: Dawn of the.. http://tinyurl.com/nuk6da","time":1245985953},{"text":"@douglaswcooper I have often thought the same thing about Global Warming; we are, after all, still coming out of the ice age.","time":1245979513},{"text":"@gravitationally ik. rn i\u0027ve got ice cream, italy, i constantly thank god for esteben, internet, and ice age the movie :/","time":1245988511},{"text":"Cant wait to see Ice Age 3 in 3D! The trailer is hellarious. XD","time":1245991691},{"text":"Ice Age 3 also has images - http://bit.ly/10P6L3","time":1245997118},{"text":"http://bit.ly/26n4gf - Ice Age games","time":1245997455},{"text":"Excited RT: @cioa FILM: Ice Age: Dawn of The Dinosaurs. http://www.iceagemovie.com/ #movie #iceage3","time":1245992481},{"text":"i wanna watch ice age 3. kea lng july pa.. ok. i\u0027ll wait nalang haha \u003d]","time":1246001118},{"text":"Preview: Ice Age 3: Dawn of the Dinosaurs Trophy Liste http://tr.im/pPTi","time":1246001576},{"text":"Blogging \u0027Check out our exclusive clip from \u0027Ice Age: Dawn of the Dinosaurs\u0027\u0027 http://bit.ly/r0D1K","time":1245989028},{"text":"LA: Spent one hour today learning about the fascinating treasures of LA\u0027s Ice Age Tar Pits at the Page Museum. See: http://tarpits.org/ ^AL","time":1245991728},{"text":"Don\u0027t want 2C new Ice Age: Dawn of Dinos. Everyone knows dinos came b4 mammals. So historically wrong. Or am i just a paleotological nerd?","time":1245994263},{"text":"deci m-am inscris la concurs pentru bilete la Ice Age. http://www.cinemarx.ro/ice-age-3/","time":1246008957},{"text":"Filmtip: Ice Age http://bit.ly/Sxe1U","time":1246007754},{"text":"Ice Age 3 (PC Game): Procurando Filmes? Clique Aqui e Encontre Milhares de Filmes GRTIS! Ice Age: Dawn of .. http://bit.ly/tNPwE","time":1246008748},{"text":"Ice Age 3, cel mai amuzant din serie - Vineri a avut loc prima vizionare a filmului Ice Age 3 n Ro http://tinyurl.com/nt9hvp","time":1246014475},{"text":"\u0027...an exemplary marriage of precise, well-paced storytelling enhanced by 3D effects in an adventure-packed ride.\u0027 Screen on Ice Age 3","time":1246008395},{"text":"Concurs Cinema City: 2 bilete la Ice Age 3 D: Cinema City in colaborare cu kristofer93.com organizeaza periodic,.. http://tinyurl.com/lq6nj7","time":1246012440},{"text":"Ice Age 3  das Gewinnspiel zum Movie: Sie kennen Manni, Sid, Diego und Scrat nicht? Dann wird es hchste .. http://tinyurl.com/lnneto","time":1246016256},{"text":"ICE AGE 3!! Must watch. Must watch.","time":1246024398},{"text":"@thecraftyninja ice age 2, not a patch on first one, but way better than either Garfield ;-)","time":1246024328},{"text":"follow friday @aaronnjohnson you best take me to ice age 3 for this aaron! :L x","time":1246030080},{"text":"Prepare for ice age. RT @PragerRadio: On the show today: Is Global Warming theory starting to ripen and rot? And, Happiness Hour. #dprs","time":1246022189},{"text":"another moviee!! :) ICE AGE 2 :)","time":1246032826},{"text":"Me and @andreaaaxx wanna see Ice Age 3. Just thought we\u0027d let you know.","time":1246037315},{"text":"Ice Age kijken en verder lkr rlx\u0027en ;-)","time":1246039009},{"text":"kwil Ice Age zien op rtl5 maar is k*t kwaliteit :s","time":1246038322},{"text":"Follow Friday: go check out funny ass @Sallismoney \u0026 tell him to LOAN me 2 kids under 10 so I can go see Ice Age! LoL","time":1246040967},{"text":"@labellacook Ha! What was I thinking leaving home without my taser? We are taking ten 7 year old boys to see the Ice Age movie. I\u0027m scared.","time":1246044308},{"text":"ice age \u0026lt;3","time":1246055769},{"text":"Tired!! Watching Ice Age is fun :P","time":1246048819},{"text":"Ice Age: Dawn of the Dinosaurs Cheats, Ice Age: Dawn of the ... http://bit.ly/4aijTK","time":1246055348},{"text":"ice age kijken :S. en heb een 9.3 voor wiskunde gehaald in de pww. ;-).","time":1246046653},{"text":"Ice Age: Dawn of the Dinosaurs Trophy List Revealed: http://bit.ly/nguB4","time":1246046826},{"text":"Om niet volledig krankzinnig te raken van het benauwde weer naar Ice Age aan het kijken...","time":1246047184},{"text":"@frankparker Ah, so it is! She\u0027s very mature - but Ice Age 3 seems to be swinging the vote! Thanks so much for responding so well :)","time":1246055671},{"text":"Don\u0027t we all..RT @AlSharpTongue I want a girl like they squirrel from Ice Age. That will travel abroad and face incredible odds for that ...","time":1246055096},{"text":"My Sister\u0027s Keeper was a tear jerker but i knew it would be b/c i read the book first. can\u0027t wait to see Ice Age 3 on July 1st!","time":1246059746},{"text":"RT @JAHFITZ: idk if u guys realize dat the world is about to go into another 1 of those ice age things where every1 dies and new life forms","time":1246048339},{"text":"Ice_Age_3_java http://bit.ly/3Lcwf","time":1246065881},{"text":"laying in bed watching ice age and making bracelets, i have already made 6","time":1246063754},{"text":"Capsule reviews: `Ice Age\u0027 and other films http://tinyurl.com/qhvzag","time":1246071842},{"text":"Capsule reviews: `Ice Age\u0027 and other films (AP): Capsule reviews of films opening this week:Ice Age: Dawn of th.. http://tinyurl.com/o5r85h","time":1246069947},{"text":"#movies Review: `Ice Age\u0027 is `yawn of the dinosaurs\u0027 tale (AP) http://bit.ly/mbfQh","time":1246060825},{"text":"EVERY SINGLE TIME THE COMMERCIAL FOR ICE AGE 3 COMES ON I START CRACKING UP! Open the door get on the floor, everybody walk the dinosaur!","time":1246062480},{"text":"http://tinyurl.com/plzlgh \u0027Ice Age: Dawn of the Dinosaurs\u0027 Queen Latifah Music Video video","time":1246065506},{"text":"Capsule reviews: `Ice Age\u0027 and other films - The Associated Press http://bit.ly/sUYpr","time":1246065522},{"text":"Yeah like the guy in the $3,000 suit is gonna see ICE AGE 3 at 9am on a Saturday with a bunch of kids. C\u0027MON!!!","time":1246070322},{"text":"Carboniferous Climate: http://bit.ly/19rznc (Ordivician Ice Age w/~12X today\u0027s atmospheric CO2)","time":1246070501},{"text":"says Target selanjutnya: ice age 3 :p http://plurk.com/p/14cejj","time":1246071039},{"text":"Capsule reviews: `Ice Age\u0027 and other films http://bit.ly/T9rvt","time":1246072577},{"text":"At the Movies: capsule reviews of \u0027Ice Age\u0027 and other films this week http://bit.ly/Nthrp","time":1246075144},{"text":"RT @kidranger The arrogance of man to believe we are ruining the planet. Was it Global Warming that melted the ice during ice age?","time":1246062868},{"text":"Capsule reviews: `Ice Age\u0027 and other films (AP) : AP - Capsule reviews of films opening this week: http://tinyurl.com/rxlhps","time":1246063752},{"text":"chittimca3 Capsule reviews: `Ice Age\u0027 and other films (AP) : AP - Capsule reviews of films opening t.. http://bit.ly/22GUxO","time":1246065014},{"text":"Ice Age: Dawn of the Dinosaurs, Public Enemies, Dead Snow on Film Geek Central will air 07/05. http://tobtr.com/s/586630 #BlogTalkRadio","time":1246067701},{"text":"Review: `Ice Age\u0027 is `yawn of the dinosaurs\u0027 tale (AP) : AP - There\u0027s more action and cuddly creatures for kid.. http://digg.com/u16nQC","time":1246068143},{"text":"broke A.I. at the first act mark*, since SOME OF US have to be up for Ice Age: A Dinosaur\u0027s Story in the ayem. (*The sick son? What a dick.)","time":1246073502},{"text":"Simon Pegg: Life after Star Trek: Scotty on Ice Age 3, making it in LA, Trekkies, and coming home http://bit.ly/10QyNS","time":1246074626},{"text":"OTTO WALKES kommt nach ESSEN. Am 1. Juli kommt Otto zur Vorfhrung des Films ICE AGE 3 in die Lichtburg. http://is.gd/1fz8J","time":1246074691},{"text":"RT @SheShe18: @Pressure225 mannn fuck dat avatar movie! u need to go c ice age 3d mah manzz lol (ill leave dat 4 u n dee) lol","time":1246063699},{"text":"Excited about going to see advanced screening of ice age in morning!","time":1246079145},{"text":"Capsule reviews: `Ice Age\u0027 and other films http://bit.ly/10GCCo","time":1246082130},{"text":"Vid: Exclusive clip of Ice Age 3 available http://bit.ly/11dH7","time":1246085041},{"text":"Review: `Ice Age\u0027 is `yawn of the dinosaurs\u0027 tale http://tinyurl.com/pxd952","time":1246085724},{"text":"Buy Monavie Gel Review: `Ice Age\u0027 Is `yawn Of The Dinosaurs\u0027 Tale: Movie Review: `Ice Age\u0027 Sequel.. http://bit.ly/TERKL","time":1246087299},{"text":"neuer Blogeintrag: Ice Age 3: Die Dinosaurier sind los! alle deutschen 3D-Spielorte http://ow.ly/15Ggsy","time":1246077184},{"text":"@she_hulk3 What movie?? Monsters Vs. Aliens?? Or Ice Age 2?? lol Dunno which i put on hurr..","time":1246082814},{"text":"Capsule reviews: `Ice Age\u0027 and other films http://tinyurl.com/ocv9aw","time":1246083428},{"text":"Review: `Ice Age\u0027 is `yawn of the dinosaurs\u0027 tale (AP) http://tinyurl.com/qkhxsr","time":1246084737},{"text":"Ice Age 3 trailer - Dawn of the Dinosaurs - Aaaaa, I thought you where a Female http://bit.ly/OojkG :-)","time":1246085175},{"text":"Story: Ice Age 2 the Movie to Play Monday Night http://www.londonderrynh.net/?p\u003d10188","time":1246086014},{"text":"The French Socialists were trying to bring down Capitalism then, and tried to say Capitalism was bringing about another Ice Age.","time":1246086498},{"text":"Capsule reviews: `Ice Age\u0027 and other films: The main thing that distinguishes this movie from its predecesso.. http://tinyurl.com/ocv9aw","time":1246083440},{"text":"Review: `Ice Age\u0027 is `yawn of the dinosaurs\u0027 tale (AP): There\u0027s more action and cuddly creatures for kids to lov.. http://twurl.nl/y1zoh2","time":1246083969},{"text":"Capsule reviews: `Ice Age\u0027 and other films: The main thing that distinguishes this movie from its predecesso.. http://bit.ly/9qO5C","time":1246085939},{"text":"Capsule reviews: `Ice Age\u0027 and other films: The main thing that distinguishes this movie from its predecesso.. http://tinyurl.com/ocv9aw","time":1246088313},{"text":"Ich habe beim Spiel http://is.gd/yOJc 10300 Punkte erspielt. ICE AGE 3: DIE DINOSAURIER SIND LOS  Ab 1. Juli im Kino! #IA3SES","time":1246085826},{"text":": - Ice Age: Dawn of the Dinosaurs http://htxt.it/mzkI","time":1246090442},{"text":"saturday night.alone.ice age 2.what a perfect night!zzz","time":1246094486},{"text":"I wanna watch Ice Age :)) Memorize ko ung first one :)) joke","time":1246096697},{"text":"Just bought tix for preview of Ice Age 3D at #eiff . Very excited.","time":1246097312},{"text":"i can\u0027t wait to see the new ice age film! looks so funny","time":1246098835},{"text":"Ice Age is yawn of the dinosaurs tale: There\u0027s more action and cuddly creatures for kids to love in Ice Age: Daw.. http://cli.gs/PUSqD","time":1246094019},{"text":"Ice Age: Dawn of the Dinosaurs Cheats, Ice Age: Dawn of the ...: GamesRadar specializes in providing cheat codes.. http://bit.ly/17SgZW","time":1246099037},{"text":"says mga kids .. nuod tau ice age 3 .. hahaha .. (LOL) http://plurk.com/p/14fok3","time":1246097847},{"text":"Film review: Ice Age 3 a \u0027yawn of the dinosaurs\u0027 tale http://bit.ly/v9e9s","time":1246101939},{"text":"At da movies to see ice age 3, afta dat to a play n den to bbq\u0027s yummy","time":1246102333},{"text":"At the Ice Age 3D early screening with @Biso_Fly @zach_stein @Whitney_bossie so amazing","time":1246103743},{"text":"uh-oh. Promised little beaming six year-old face that he could go see Ice Age 3 tomorrow... checked cinema listings... not out till Weds :-/","time":1246089663},{"text":"When is the new ice age!!!","time":1246117858},{"text":"Ahhh, how good does Ice Age 3 look? :)","time":1246104595},{"text":"   Ice Age: Dawn Of The Dinosaurs /   3:  :   .. http://tinyurl.com/m9neku","time":1246105414},{"text":"Got tickets to ice age 3..but not sure if i feel like going.","time":1246107711},{"text":"Ice Age: Dawn of the Dinosaurs available in theatres here in Sao Paulo...","time":1246117246},{"text":"Watching: YouTube - Ice Age 3 - Dawn of the Dinosaurs - Official Trailer with Xoch who is trying 2 smell it ( http://bit.ly/18xcx5 )","time":1246109273},{"text":"Hubby \u0026 the little dude are trying to get to the Ice Age 3 screener - mebbe should\u0027a written down the where\u0027s \u0026 when\u0027s...boopsie","time":1246111903},{"text":"OMG! Ice Age Crevasse painted on street. Too real to believe. Imagine coming upon this while driving. http://budurl.com/crevasse","time":1246112029},{"text":"@galihwismoyo gal, ice age sequel akan keluar lagi horeeee!!! Can\u0027t wait to see sid\u0027s face kekekekkkk","time":1246114186},{"text":"Attention! Rt @darknova306 CO2 argument is lame. CO2 was over 1000 ppm during the last ice age while temps fell, it\u0027s 380-ish ppm now.","time":1246105714},{"text":"@webmyc RT Tre sa mergi la biroul de informatii chiar la Baneasa Mall,in zona intrarii de la Starbucks.Intrarea este 15 lei/pers.Ice Age3;)","time":1246115421},{"text":"Ice age time.","time":1246129359},{"text":"Wala pa bang Ice Age 3?","time":1246122310},{"text":"RT @SalsaTV: win a pass for Ice Age: Dawn of the Dinosaurs Houston screening on 6/30. www.salsatv.com","time":1246118613},{"text":"Buy.com: Games - Ice Age: Dawn of the Dinosaurs: - $48.99 http://bit.ly/mhxlU","time":1246124970},{"text":"Films I wana see; TR 2. And Ice Age 3.. I wonder if he will ever get that nut!!","time":1246130646},{"text":"Metcalf\u0027s Screening Room: Ice Age: Dawn of the Dinosaurs http://bit.ly/To0G2","time":1246132309},{"text":"Mmm mushroom Swiss burger at Longhorn Cafe, great seeing Joshy, Chris, Clau \u0026 Iggy. Ice Age was great. - http://bkite.com/08YTu","time":1246124749},{"text":"http://twitpic.com/8lhe7 - love these guys. they make going into mcdonalds and walking around in ice age three masks look cool - (they r ...","time":1246124432},{"text":"Watching Ice Age 2 now! ^_^","time":1246138169},{"text":"@JackieB630 the girls are 10 and 14. The new Ice Age movie looks good.","time":1246137624},{"text":"waiting for time to go by...has goin to see ice age 3 today","time":1246138361},{"text":"Anyone else have a problem with ice age 3, dawn of the dinosaurs? Feels like a creationist trick.","time":1246136800},{"text":"I\u0027ve found the PERFECT vehicle for a Zombie epidemic, hurricane, earthquake, and Ice Age. http://bit.ly/c84iU","time":1246138618},{"text":"I want to go see Ice Age, I know, I know its a \u0027kids\u0027 movie... But its CG Animation \u0026lt;3!","time":1246139391},{"text":"At the Movies: capsule reviews of \u0027Ice Age\u0027 and other films this week: ... NZStuffEditor International v.. http://bit.ly/15ezOt","time":1246142035},{"text":"I uploaded a YouTube video -- Ice Age 3 Trailer :Dawn of the Dinosaurs http://bit.ly/hqANa","time":1246142401},{"text":"It\u0027s ALMOST time for a third Ice Age and my review is embargoed until Wednesday, 7/1/09 Website \u0026 trailer: http://www.iceagemovie.com","time":1246142817},{"text":"Little Ice Age Explained. http://bit.ly/4qVJJ0","time":1246148924},{"text":"Loved Ice Age 3... Nothing makes you feel more like a kid than a 3D film","time":1246158122},{"text":"Ice Age: Dawn of the Dinosaurs also known as Ice Age 3 is an upcoming computer animated film that will be the third http://bit.ly/UmRIc","time":1246154458},{"text":"Cool Ice Age 3 game ;) http://www.mtvasia.com/Movies/Specials/IceAge3/game.html","time":1246152451},{"text":"Ice Age 3 in 3D. Much better than the second one. Just amazing. http://yfrog.com/11fp0j","time":1246153229},{"text":"Nokia S60V3 S60V5 SymbianOS 9.1/9.2/9.3/9.4 Application,.... Ice Age 3: Bits.... http://famelist.info/?p\u003d7493","time":1246158923},{"text":"iTunes movies best selling chart #27: Ice Age: The Meltdown Everyone\u0027s favorite sub-zero heroes are... http://tinyurl.com/mhe845","time":1246148958},{"text":"Best selling iTunes movies: Ice Age It is twenty-thousand years ago. The Earth is a wondrous,... http://tinyurl.com/l62u56","time":1246150156},{"text":"oh it\u0027s from ice age 3. that kinda cheapens it somewhat.","time":1246162665},{"text":"Ice Age 3 Metropol Kino Innsbruck http://bit.ly/bEr40","time":1246173742},{"text":"guz2 q din pla panoorin ang ice age 3... http://plurk.com/p/14mid8","time":1246164508},{"text":"look at that the german voices for ice age 3, having dinner tonight with sid :) http://bit.ly/hhIZg","time":1246165006},{"text":"Watching ice age 2 on sunday afternoon while lying in bed all day . LAZY TIME ! http://myloc.me/6c9J","time":1246165151},{"text":"@realsid http://twitpic.com/8bzf6 - Buck is the only reason I want to see Ice Age 3. Does he have a Twitter?","time":1246170547},{"text":"@marginatasnaily Erm... Sword in the Stone, Ice Age, Robin Hood, Lion King (awww) \u0026 Cars. And yours...?","time":1246173089},{"text":"Fresh pancakes for breakfast now off out to see Ice Age 3 can\u0027t wait (thanks to @imagine8withus for the tickets)","time":1246173159},{"text":"Noch 80 Stunden bis zum Start von Ice Age 3. Zum Wartezeitverkrzen gibts den Eierlauf auf http://www.iceage3-derfilm.de/","time":1246165330},{"text":"little creatures | bloody valentine | ice age | rove tonight | franz ferdinand | lap dance | http://happn.in/perth/28jun09-04pm/","time":1246170690},{"text":"Im going to the movies next Sunday. Dont know what Im gonna see though. Theres no good movies besides Hannah Montana Movie \u0026 Ice Age 3","time":1246174977},{"text":"omg I wanna see ice age 3","time":1246188103},{"text":"Cant wait for Harry potter and Ice age 3.","time":1246176209},{"text":"ICE AGE 3 Aparitia Dinozaurilor : http://www.myticket.ro","time":1246177476},{"text":"SR on \u0027Ice Age 3\u0027 http://tr.im/q2AE - better than the last one, not as good as the first.","time":1246176126},{"text":"http://twitpic.com/8nyld - Some Ice advertising Ice Age 3... Genius!! :D","time":1246178160},{"text":"Radiohead - Idioteque (live) Ice age coming...  http://blip.fm/~90s6y","time":1246179062},{"text":"Latest: Ice Age 3: Dawn of the Dinosaurs: An enjoyable family game it is. http://bit.ly/18N1et","time":1246180193},{"text":"RT: @realsid: retweet \u003e follow @realsid ! Let\u0027s put sloths on the map! Ice Age 3 in Digital 3D - July 1.","time":1246180283},{"text":"Latest: Ice Age 3: Dawn of the Dinosaurs Review: An enjoyable family game it is. http://bit.ly/18N1et","time":1246180324},{"text":"wants to watch Ice Age 3 Dawn Of The Dinosaurs! (LOL) http://plurk.com/p/14oqwx","time":1246181424},{"text":"wants to watch ICE AGE 3 in IMAX (DANCE) http://plurk.com/p/14oxd0","time":1246182616},{"text":"@jazz_pooh gmn kl nonton Ice Age 3 aja tp yg 3D :) tgl 1 ini mereka main bukan?","time":1246186097},{"text":"@gertjan2805 yoo wie gaan dr nu allemaal mee naar ice age 3 dan..","time":1246186878},{"text":"3D!!! ICE AGE 3 - 3D / MI., 01.07.2009 / 12:45 15:00 17:00 19:00 21:00 23:15 / KARTEN IM VORVERKAUF: 05731 15415 / http://is.gd/19fXH","time":1246189200},{"text":"RT @UCI_Oeynhausen: ICE AGE 3-DIGITAL 3D +++ EXKLUSIV IN OSTWESTFALEN IM UCI BAD OEYNHAUSEN IN 3 D +++ VORVERKAUF LUFT! http://bit.ly/wNssD","time":1246189180},{"text":"ICE AGE 3-DIGITAL 3D +++ EXKLUSIV IN OSTWESTFALEN IM UCI BAD OEYNHAUSEN IN 3 D +++ VORVERKAUF LUFT! http://bit.ly/wNssD","time":1246189242},{"text":"Ice Age 3: Komiker-Legende Otto im BamS-Interview ber hnlichkeiten mit Faultier Sid, dem er seine Stimme lieh. http://is.gd/1gPOd","time":1246178000},{"text":"@thehorrorsnews Dude it\u0027s got to be New ice age.... phat tune","time":1246192077},{"text":"Freu mich auf #Ice Age 3 -- wird bestimmt saulustig. :-)","time":1246203497},{"text":"Ice Age 3 Dawn of the Dinosaurs 2009 Official Trailer #4,Film ... http://bit.ly/2sVkuF","time":1246198177},{"text":"Earth on the Brink of an Ice Age? I\u0027m not so sure. http://shar.es/7N6K","time":1246204164},{"text":"@GuterGeschmack Geniesse die Zeit :-) Freu mich auf morgen, bin aber erst ab 13.00 erreichbar, vorher Pressevorf. Ice Age 3","time":1246194813},{"text":"Ice Age: Dawn of the Dinosaurs hits theaters on July 1 http://is.gd/1hgYo","time":1246214133},{"text":"Ice Age 3 http://bit.ly/JeoSo - Nobody move a muscle..AHHHHHH!!! - hihi","time":1246205234},{"text":"@TrueUnderdog Global warming is a myth. Weve been in an ice age for the past 2mil years. Its about time we get out of it http://bit.ly/bUplN","time":1246209673},{"text":"Ice Age 2 gameboy advance game, plays on GBA, SP and DS Cheap and Great Game~ http://tinyurl.com/l9gnc5","time":1246213389},{"text":"@Bleeding_heart Watch Vinny and Michelle battle on Food Network tonight in Ice Age Cakes at 7pm ct. Good luck guys! http://bit.ly/K5gVt","time":1246218473},{"text":"http://bit.ly/IdEBr ..ice age","time":1246223309},{"text":"http://twitpic.com/8pbmj - In three! Yesterday at the cinema! OF THE ICE AGE 3! ^ ^","time":1246219544},{"text":"Film review: Ice Age: Dawn of the Dinosaurs http://bit.ly/KnxNo","time":1246232129},{"text":"ice age lol #jtv http://justin.tv/def_jam","time":1246233278},{"text":"Estrenos: Ice Age 3: El Origen De Los Dinosaurios (2/7) http://bit.ly/10OS8f","time":1246223298},{"text":"Ancient Ice Age found to have lasted longer than previously thought: http://bit.ly/rYAQj","time":1246228603},{"text":"Review: \u0027Ice Age\u0027 is \u0027yawn of the dinosaurs\u0027 tale (AP) http://tweetamovie.com/n2034","time":1246229283},{"text":"Ancient Ice Age found to have lasted longer than previously thought: http://bit.ly/rYAQj http://ff.im/4yqTV","time":1246228606},{"text":"RT @NadirahAli: I think I\u0027d rather watch Ice Age on Telemundo\u003e\u003e hahaha Jesus, Maybe I\u0027ll just delete the BET awards off my DVR w/o watching","time":1246230269},{"text":"Ooh... Ice Age is on","time":1246243383},{"text":"So going to see ice age 3","time":1246243494},{"text":"IM GOING TO SEE ICE AGE!","time":1246242477},{"text":"Viendo Ice Age en 3D http://twitpic.com/8q36u","time":1246235379},{"text":"Went to primere of ice age last week! Good movie!","time":1246242502},{"text":"HEYYY!!! My homeboy Welchs was just on tv!! He\u0027s in Ice Age!! LMAOOO","time":1246242514},{"text":"Celebrity Interviews - Ice Age: Denis Leary @http://bit.ly/11kze5","time":1246244660},{"text":"Ice Age ice pops and playing Last Word with @LULULUBADARA :D","time":1246245515},{"text":"RT @ecastillo: Viendo Ice Age en 3D http://twitpic.com/8q36u","time":1246235515},{"text":"dang how many ice age movies have there been....can they just go extinct already?!?!","time":1246244165},{"text":"says I just saw the trailer of Ice Age 3! :D http://plurk.com/p/14vn2o","time":1246244282},{"text":"farewell party-W1ICE AGE 3W2WebTues W3Fruit AcidW4Duck\u003d\u0026gt;!pray for God! I wanna be honest with myself.","time":1246241905},{"text":"#bollywood #DesiTV Ice Age 3: Dawn of the Dinosaurs - Trailer: shttp://video.aol.in/video-deta.. http://tinyurl.com/nz7xrb","time":1246247384},{"text":"@lisisilveira Iit could trigger a new Ice Age so who knows how many will die. I live in hi desert alt 4600.Only worry about kids, not me.","time":1246238664},{"text":"ion curr, this 1\u0027s in 3d! im on it! @FoxxyBagLady Okay..how many ICE AGE movies are there? THey are starting to be like High School Musical!","time":1246241860},{"text":"can\u0027t wait to watch ice age 3....","time":1246253414},{"text":"Is looking forward to se Ice Age 3 tonight :-)","time":1246253573},{"text":"Ice Age Man: http://bit.ly/16wJdR","time":1246255211},{"text":"ZOZKETA: Ice Age 2 euskaraz!!! http://tinyurl.com/ddsmcn","time":1246261561},{"text":"Next i\u0027m looking forward to seeing my sister\u0027s keeper, ice age 3, and harry potter 6.","time":1246249437},{"text":"@bellametaphor mostly every day u tryin to go see ice age in imax 3D this week?","time":1246250683},{"text":"Kino-Tipp der Woche: Ice Age 3 http://tinyurl.com/lt5cmt","time":1246260724},{"text":"So, nun gehts gleich mit Schneider ins Kino, Ice Age 3 anschauen. Mag noch jemand mit? Anybody? Hm, jetzt ists zu spt;) -so","time":1246253928},{"text":"Jegkorszak 3  A Dinok hajnala  Ice Age 3: Dawn of the Dinosaurs  mobil jatek: Ilyen meg nem volt! A fil.. http://bit.ly/qVCyj","time":1246258355},{"text":"Jegkorszak 3  A Dinok hajnala  Ice Age 3: Dawn of the Dinosaurs \u0026#8211; mobil jatek: Ilyen meg nem volt! A fil.. http://bit.ly/qVCyj","time":1246258381},{"text":"Jegkorszak 3  A Dinok hajnala  Ice Age 3: Dawn of the Dinosaurs  mobil jatek: Ilyen meg nem volt! A fil.. http://bit.ly/qVCyj","time":1246258470},{"text":"know what else i hate? all this GREEN shit. who cares?? we can\u0027t fix the earth. there\u0027s gonna be an ice age eventually. GET OVER IT!","time":1246249878},{"text":"RT @AlexHervaud http://twitpic.com/8qsm4 - C\u0027est moi ou sur ce pic d\u0027Ice Age, il y a un gland et ce qui ressemble  une bite? J\u0027approuve","time":1246257591},{"text":"RT @AlexHervaud http://twitpic.com/8qsm4 - C\u0027est moi ou sur ce pic d\u0027Ice Age, il y a un gland et ce qui ressemble  une bite?","time":1246258493},{"text":"La pandilla animada de Ice Age 3 viaja al mundo de los dinosaurios: La pandilla formada por los mamuts Ellie y.. http://tinyurl.com/ncmepm","time":1246259297},{"text":"Watch ice age 3 this july 3...","time":1246271177},{"text":"Ice Age 3 in 3D rocks!","time":1246272643},{"text":"I won a double invitation at the pre-screening of Ice Age 3 in Cluj ! http://www.cinemarx.ro/ice-age-3/ Thanks @CinemaRx","time":1246263968},{"text":"Ale: This weekend we watched Ice Age 3 in 3D. I recommend it.","time":1246268347},{"text":"ICE AGE 3 is DINO-MITE! : If you loved the first two Ice Age movies, wait till you see the third flick in the an.. http://tinyurl.com/ln8pho","time":1246267411},{"text":"Nuevo post: Ice Age 3: El Origen de los Dinosaurios http://bit.ly/JqRrX","time":1246268728},{"text":"RT: @heyuguysblog: Ice Age 3 at Chessington World of Adventures http://bit.ly/tktqQ","time":1246268886},{"text":"Box office predictions for July 4th weekend: Battle for No. 1 spot between Trans. 2 and Ice Age 3.","time":1246271195},{"text":"Gleich gibt\u0027s happa! \u003d) Jetzt noch einen kleinen Bericht ber Ice Age 3 lesen #offline #zeitung","time":1246272695},{"text":"rt @jondeanp @stevenblackwell Have you tried an Ice Age lolly yet...treeeeemendous","time":1246274642},{"text":"AAAAAAAAAAAAA CAN\u0027T WAIT...CAN\u0027T WAIT....CAN\u0027T WAIT Check this video out -- Ice Age 3 http://bit.ly/2m0KXN","time":1246264248},{"text":"ingin nonton ice age 3! sapa yang mu bayarin.. ayo tunjuk tangan.. http://plurk.com/p/14z9t7","time":1246267965},{"text":"The Growing Ice Age Family: We had to do one scene particularly, the laughing scene, because Manny h.. http://bit.ly/12vpng","time":1246271679},{"text":"RT @Kigyossy: Media Predicted Ice Age in the 70\u0027s. Complete turnaround in \u0026lt; 25 years Good information about status; http://bit.ly/gppbs","time":1246272600},{"text":"@miclex Mersi. Aici era concursul http://www.cinemarx.ro/ice-age-3/ . Se pare ca am ocazia sa vad cu 3 zile inainte de lansarea oficiala :D","time":1246268916},{"text":"Ice Age 3: Dawn of the Dinosaurs http://bit.ly/atMXV","time":1246279103},{"text":"Ice Age: Dawn of the Dinosaurs\u0027 http://bit.ly/8ICst","time":1246283195},{"text":"Ice Age: Dawn of the Dinosaurs\u0027 http://bit.ly/dGVjR","time":1246283734},{"text":"Ice Age: Dawn of the Dinosaurs\u0027 http://bit.ly/a6xlY","time":1246285317},{"text":"Ice Age: Dawn of the Dinosaurs: For the first time, play as six beloved Ice Age characters as they embark on a r.. http://twurl.nl/7cal6z","time":1246283418},{"text":"Ice Age: Dawn of the Dinosaurs\u0027: By Roger Moore The blockbuster \u0027Ice Age\u0027 movies have, to a one, l.. http://tinyurl.com/lnogr7","time":1246285821},{"text":"mau nonton public enemy, ice age, hannah montana the movie samaa harry! :D","time":1246277238},{"text":"Studio Movie Grill schedules special needs screening of Ice Age: Dawn of the Dinosaurs http://tinyurl.com/nu5dsj","time":1246279582},{"text":"Studio Movie Grill schedules special needs screening of Ice Age: Dawn of the Dinosaurs http://tinyurl.com/nu5dsj","time":1246279676},{"text":"@wenchean hahaha i didnt sleep during ice age three. hahahaha \u0026gt;\u0026lt;","time":1246284323},{"text":"Sorry about the lack of news this morning... I was busy working on schedules for Ice Age: Dawn of the Dinosaurs and Public Enemies!","time":1246287213},{"text":"por si alguien quiere iconos de Ice Age 3 para el MSN http://www.redboxnewmedia.com/iceage3/","time":1246290803},{"text":"New Movies!!!!! Ice Age: Dawn of the Dinosaurs 3D: Opens Wednesday, Jul 1, 2009Movie Details http://twurl.nl/u8tm1i","time":1246280458},{"text":"1645 of Twit, good 1 for my new pals @GreenpeaceMass ... start of Maunder Minimum, sunspots down, mini ice age. Warm-Cold-Warm, whoda thot?","time":1246286261},{"text":"ada git, BOO, great horror movie katanya RT @agnestasia my waiting list:Ice Age3,Public Enemies,Harry Potter6,Hannah Montana...","time":1246289826},{"text":"@dhaee : btw, remember to watch Ice age after 9 July k? :) Woah, the days after exams are so tempting! You too, add oil for your pw k? haha!","time":1246285708},{"text":"Can\u0027t wait for Ice Age 3...me like the trailer with the T-Rex...fun!","time":1246291519},{"text":"Review: \u0027Ice Age\u0027 Is \u0027Yawn Of The Dinosaurs\u0027 Tale http://tinyurl.com/mspjl3","time":1246300039},{"text":"2 days until the awesome event that is the release of Ice Age 3...its what life is all about","time":1246300986},{"text":"Earth on the Brink of an Ice Age http://tinyurl.com/ldkdzy","time":1246301700},{"text":"Is Methane The Cause Of Past Ice Age Global Warming? http://bit.ly/18rYw9","time":1246291426},{"text":"defrosting the fridge in the preparation to move out. Wow, we could have shot Ice Age 4 there!","time":1246292492},{"text":"Earth on the Brink of an Ice Age - Examiner.com http://bit.ly/CAOCD","time":1246292749},{"text":"Ok next time we all hang out i wanna im see ice age 3 d. :) Haha","time":1246293065},{"text":"Ice Age 3 - Dawn of the Dinosaurs - Official Trailer http://bit.ly/MiA5O","time":1246294500},{"text":"Capsule reviews: `Ice Age\u0027 and other films http://tinyurl.com/l26qeh","time":1246294983},{"text":"Capital Capers Summer Movie Blockbuster: Ice Age, Dawn of Cap and Trade. http://bit.ly/iEe3b","time":1246298398},{"text":"Earth on the Brink of an Ice Age - Examiner.com http://bit.ly/CAOCD","time":1246304206},{"text":"@ReelzChannel Leguizamo Channels his Inner Sloth in Ice Age 3: Despite having voiced the loveable sloth Sid in... http://tinyurl.com/opws45","time":1246292418},{"text":"Reelzchannel News Leguizamo Channels his Inner Sloth in Ice Age 3: Despite having voiced t.. http://tinyurl.com/opws45","time":1246293147},{"text":"@FunTimeFrankieG Yeah defo, looks so funny. Im\u0027 gunna take my niece to watch Ice Age 3 aswell, Im\u0027 using her as an excuse to watch it lol","time":1246293722},{"text":"I NEED TO GO TO THE \u0027CINE BOX 3D\u0027 TO WATCH ICE AGE 3! but nobody wants to go \u0027cause it\u0027s on guararapes mall and it\u0027s far away from here!","time":1246295855},{"text":"iTunes - Music - Ice Age: Dawn On the Dinosaurs (Original Motion Picture Soundtrack) - John Powell http://bit.ly/hj77p","time":1246299591},{"text":"Yesss ice age is on!!!","time":1246313249},{"text":"Watching Ice Age :)","time":1246313398},{"text":"I\u0027m watching ice age 2!!! :)","time":1246316717},{"text":"Just watching Ice age 2 it is so funny!","time":1246318642},{"text":"Ice age: the meltdown!!","time":1246319643},{"text":"Ice age marathon? Helz yea baby.","time":1246316568},{"text":"watching ice age 2 and then run\u0027s house","time":1246317186},{"text":"Ice age 3! I\u0027m going to see it... what?","time":1246317219},{"text":"@Natlovesjericho Ice Age 1 is the best so far!! Yay","time":1246317454},{"text":"This is me watching ICE AGE with Kiera. http://mypict.me/6zUD","time":1246318592},{"text":"Ice Age Two is about to hit the theaters again. Fun one liners. http://ice-age-continues.blogspot.com","time":1246310832},{"text":"http://twitpic.com/8sz9q - ice age went to a commercial. \u003d)","time":1246312739},{"text":"In DTown watching Ice Age.. Gonna go for a dip in the hotel pool:P","time":1246318016},{"text":"@kailllaaa haha im watching Ice Age and getting ready to go to the Plain White T\u0027s Show! :D hahaha.","time":1246309067},{"text":"staune ber die englische Syncronstimme von Sid in Ice Age. Klingt fast identisch mit der von Otto","time":1246312295},{"text":"Movies on my to see list for the next month: Harry Potter, Bruno, Public Enemies and Ice Age 3!","time":1246312922},{"text":"I\u0027m not fat... It\u0027s all thus fur.... It makes me look poofy. (ice age)","time":1246313987},{"text":"@mavsfan815 not much bored at tha Casa ready for Wednesday :) u down for ice age 3 ? At 7:40 Carmike","time":1246316335},{"text":"I\u0027ve built a Public Enemies print and created a digital Ice Age 3 show: it\u0027s time for my sandwich!","time":1246317675},{"text":"watching Ice Age 2....can\u0027t WAIT for Dawn of the Dinosaurs! http://bit.ly/1982ci","time":1246318148},{"text":"\u0027Ice Age\u0027 warms up to dinosaurs in third installment - USA Today http://bit.ly/akd9o","time":1246319291},{"text":"Ice Age: Dawn of the dinosoures... Queen Latifaf (trailer) http://bit.ly/ngelO via @addthis","time":1246319905},{"text":"Yes ma\u0027am. In 3D and errythang, lol. Who else is down? RT: @x0riginalcin26x @Fikra_Jahya you plan on watching ice age 3?","time":1246305648},{"text":"Let\u0027s hope he brings teh funny. RT @robinwauters: Following @realsid - and yes, it\u0027s actually from the makers of Ice Age","time":1246308378},{"text":"Ice Age 3 so amazing. Eu ri muito com o Sid. Nina e eu ainda pegamos a topic errada, anyway, aventura do dia :D","time":1246313109},{"text":"The new Ice Age movie has a surprising number of penis-related jokes. Any number higher than zero would be surprising; it has at least 3.","time":1246313219},{"text":"watching \u0027Ice age 2\u0027 woot.","time":1246321231},{"text":"Chillin. Watchin ice age!","time":1246322575},{"text":"Ooh. Ice age 3 Wednesday.","time":1246322594},{"text":"back...Ice Age 3? hmmm...","time":1246327093},{"text":"watching ice age:the meltdown","time":1246327638},{"text":"I love ice age","time":1246331544},{"text":"@espostor the ice age has begun","time":1246327607},{"text":"Ice age 2 makes me lol every time","time":1246331923},{"text":"My beautiful daughter and I just watched Ice Age 3. I feel good.","time":1246320910},{"text":"Watching ice age 2! And talking to ta leeee (:","time":1246322402},{"text":"ice age the melt down part II","time":1246323840},{"text":"Ice Age 3 : Dawn of the Dinosaurs http://sodahead.com/question/464083/","time":1246321070},{"text":"Ice age 3 besok turun euy! http://twitpic.com/8te6a","time":1246321453},{"text":"Going to see Ice Age on Wednesday and off work on Friday!!!","time":1246321660},{"text":"at home watching Ice Age 2. whoop. :) miss my LA people.","time":1246321723},{"text":" **ICE AGE3**!! 3D!!!! http://plurk.com/p/155dq8","time":1246322058},{"text":"I want to see that movie. I am going to see ice age with madison.","time":1246322408},{"text":"\u0027Ice Age\u0027 warms up to dinosaurs in third installment http://bit.ly/Sbjnm","time":1246324187},{"text":"Watching Ice Age w/the kids. Commercials? For feminine products and eHarmony. #FAIL","time":1246330796},{"text":"I love Scrat! Watching Ice Age 3 in 3D. I love my job","time":1246332241},{"text":"loves ice age float from McDo!!! http://plurk.com/p/157424","time":1246334380},{"text":"John Leguizamo on Ice Age: Dawn of the Dinosaurs: CanMag When he plays Sid the Sloth in the Ice Age movies, it\u0026#.. http://tr.im/qflT","time":1246320481},{"text":"John Leguizamo on Ice Age: Dawn of the Dinosaurs: CanMag When he plays Sid the Sloth in the Ice Age movies, it\u0026#.. http://tinyurl.com/nkqwqn","time":1246322079},{"text":"Watching Ice Age 2 with my two fav guys. Funny movie! I love spending time with my guys! So glad they were given to me!","time":1246320396},{"text":"wants to watch: Ice Age \u0026 Garfield 3D. It\u0027s cartoon time babe http://plurk.com/p/155daf","time":1246321968},{"text":"Summer Movie Blockbuster: Ice Age, Dawn of Cap and Trade. http://bit.ly/iEe3b","time":1246324321},{"text":"RT @wolwol Ice age 3 besok turun euy! http://twitpic.com/8te6a","time":1246324413},{"text":"@DavidKirlew I am trying to find a quote said in the movie, Ice Age 2 The Meltdown LOL thats my distraction","time":1246325608},{"text":"so Ice Age is about to knock out 3 releases before Toy Story went from 2 to 3. Crazy.","time":1246327634},{"text":"Wanna watch Ice Age 3 3D 2morrow with some w***s before. Hahaha. Kinda fun.","time":1246329730},{"text":"@blitzmegaplex nice ice age 3d. Just wondering thoug why the 3D rate Is quite expensive. Thx","time":1246331913},{"text":"RT @karenjitk: @yingoying eyer go watch movie neva ajak me :-(tonite 10pm cineleisure. ice age 3D","time":1246333664},{"text":"At Hoyts Cinema, Victoria Garden for Ice Age 3. Full of school children and MJ\u0027s greatest hits over and over again http://myloc.me/6Ae2","time":1246320278},{"text":"Yay! Nonton bioskop tiap minggu euy! RT @wolwol: Ice age 3 besok turun euy! http://twitpic.com/8te6a","time":1246322952},{"text":"\u0027Ice Age: Dawn of the Dinosaurs\u0027 movie review: A cartoon suffering ...: The Star-Ledger - NJ.com by Step.. http://tr.im/qfPb","time":1246325817},{"text":"RT @cheehwei: @yingoying cool.when? hey i\u0027m gonna watch ice age 3D tonite. 10pm at cineleisure. wana join?","time":1246333639},{"text":"hari ini mau diajakin nonton garuda di dadaku,tapi besok sabtu dah ada Ice Age 3,gimana ya enaknya? http://plurk.com/p/155uen","time":1246325356},{"text":"is taking my son to see ice age 3 tomorrow very excited","time":1246335159},{"text":"Ice Age 3 http://plurk.com/p/157gf1","time":1246336739},{"text":"Ice Age 3 - Eggsicles http://bit.ly/EqCSQ","time":1246339346},{"text":"Eiskalt, Ice Age 3: http://bit.ly/jguyi","time":1246342201},{"text":"can\u0027t wait to see Ice Age 3 this weekend","time":1246344112},{"text":"        3:  : http://games.1c.ru/ice_age3/","time":1246344520},{"text":"2 good movies coming up in july: ice age 3 and harry potter (prince)","time":1246347136},{"text":"Ice Age: Dawn of the Dinosaurs Cast on Ice Age #3 in 3-D: Ray Romano returns as Manny the Mammoth, John Leguizam.. http://tinyurl.com/mkdsvs","time":1246335347},{"text":"Ice Age: Dawn of the Dinosaurs Cast on Ice Age #3 in 3-D: Ray Romano returns as Manny the Mammoth, John Leguizam.. http://digg.com/u17392","time":1246340273},{"text":"Scrat aus Ice Age: Ein Held unserer Zeit: Der dritte Teil von Ice Age kommt ins Kino - und mit ihm die Eichhr.. http://twurl.nl/v15vkc","time":1246336296},{"text":"Critica: Ice Age 3. El origen de los dinosaurios: Titulo: Ice Age 3: El origen de los dinosaurios T\u0026#.. http://tinyurl.com/klslmu","time":1246345335},{"text":"exhausted..long day...but watching ice age, taking pictures on the mac, and eating popcorn made it better :) love the fam.","time":1246334747},{"text":"Ice Age 3 releasing this friday in India. Might turn out to be an excellent entertainer for little ones.","time":1246335174},{"text":"Ice Age 3 - Cam - Latino - [EspaDD.com].rar http://bit.ly/13IIpV","time":1246336289},{"text":"Ice Age 3: Dawn of Dinosaurs featurette http://bit.ly/10VFZ2 #movies #iceage","time":1246336830},{"text":"I think that I know what @andrewcantalk is doing on July 24th. Ice Age 3D today!! WooOoOOo!","time":1246337195},{"text":"RT @F1sasha: Is Ice Age 3 out !!!!!!! - Anyone know when it\u0027s released?","time":1246337470},{"text":"Ice Age: Dawn of the Dinosaurs: Pegg gives a boost to long-in-the-tooth franchise http://tinyurl.com/nhs9wy","time":1246338021},{"text":" post: Ice Age 3: Dawn of the Dinosaurs http://tinyurl.com/n6nk6x","time":1246338086},{"text":"RT @away_gr:  post: Ice Age 3: Dawn of the Dinosaurs http://tinyurl.com/n6nk6x","time":1246338097},{"text":"Make sure to check Out Josh Peck in Ice Age: Dawn of the Dinosaurs on July 1st","time":1246338594},{"text":"@gregor_w denn gmmer doch go ice age 3D luege! :D","time":1246339230},{"text":"Enjoying the new Ice Age trailer - http://bit.ly/1mkIe - and @realsid tweets - classic","time":1246339949},{"text":"Cel mai recent clip de promovare Ice Age: Dawn of the Dinosaurs http://bit.ly/R3kdr","time":1246343799},{"text":"Sneak peek: Ice Age: Dawn of the Dinosaurs http://bit.ly/PqB3V","time":1246345552},{"text":"\u0027Ice Age\u0027 warms up to dinosaurs in third installment http://bit.ly/18fn7G","time":1246345624},{"text":"Public Enemies kapan sampe Indonesia?? RT @blitzmegaplex: Coming up Wednesday! Ice Age 3 [in 3D at GI \u0026 MOI] and Blood: The Last Vampire ...","time":1246336029},{"text":"RT @F1sasha http://twitpic.com/8tzt6 - Sasha and Sid \u003c-- Aw how cute! Guess who can\u0027t wait for Ice Age 3!!!","time":1246338459},{"text":"More Cornbury tix tomorrow and a last chance to see Ice Age 3 3D @ Odeon Oxford. It looks awesome http://www.iceagemovie.com/","time":1246342111},{"text":"titled world war | facebook fan | ice age | draft house | final tickets push | lance armstrong | http://happn.in/bould/30jun09-02am/","time":1246343492},{"text":"Pokoknya kamis wajib jd ntn nya!!RT @marchiany: Can\u0027t wait to watch Garuda DiDadaku w/ The Sompotans, after that Ice Age 3 on weekend :-)","time":1246348387},{"text":"Watching Ice Age :) :P","time":1246356041},{"text":"planning to watch ice age today","time":1246358618},{"text":"Ice Age 3 kommt http://tinyurl.com/lywcwc","time":1246350731},{"text":"is watching ICE AGE 3! weeeeeee im so excited!","time":1246358255},{"text":"is leaving for BALI tonight. Going to miss ICE AGE 3 premiere though..","time":1246349097},{"text":"Going to see Ice Age 3 tomorrow night. Am I a nanna yet?","time":1246349487},{"text":"@violethobbie kns Ice Age: Dawn of the Dinosaurs opens July 1st, 2009","time":1246353381},{"text":"http://pic.gd/7ce Ice Age III me tonight.","time":1246354714},{"text":"     ICE AGE 3,  ? )) *    ) http://www.afisha.ru/msk/movie/195135/","time":1246355467},{"text":"ahh i cant wait to see Ice Age 3... its so exciting... whooppeee","time":1246357122},{"text":"NEW ENTRY: Ice Age: Dawn of the Dinosaurs (2009) http://tinyurl.com/nequvz","time":1246358221},{"text":"RT @taz_news: Scrat aus Ice Age: Ein Held unserer Zeit - die Squirrel-Rat. Teil 3 von Ice Age kommt ins Kino - http://twurl.nl/v15vkc","time":1246353979},{"text":"Ice Age 3 : Aller guten Dinge sind drei, oder nicht? - http://bit.ly/O1r6n","time":1246348802},{"text":"Diseara la Ice Age 3 in 3d (titrat) Abia astept. La cinema Odeon. http://bit.ly/13ua0V","time":1246349149},{"text":"home after seeing Ice Age 3. was fun i guess! had dinosaurs - i like dinosaurs!","time":1246353565},{"text":"\u0027Ice Age\u0027 warms up to dinosaurs in third installment http://tinyurl.com/mg37wu","time":1246356123},{"text":"RT @USATODAY: \u0027Ice Age\u0027 warms up to dinosaurs in third installment http://tinyurl.com/mg37wu","time":1246356164},{"text":"RT @USATODAY \u0027Ice Age\u0027 warms up to dinosaurs in third installment http://tinyurl.com/mg37wu","time":1246356311},{"text":"says I wanna watch Ice Age 3 and Bruno with Aybee :3 http://plurk.com/p/15aql1","time":1246356996},{"text":"RT @theadgency: Diseara ma duc la avanpremiera la Ice Age 3 !!!! Yay!!! (si eu, thx, Rich!!!)","time":1246358773},{"text":"Post Movies: Ice Age: Dawn of the Dinosaurs: T-Rex and roll: Film Review: Ica Age: Dawn of the Dinos.. http://tinyurl.com/mw29ve","time":1246350689},{"text":"i wanna watch night at the museum2, ice age 3 and harry potter. and i have taped-daddy\u0027s daycare and finding nemo. can i watch?? plss.....NO","time":1246352624},{"text":"So Ice Age luft auf dem Player naja mal sehen ob der auch auf lange zeit ganz bleibt...","time":1246355846},{"text":"sld 3 heimsfrumsnd a slandi 1. juli: Sena Heimsfrumsnir Ice Age: Dawn of the Dinosaurs a mivikudag 1. juli.. http://tinyurl.com/m9aglw","time":1246356851},{"text":"Wah kerennnnn,lg nntn ice age 3 pk kacamata 3d,terakhir nntn 3d waktu keong emas doang,keren teman2 http://myloc.me/6EL5","time":1246358713}]
