[{"text":"can\u0027t wait to see Sherlock Holmes.","time":1260199911},{"text":"eh buset, di retweet sama author sherlock holmes beneran, hahaa..RT @Watson_MD RT:@nickyahu : sya sherlock holmes telkom kak. Haha.","time":1260187343},{"text":"RT:Nuevo poster individual de SHERLOCK HOLMES http://www.impawards.com/2009/sherlock_holmes_ver12.html http://bit.ly/7xi3Qw #holmes","time":1260196085},{"text":"Relaxing on a tain journey listening to the complete works of Sherlock Holmes http://myloc.me/1WAf8","time":1260189570},{"text":"RT:Looking for Sherlock Holmes in Houston, TX? Anyone got a gofobo code? http://bit.ly/8LWEZS #holmes","time":1260190888},{"text":"indiana jones hat boy decided to mix it up today and go with that hat Sherlock Holmes wears.","time":1260190933},{"text":"Saw a bboard for the sherlock holmes movie and cannot wait to slash the everliving fuck out of that movie. Holy homoerotic overtones batman!","time":1260191478},{"text":"@hoodbooty69 RT @hoodbooty69: @lokutcaezar just kidding, no its not.-\u003e hmmm...(Sherlock Holmes voice)","time":1260191961},{"text":"@andrewjenkin Hey...we noticed you interest in the Sherlock Holmes movie. Come to http://bit.ly/79LPhI for a chance to attend the premiere.","time":1260193105},{"text":"RT:This Friday: BAFTA screenings of Avatar, Sherlock Holmes and about 10 others at the same time. Hotte.. http://bit.ly/5ErWEX #holmes","time":1260196100},{"text":"RT:Just seen the Sherlock Holmes trailer and it looks fantastic. http://bit.ly/7PK5M4 #holmes","time":1260196102},{"text":"Avete visto i nuovi character poster di Sherlock Holmes?! Che coppia! :) http://bit.ly/5q75u7","time":1260197771},{"text":"Holiday movies I need to see: The Princess and the Frog, Sherlock Holmes, The Imaginarium of Dr. Parnassus.","time":1260199468},{"text":"Film premieres screening soon; Avatar, Sherlock Holmes, St Trinians 2 \u0026 Did You Hear About The Morgans? Can\u0027t wait - star spotting central!","time":1260188202},{"text":"RT:No Blog: Sherlock Holmes resgata turismo: Londres, 6 dez (EFE).- A VisitBritain, a agncia na.. ht.. http://bit.ly/4HX0WI #holmes","time":1260190880},{"text":"RT @Watson_MD: RT:@suzannec123, yes i will join you and @claudiastachini to see nine :) and sherlock holmes if i\u0027m all.. http://bit.ly/4 ...","time":1260198008},{"text":"@iamBenLyons I think Sherlock Holmes will be awesome!","time":1260204955},{"text":"@gofoborsvpcodes do u have the code for sherlock holmes screenin in hollywood ca","time":1260201600},{"text":"Are you playing #221B, the online Sherlock Holmes experience? www.221b.sh","time":1260204921},{"text":"5 cartazes novos de Sherlock Holmes http://migre.me/dy9Y","time":1260205249},{"text":"Follow in Sherlock Holmes\u0027 footsteps http://bit.ly/92CjLt","time":1260213209},{"text":"Going to see SHERLOCK HOLMES, then INVICTUS tonight. Love my job","time":1260213221},{"text":"Sherlock Holmes and Bipolar disorder - NYTimes.com ( http://bit.ly/82ufXB )","time":1260214220},{"text":"Mas posters y banners para SHERLOCK HOLMES: Los nuevos posters de Sherlock Holmes son los que teneis a continua.. http://bit.ly/7w8YUq","time":1260208438},{"text":"RT:@kondef It needs to be a Sherlock Holmes pipe that blows bubbles. http://bit.ly/8XmuWv #holmes","time":1260203621},{"text":"RT:Got a sherlock holmes shirt for knowin the premiere dates http://bit.ly/7WIXoW #holmes","time":1260207424},{"text":"SHERLOCK HOLMES displays some excellent acting from Robert Downey Jr., Jude Law and Rachel McAdams!","time":1260212313},{"text":"@aots my expectaions are very high this should be one of the best movies of the holiday season next to sherlock holmes","time":1260213883},{"text":"@iamamro just like Sherlock holmes gang of tearaway detectives. All @stephenlang needed to do was use the special whistling call!","time":1260214426},{"text":"RT @moviefone Ask cast \u0026 director of \u0027Sherlock Holmes\u0027 a Question http://kl.am/5qkL","time":1260214644},{"text":"I love visits to the Warners lot. Sherlock Holmes was AWESOME and Simon Helberg sighting in commissary! Love that guy.","time":1260214668},{"text":"RT @loquaciousmuse: I love visits to the Warners lot. Sherlock Holmes was AWESOME and Simon Helberg sighting in commissary! Love that guy.","time":1260214880},{"text":"Sir Arthur Conan Doyle\u0027s brilliant detective comes to life: http://sherlock-holmes-movie.warnerbros.com/","time":1260215841},{"text":"RT:win tickets to the screening of SHERLOCK HOLMES in San Antonio... www.cinesnob.net/contests http://bit.ly/7ZwytY #holmes","time":1260205114},{"text":"RT @kastner: Robert Downey jr. huge fan and imma let u finish, but Hugh Laurie wold be the best Sherlock Holmes of all time. OF ALL TIME.","time":1260208434},{"text":"RT: @spiritangel04: Sherlock Holmes supporters - Follow my blog: http://undershawhelp.blogspot.com \u0026 pledge help with Conan Doyle\u0027s house.","time":1260213363},{"text":"I\u0027m tentatively excited about the Sherlock Holmes movie coming out later Dec., but I\u0027m worried it looks too action, and not enough Holmes.","time":1260215192},{"text":"http://images.google.com/images?q\u003dsherlock+holmes Sherlock Holmes","time":1260225774},{"text":"I kinda really want to see Sherlock Holmes","time":1260222975},{"text":"@Fernanda1236 cool! just playing with my lap haha.. Im playing with a Sherlock Holmes\u0027 play","time":1260221276},{"text":"@ELDING Awesome and versatile! My combo (Frankenspector)\u003dDean Koontz/Sherlock Holmes character, but Frank Inspector works, too!","time":1260225698},{"text":"RT @spiritangel04: Sherlock Holmes supporters - Please follow my blog: http://undershawhelp.blogspot.com and pledge your help with Conan ...","time":1260226642},{"text":"RT:Ha Me toooo... RT @serafinowicz: Looking forward to this new \u0027sassy\u0027 Sherlock Holmes http://bit.ly/5xvNyB #holmes","time":1260226836},{"text":"The Game has a sick new album. Also, that Sherlock Holmes movie looks amazing!","time":1260229323},{"text":"Also Sherlock Holmes.RT @katiedoyle: I. Can\u0027t. Wait. To. See. Up. In. The. Air. I don\u0027t really wanna wait until Christmas.","time":1260223162},{"text":"RT:With its dense script and dark look,. I can\u0027t say SHERLOCK HOLMES is light and jolly fun. But it\u0027s a.. http://bit.ly/5yEZtQ #holmes","time":1260226830},{"text":"RT:Sherlock Holmes is up in the air. RT @elliottdotabby - Did you hear about the morgans? everybody\u0027s f.. http://bit.ly/5oPsFN #holmes","time":1260226833},{"text":"RT:@serafinowicz if there\u0027s any director that can convey the subtle charms of the sherlock holmes stori.. http://bit.ly/82zxIS #holmes","time":1260226839},{"text":"@ThatKevinSmith like I needed to have another reason to go see Sherlock Holmes! but now I may actually go on Christmas (if wife let\u0027s me...)","time":1260228567},{"text":"Win 1 of 2 Sherlock Holmes Xboxes: Grand Prizes. There are two (2) grand prizes available to be won, each consi.. http://bit.ly/87LeOE","time":1260228729},{"text":"I TOTALLY want to see Sherlock Holmes!!!!","time":1260242752},{"text":"RT @serafinowicz: Looking forward to this new \u0027sassy\u0027 Sherlock Holmes","time":1260232373},{"text":"You are absolute plate-glass. I see to the very back of your mind. -- Sherlock Holmes","time":1260234012},{"text":"@umitsalexis a+ detective skills. we\u0027re like sherlock holmes \u0026 watson","time":1260240380},{"text":"@ShellyKramer yes very excited to Sherlock Holmes, to bad it\u0027s coming out on xmas day.","time":1260241861},{"text":"doesn\u0027t like pumping gas with Sherlock Holmes \u0026 Watson staring like that: http://bit.ly/4Ob1Z3","time":1260237237},{"text":"RT:i kinda wanna see sherlock holmes http://bit.ly/4YYj07 #holmes","time":1260237727},{"text":"@alankdavenport Dude!! I can\u0027t wait to see Sherlock Holmes! Robert Downey Jr is the Man!","time":1260237819},{"text":"Please don\u0027t fail us! T @TVMoJoe: Fingers crossed that Sherlock Holmes is as fun and cool as the trailers make it look.","time":1260240788},{"text":"@cheeeetaah hahahahhaha nick looks like sherlock holmes and that shirt makes joe look like an overweight girl","time":1260241717},{"text":"Baker Street Tube gets Sherlock Holmes makeover ahead of new film http://bit.ly/60Fuif","time":1260241871},{"text":"RT @ShellyKramer: Okay, so is anyone else even remotely excited about seeing Sherlock Holmes? // I am! Looks cool. Love the actors too!","time":1260242937},{"text":"Just made my Christmas list. Nothing will beat @ThatKevinSmith\u0027s Christmas treat though. Can\u0027t WAIT for the previews b4 Sherlock Holmes!:)","time":1260239676},{"text":"Yeah, smart enough to hedge my bet though. RT @TVMoJoe: Fingers crossed that Sherlock Holmes is as fun \u0026 cool as the trailers make it look.","time":1260240890},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260242518},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260242559},{"text":"if robert downey jr and jude law were on the same set shooting sherlock holmes who was banging all the skanks in the world? tiger?","time":1260242565},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260242649},{"text":"Movie map helps UK tourists plan Sherlock Holmes-themed mystery breaks http://ow.ly/JJ8m #travel","time":1260242731},{"text":"Re-reading all Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit out of somebody. (via @thomaslennon)","time":1260242750},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260242864},{"text":"RT @thisisbree: Who would win in a fight: Sherlock Holmes or MacGyver? A:Harry Potter http://formspring.me/thisisbree/q/229083 #formspringme","time":1260244019},{"text":"RT @thomaslennon Re-reading all of // Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit out of somebody.","time":1260244420},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260244507},{"text":"RT:if robert downey jr and jude law were on the same set shooting sherlock holmes who was banging all t.. http://bit.ly/59azNL #holmes","time":1260237724},{"text":"RT @thomaslennon Re-reading Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit out of somebody.","time":1260242665},{"text":"Oh, and Sherlock Holmes, obviously.","time":1260252169},{"text":"I want to see Sherlock Holmes now!","time":1260253624},{"text":"I wanna see Sherlock Holmes like a momm.","time":1260245794},{"text":"And I love Sherlock Holmes. Great mind indeed.","time":1260258889},{"text":"My name is Sherlock Holmes! (It is possible you\u0027ve heard of me.) I must uphold the law!","time":1260245126},{"text":"@maevro Robert Downey Jr\u0027s accent in Sherlock Holmes is pretty good.","time":1260250293},{"text":"going to watch lvin and the Chipmunks 2, Sherlock Holmes \u0026 maybe The Storm Warriors this Christmas","time":1260258858},{"text":"On the day that whatshisname\u0027s shitty new Sherlock Holmes bullshit comes out, I will watch Billy Wilder\u0027s PRIVATE LIFE OF SHERLOCK HOLMES.","time":1260248274},{"text":"RT:Sherlock Holmes is based on a Doctor and the TV series House is based on Sherlock Holmes #fact http://bit.ly/5Sm2pU #holmes","time":1260258954},{"text":"sherlock holmes was awesome. making me doubly glad I met robert downey jr. today!","time":1260246361},{"text":"RT:I should do some writing, but I feel like reading more of SHERLOCK HOLMES \u0026 THE WAR OF THE WORLDS in.. http://bit.ly/6bAfwh #holmes","time":1260248312},{"text":"RT:Sherlock holmes looks like it\u0027s gonna be good. http://bit.ly/8fkIFd #holmes","time":1260248313},{"text":"I can\u0027t wait till Sherlock Holmes comes out. It\u0027s gonna be soooo good :)","time":1260248430},{"text":"My Victorian caroling costume is adorable! (Way better than the lovechild-of-Sherlock-Holmes-\u0026-Mrs-Claus horror the costumers usually send!)","time":1260253287},{"text":"RT:(Movies Online)    Sherlock Holmes http://bit.ly/7T1MyR-.. http://bit.ly/87KnSW #holmes","time":1260255454},{"text":"@jonesy_ Ok. Now i am starting to get Sherlock Holmes on your ass..mainly cos i want to pretend i am a patch on RDJr. What are you up to? ;)","time":1260257226},{"text":"RT:going to watch lvin and the Chipmunks 2, Sherlock Holmes \u0026 maybe The Storm Warriors this Christmas http://bit.ly/51Aflc #holmes","time":1260258955},{"text":"RT:And I love Sherlock Holmes. Great mind indeed. http://bit.ly/4WEj4U #holmes","time":1260258956},{"text":"RT:On the day that whatshisname\u0027s shizzlety new Sherlock Holmes bullshit comes out, I will watch Billy .. http://bit.ly/8ZmlVp #holmes","time":1260248319},{"text":"@catatonique - there is truly an abundance of fail dialogue. that\u0027s for sure. in other news though I want to see Sherlock Holmes like NOW!","time":1260251791},{"text":"Me too. Reaching here: 1st RT @jonitchr: RT @qtfan: When is Sherlock Holmes with Robert Downey Jr out? Christmas Day Cannot wait to see it","time":1260251807},{"text":"RT:Is anyone else excited for Xmas day? --no not presents but to see Sherlock Holmes. RDJ \u0026 JL 2gether!.. http://bit.ly/8puDSn #holmes","time":1260253618},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260255406},{"text":"RT:@zackarr Walao I prefer to watch Planet 51. Equally lameness but haha. Avatar and Sherlock Holmes lo.. http://bit.ly/5wj1Xb #holmes","time":1260255451},{"text":"RT: http://www.sfcinemacity.co.th/index.php/th/movie-detail/Sherlock-Holmes http://bit.ly/4IaiDc #holmes","time":1260255456},{"text":"RT:The Sherlock holmes movie looks pretty tight... I\u0027m excited to see it. I\u0027m also excited that Downey .. http://bit.ly/77ooUO #holmes","time":1260258952},{"text":"RT @thomaslennon: Re-reading Conan Doyle\u0027s Sherlock Holmes. Forgot how often he ripped his shirt off and kicked the shit out of somebody.","time":1260247075},{"text":"RT:I really enjoyed Sherlock Holmes. When I see it again, I\u0027m going to count how many times ginger mid.. http://bit.ly/8GxhiM #holmes","time":1260253617},{"text":"Sherlock Holmes Trailer --\u003e http://bit.ly/6yaDvq","time":1260270243},{"text":"Sherlock Holmes is based on a Doctor and the TV series House is based on Sherlock Holmes #fact","time":1260263543},{"text":"New post: Sherlock Holmes (http://cli.gs/7y6av)","time":1260260931},{"text":"I have win the Sherlock Holmes film tickets from English Builder!!!\u003e.\u003c","time":1260272988},{"text":"SO EXCITING \u003c3 http://rex.tbreak.com/3422/competitions/sherlock-holmes-win-tickets-to-the-dubai-premiere.html","time":1260259619},{"text":"TheCornwall Team will be in the Victorian Market on Lemon Quay from tomorrow. Dressed as a Pirate, James Bond \u0026 Sherlock Holmes.. Hmmm!","time":1260261452},{"text":"@backstreetgal well contemprary and real also like conspirasy novels my most favourite though is Sherlock Holmes. How abt u?","time":1260262451},{"text":"RT:Ad for the Sherlock Holmes film on the side of the 18 bus! http://bit.ly/6Sh1vl #holmes","time":1260262679},{"text":"Veja cinco novos cartazes de Sherlock Holmes http://tinyurl.com/yharpd5","time":1260270105},{"text":"I cannot wait for the new Sherlock Holmes with Rachel McAdams, Robert downey junior and Jude Law!","time":1260270944},{"text":"Just seen the Sherlock Holmes trailer. Always nice when they stay faithful to the original stories.*chuckles*","time":1260271039},{"text":"Photo: Rachel McAdams at the Sherlock Holmes Press Con http://tumblr.com/xmd4jhhfk","time":1260271103},{"text":"RT:[] 2009-12-22 Sherlock Holmes Hans Zimmer [CD] http://bit.ly/5VAZLt http://bit.ly/8yRlsO #holmes","time":1260273434},{"text":"Is this worth adding to my subscriptions? RT @comix411 Victorian Undead: Sherlock Holmes Vs. Zombies! | Comix 411 http://bit.ly/5q74Yo","time":1260262262},{"text":"RT:Is this worth adding to my subscriptions? RT @comix411 Victorian Undead: Sherlock Holmes Vs. Zombies.. http://bit.ly/6NCkuM #holmes","time":1260262680},{"text":"WELCOMING MY NEEZY @versatilevilans I LOVE YOU FAM! NO KINK, NO HOMO, NO MARYLIN MANSON, NO SHERLOCK HOLMES, NO FRUITCAKE!","time":1260269473},{"text":"RT @thomaslennon: Re-reading Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped shirt off and kicked shit out of someone. [","time":1260269777},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260270289},{"text":"RT:@knucklesthedog Robert Downey Jr. is going to hit this one out of the park. Sherlock Holmes will be .. http://bit.ly/8wHgch #holmes","time":1260273435},{"text":"RT:Baker Street Tube gets Sherlock Holmes makeover ahead of new film... www.printerslounge.com/en/node/.. http://bit.ly/63WOYz #holmes","time":1260270105},{"text":"Kick Ass tomorrow, and Sherlock Holmes - a woo hoo","time":1260276033},{"text":"Sooo looking forward to seeing Sherlock Holmes on Christmas day!","time":1260278649},{"text":"i can\u0027t wait to watch avatar and sherlock holmes.....","time":1260282711},{"text":"@laritaras Ahhh! Sweet. I\u0027m so excited for Sherlock Holmes :P","time":1260279713},{"text":"The more trailers for SHERLOCK HOLMES I see, the angrier I get; they\u0027re like a reverse Valium!","time":1260287191},{"text":"I find Robert Downey Jr.\u0027s coif in Sherlock Holmes to be highly unlikely for the time period. I\u0027m on to you, Hollywood.","time":1260273612},{"text":"Sherlock Holmes print campaign: http://ilnk.me/d6a (imagine a QR Code that lets you watch the trailer)","time":1260273793},{"text":"I\u0027m really only excited for Christmas for the people I\u0027ll get to see, and Sherlock Holmes. Oh, and drinking.","time":1260275175},{"text":"My movies : This week :The forth kind, next week : The Avatar and the last one : The Sherlock Holmes...That\u0027s Cool !!!","time":1260276022},{"text":"After reading sherlock holmes, i\u0027ll continue reading Cold Hearted. Oh Man, I Love Detective books! My passion!","time":1260276496},{"text":"New Sherlock Holmes game! Will you play as Holmes or Watson? www.221b.sh","time":1260279015},{"text":"Falta apenas um ms pra estreia de Sherlock Holmes.Cool! #holmes","time":1260283257},{"text":"@Escape_Studios Avatar does not convince me. I choose Alice in Wonderland and Sherlock Holmes","time":1260283680},{"text":"Excited for this #movie. #uk RT @FarWriter: For more on the new Sherlock Holmes movie and its UK locations: http://bit.ly/6fMxDq.","time":1260283782},{"text":"RT @spiritangel04: Sherlock Holmes supporters - Please follow my blog: http://undershawhelp.blogspot.com and pledge your help with Conan ...","time":1260284969},{"text":"RT:I\u0027m down for seeing \u0027Sherlock Holmes\u0027 and \u0027Avatar\u0027 over the holidays. Who coming with? http://bit.ly/80JWTH #holmes","time":1260287699},{"text":"Just had meeting with Clive Russell,Sherlock Holmes actor I mentioned,and he\u0027s going to be in the film!hurrah!","time":1260287810},{"text":"Con las maletas listas para viajar a Londres al World Premiere de Avatar, Sherlock Holmes and Did you hear about the Morgans?...niceeeeeeee","time":1260273975},{"text":"RT:Could the strange behavior of Sherlock Holmes be diagnosed?Doctor Watson i presume?? http://su.pr/7k.. http://bit.ly/51D3Nr #holmes","time":1260275307},{"text":"RT:I\u0027m really only excited for Christmas for the people I\u0027ll get to see, and Sherlock Holmes. Oh, and d.. http://bit.ly/5VK93K #holmes","time":1260275311},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260277127},{"text":"Kok mirip?? RT @missydanz: After reading sherlock holmes, i\u0027ll continue reading Cold Hearted. Oh Man, I Love Detective books! My passion!","time":1260277166},{"text":"Apologies to Up in the Air, Fantastic Mr. Fox, Sherlock Holmes, Bright Star, French Kissers and Avatar who will miss out on the cutoff date","time":1260277436},{"text":"Como diria Sherlock Holmes Alimentar meu caro Watson Fui almoar. Deixe seu RT que depois eu leio!","time":1260277625},{"text":"Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit out of somebody.","time":1260279087},{"text":"Como diria Sherlock Holmes Alimentar meu caro Watson Fui almoar. Deixe seu RT que depois eu leio!","time":1260279415},{"text":"RT @thomaslennon: Re-reading all of Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped shirt off and kicked shit out of somebody.","time":1260279794},{"text":"RT:For more on the new Sherlock Holmes movie and its UK locations: www.visitbritain.com/sherlockholmes http://bit.ly/89OPVU #holmes","time":1260282489},{"text":"Why, oh why, must Sherlock Holmes have been written by a Brit? I want to write more about him for my American Lit paper!","time":1260282753},{"text":"yay! a great review of my friend\u0027s awesome new ARG for two game for Sherlock Holmes. http://bit.ly/6umXIC I love this project!","time":1260282936},{"text":"RT @avantgame: yay! great review of my friend\u0027s awesome new ARG for two game for Sherlock Holmes http://bit.ly/6umXIC I love this project!","time":1260282994},{"text":"RT @avantgame: yay! a great review of my friend\u0027s awesome new ARG for two game for Sherlock Holmes. http://bit.ly/6umXIC I love this p ...","time":1260285256},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260285696},{"text":"RT @avantgame: yay! a great review of my friend\u0027s awesome new ARG for two game for Sherlock Holmes. http://bit.ly/6umXIC I love this...","time":1260285706},{"text":"RT:@duhrocha ow the director of sherlock holmes is going to be at regent street,apple store on the 16th :D http://bit.ly/5sDQCx #holmes","time":1260286092},{"text":"RT:@cltgeeks What say we all dress in steampunk garb and go see Sherlock Holmes on the day after Christ.. http://bit.ly/83KOsT #holmes","time":1260286094},{"text":"RT @avantgame: yay! a great review of my friend\u0027s awesome new ARG for two game for Sherlock Holmes. http://bit.ly/6umXIC I love this proje","time":1260286168},{"text":"Cultural distribuira ingressos para o filme Sherlock Holmes, que estreia em 2010, na festa de Confraternizao.http://bit.ly/5Y1wJt","time":1260286870},{"text":"RT:Preview da trilha sonora de Sherlock Holmes por Hans Zimmer: http://bit.ly/5KPoBz Ate eu que odeio o.. http://bit.ly/77kmjP #holmes","time":1260275305},{"text":"RT:After reading sherlock holmes, i\u0027ll continue reading Cold Hearted. Oh Man, I Love Detective books! M.. http://bit.ly/7u8ved #holmes","time":1260277304},{"text":"RT:woooww... ada sherlock holmes the movie, starring Robert Downey Jr dan Jude Law... hrs masuk daftar .. http://bit.ly/4Y89qF #holmes","time":1260287702},{"text":"Looking forward to this new \u0027sassy\u0027 Sherlock Holmes","time":1260298262},{"text":"@gofoboRSVPCodes do you know what the RSVP code is for Sherlock Holmes in Cincinnati? Thanks!","time":1260301984},{"text":"RT @CandaceHavens: Heading out to see Sherlock Holmes and Nine. I hope it\u0027s a good movie day. :)","time":1260294287},{"text":"@dad2rem You\u0027re referring to my Sherlock Holmes comments, I assume (the other options being Planet Earth and Larry King)?","time":1260295840},{"text":"So excited about the Dec. movies-Up in the Air-Clooney AMAZINGNESS, NINE-I\u0027m going to see it 9 more times-I can\u0027t wait for Sherlock Holmes!","time":1260298916},{"text":"RT @guyadams: Definition of optimism: adverts in today\u0027s Variety touting Guy Ritchie\u0027s Oscar credentials for Sherlock Holmes","time":1260300455},{"text":"TPR: What Is The Diagnosis for Sherlock Holmes?: If you are a mystery reader, this ones for you. Mysteries, at t... http://bit.ly/601IU4","time":1260300535},{"text":"RT @Exhibitgroup 3 photos posted on Facebook in the album \u0027Sherlock Holmes\u0027 Investigates The Grove in Los Angeles http://bit.ly/6NWgXG","time":1260302388},{"text":"Seems like a pretty ho ho hum bunch of holiday movies. The only ones I\u0027ll probably see are Avatar and Sherlock Holmes.","time":1260288232},{"text":"@frillylurn my fingers survived. i bought myself a zippo handwarmer thingie :D its awesome. PS: im scared for sherlock holmes, dec 25","time":1260292075},{"text":"RT:Sherlock Holmes TV Spot Only Thing Trailer Addict http://bit.ly/8m4vid http://bit.ly/5xLcgy #holmes","time":1260294126},{"text":"RT:@stevemcghee I remember playing Sherlock Holmes on my 16Mhz 386SX with a 1X CD-ROM which featured fu.. http://bit.ly/62FQet #holmes","time":1260294186},{"text":"RT:Blockbuster Buzz: Sherlock Holmes Competition: Win premiere tickets http://bit.ly/4yMdlY http://bit.ly/5hZrO0 #holmes","time":1260296946},{"text":"RT:Hitler reacts to seeing the new Sherlock Holmes trailer http://bit.ly/4PV2WC #sherlockholmes http://bit.ly/6sOjWw #holmes","time":1260296953},{"text":"CONTEST: Win A Sherlock Holmes Prize Pack worth $193 dollars from the Florida Lottery and 94.9 TNT!!! \u003d... http://bit.ly/91Q1oh","time":1260298453},{"text":"RT:I posted 3 photos on Facebook in the album SHERLOCK HOLMES THE MOVIE http://fb.me/3qq8yvb http://bit.ly/7nhIm3 #holmes","time":1260300646},{"text":"I don\u0027t care for the word, but SHERLOCK HOLMES is, as much as anything else, a bromance.","time":1260314718},{"text":"RT @cinemablend: Review: Sherlock Holmes http://bit.ly/8ndWtF","time":1260314806},{"text":"Sherlock Holmes - Robert Downey Jr. Jude Law Rachel McAdams :) Mark Strong http://sherlock-holmes-movie.warnerbros.com/ - Who\u0027s goin w/me ?","time":1260306571},{"text":"MOVIE: a new poster and several character banners for Sherlock Holmes: http://forum.superpouvoir.com/showpost.php?p\u003d317173\u0026postcount\u003d42","time":1260304222},{"text":"RT @Skepta: @ChipmunkArtist I\u0027ll remember that bruva.. 2012 \u0026 Sherlock Holmes no holmes NEXT","time":1260305231},{"text":"@ElizabethJoan @dolls123 YOU and your Watson will be going to a screening of #Sherlock Holmes at Mann\u0027s Chinese! #biggulp","time":1260306641},{"text":"Just saw SHERLOCK HOLMES. Lots of fun, and not quite as PIRATES OF THE CARIBBEAN-ish as the commercials make it look. Good setup for sequel!","time":1260307449},{"text":"YAY! Sherlock Holmes got great reviews! terrific entertainment that\u0027s equal parts brains and brawn... In short, it\u0027s a blast","time":1260314651},{"text":"Ooh how I can\u0027t wait to see Sherlock Holmes. (Mmm Robert Downey Jr. \u0026 Rachel McAdams)","time":1260316491},{"text":"RT @thomaslennon: Re-reading all of Conan Doyle\u0027s Sherlock Holmes stories. Forgot how often he ripped his shirt off and kicked the shit ...","time":1260310491},{"text":"PERFEKT! 2 personers ARG/adventure spil som reklamerer for Sherlock Holmes filmen, facebook connect http://www.221b.sh/ /via @boab - fedt!","time":1260311722},{"text":"When you have eliminated the impossible, whatever remains, however improbable, must be the truthkgb \u0026 sherlock holmes http://ping.fm/J0ynB","time":1260311973},{"text":"http://judao.mtv.uol.com.br/cinema/cinco-novos-posteres-de-sherlock-holmes/attachment/sherlock03/ Jude Law casa cmiigo *----------*","time":1260314791},{"text":"@gofoboRSVPCodes Sherlock Holmes Seattle code SWEEKM228","time":1260320278},{"text":"@hutchess btw after all that crap...the sherlock holmes thing SUCKS","time":1260322258},{"text":"Ray Greene gives SHERLOCK HOLMES 5 stars: http://tinyurl.com/yhsvfnf","time":1260322762},{"text":"And like any good Sherlock Holmes story, it grinds to a halt whenever a woman shows up.","time":1260317499},{"text":"RT:Sherlock Holmes revived: http://bit.ly/8vjMVK Cool! http://bit.ly/6Cmd2H #holmes","time":1260320430},{"text":"RT:also, i want to watch sherlock holmes. So cool. http://bit.ly/74Oi0o #holmes","time":1260320437},{"text":"Sherlock Holmes was exactly the movie I hoped it would be. So much fun. Can\u0027t wait for the sequel!","time":1260322493},{"text":"Cinema: Veja cinco novos cartazes de Sherlock Holmes http://bit.ly/8uAkwq RT @saladacultural","time":1260322541},{"text":"RT @rickmarshall: Sherlock Holmes was exactly the movie I hoped it would be. So much fun. Can\u0027t wait for the sequel!","time":1260322715},{"text":"RT @saladacultural Cinema: Veja cinco novos cartazes de Sherlock Holmes http://bit.ly/8uAkwq","time":1260323272},{"text":"I wish I\u0027ll have a boyfriend by Christmas, because theirs a certain somebody that I want to go see Sherlock Holmes with.","time":1260325643},{"text":"Still love Robert Downey jr and cannot wait to see him Sherlock Holmes !","time":1260326292},{"text":"@kitsunethoughts The intonation? Sounds cool, but I\u0027m afraid that I don\u0027t pay attention to that. Sherlock Holmes fail.","time":1260327994},{"text":"Eliminate all other factors, and the one which remains must be the truth. -- Sherlock Holmes, in The Sign of the Four #quote","time":1260328844},{"text":"A lot is getting done. Rewarding myself tonight with a break: Hershey\u0027s chocolate and some reading of Sherlock Holmes.","time":1260329803},{"text":"RT @latinaprpro: No idea! Can\u0027t wait for the movie -though ;) RT @7ElevenSoCal: Did you know there is a #Sherlock Holmes Museum in the UK?","time":1260317452},{"text":"Home from Sherlock Holmes and Nine. I can\u0027t review the films yet, but I can say it was quite a wonderful day. Shopping, eating, movies... :)","time":1260330059},{"text":"RT:a dica foi da @jubalinha \u003e\u003e\u003e Sherlock Holmes http://okm.me/1AQD Com Robert Downey Jr e Ju.. http://bit.ly/5CKtSn #holmes","time":1260320426},{"text":"RT:Vou aviisaar heeim! Ta na areaas um Sherlock Holmes dos twitters! Cuidaar ao escreever agoraa #FAT.. http://bit.ly/7FDMAT #holmes","time":1260320433},{"text":"@LexG_Rules are you talking about Sherlock Holmes?","time":1260336899},{"text":"  Sherlock Holmes http://www.ravok.ir/node/44309","time":1260337065},{"text":"Nay, I am. RT @evacelia: Am I the only one who\u0027s looking forward to sherlock holmes??","time":1260331515},{"text":"Netflix Watch Instantly has turned into the Sherlock Holmes/SNL channel.","time":1260337075},{"text":"There is a Sherlock Holmes movie coming out? sa-weet! XD","time":1260339637},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260340670},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260340729},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260340768},{"text":"On the trail of the cinematic Sherlock Holmes http://bit.ly/7PyP0w","time":1260340942},{"text":"your like a poetic sherlock holmes, you are, on that shit. lol","time":1260341505},{"text":"EFC #Sherlock Holmes review of the day - The Spider Woman: http://www.efilmcritic.com/review.php?movie\u003d20020\u0026reviewer\u003d371","time":1260331557},{"text":"@gofoboRSVPCodes what is the code for the sherlock holmes screening for valley view, ohio? i want to take my dad for his birthday!","time":1260331745},{"text":"Guy Ritchie says his Sherlock Holmes film is a buddy movie in a similar vein as \u0027Butch Cassidy And The Sundance Kid\u0027.","time":1260335082},{"text":"And I\u0027m pretty damn stoked on the sherlock holmes movie coming out. Date opportunity??","time":1260335431},{"text":"Just bought the entire Sherlock Holmes collection (Kindle Edition) for $0.99. I love mystery genre. Holmes is considered the best. Let\u0027s see","time":1260335482},{"text":"Robert Downey is Sherlock Holmes.. and Jude Law is John Watson ? wow .. a little odd .. but we\u0027ll see.","time":1260335837},{"text":"Movies I wanna see: Sherlock Holmes, An Education, Nobel Son, City of Ember, A Single Man, Up, Princess and the Frog.","time":1260338108},{"text":"Audio book The Life of Arthur Conan Doyle the infamous Sherlock Holmes author http://bit.ly/8v9Bb","time":1260341122},{"text":"RT:your like a poetic sherlock holmes, you are, on that shizzle. lol http://bit.ly/7wFYIb #holmes","time":1260341772},{"text":"RT:Not sure what to think about Sherlock Holmes the action hero http://bit.ly/7LbEc7 #holmes","time":1260341776},{"text":"Mom says I\u0027m Sherlock Holmes for finding a lost letter, retracing steps. She also thinks Salma Hayek is hot, and an Indian Muslim to boot.","time":1260331569},{"text":"RT @RajeevMasand Guy Ritchie says his Sherlock Holmes film is a buddy movie in a similar vein as \u0027Butch Cassidy And The Sundance Kid\u0027.","time":1260335179},{"text":"RT:Irene Adler Movie Poster from Sherlock Holmes - http://tinyurl.com/yjbnmrr http://bit.ly/655ton #holmes","time":1260341773},{"text":"my expectation movie is Sherlock Holmes and ","time":1260355208},{"text":"I really wanna see Sherlock holmes!","time":1260349722},{"text":"Ooo the new Sherlock Holmes looks good, if not exactly true to the original!","time":1260346330},{"text":"@RajeevMasand I am looking forward to Sherlock Holmes - will be a good film to see indeed...","time":1260346341},{"text":"http://bit.ly/7Dhmuo On the trail of the cinematic Sherlock Holmes","time":1260347764},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260354044},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260354045},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260354045},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260354046},{"text":"Los Angeles: On the trail of the cinematic Sherlock Holmes http://bit.ly/85VVNq","time":1260354589},{"text":"Blog: Channel One\u0027s Sherlock Holmes Sweepstakes | Free Stuff Times Contests: Channel One\u0027s Sherlock Holmes Sweepstakes. http://bit.ly/8Lb8Vc","time":1260346528},{"text":"#Grandville Mixes Sherlock Holmes intrigue with 9/11 Conspiracies, Tarantino romance, and a love for Franco-Belgian Bandes-Desinee","time":1260346173},{"text":"so excited for sherlock holmes!! two of my favorite hotties- i mean, actors sharing the silver screen for an action-packed adventure!","time":1260349259},{"text":"Books: The Adventures of Sherlock Holmes: Product DescriptionSince Doyle created the immortal Sherlock Ho.. http://bit.ly/7CCFsv","time":1260355102},{"text":"Hello from London, England! Just arrived, will be here for a few days to interview the stars of SHERLOCK HOLMES and AVATAR!","time":1260355707},{"text":".@pinktank1 re: sherlock holmes. Have you read julian barnes book, Arthur \u0026 George? - it\u0027s incredible, I think you will love it...","time":1260357579},{"text":"FoF is cohosting the Dallas premiere of Sherlock Holmes. Dollhouse star Miracle Laurie live this week. Details @ www.fellowshipoffools.com.","time":1260358940},{"text":"RT: [Holmes] ()Sherlock Holmes http://plurk.com/p/2x6gb1 http://bit.ly/5ZLvfI #holmes","time":1260359901},{"text":"RT @RajeevMasand Guy Ritchie says his Sherlock Holmes film is a buddy movie in a similar vein as \u0027Butch Cassidy And The Sundance Kid\u0027.","time":1260354210},{"text":"Am I excited for the new #Sherlock #Holmes movie? Not Sure. It seems to have 1 part Holmes to 1 part McClaine. Yippee-ki-yay, my dear Watson","time":1260355894},{"text":"If you\u0027re going to watch the new #Sherlock #Holmes movie, my book will assist you in understanding his London http://bit.ly/6BGfR4","time":1260356964},{"text":"Close To Holmes examines the London locations featured in the Sherlock Holmes stories http://tinyurl.com/m68mhk - perfect ahead of new movie","time":1260357325},{"text":"@reeserpie I am wayy proud to be a whore. way proud. its why I have a smile on my face 24/7 but where did u find that miss sherlock holmes??","time":1260358740},{"text":"I wanna see sherlock holmes","time":1260368699},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260361248},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260361248},{"text":"@devilbunnyart Like some people and the new Sherlock Holmes film, heh.","time":1260364075},{"text":"@Zombologist @Zeblue_Prime Are we talking the Guy Ritchie Sherlock Holmes?","time":1260371658},{"text":"Capturing the \u0027real\u0027 Sherlock Holmes http://bit.ly/7mh2Yb","time":1260371896},{"text":"Play the official Sherlock Holmes game #221B www.221b.sh","time":1260372653},{"text":"Blog: Sherlock Holmes - Colony of Gamers: Sherlock Holmes Screen, Page and Song. ... Old Today, 09:06 AM. Ink Asylu... http://bit.ly/6CYERh","time":1260371567},{"text":"Every year, my parents and I go to dinner and a movie on my birthday. This year\u0027s movie? Is SO GOING TO BE Sherlock Holmes.","time":1260362458},{"text":"Novos posters de Sherlock Holmes... no to novos assim. ;] http://ow.ly/K7CK","time":1260362769},{"text":"@samantharonson hit me up in real life. I\u0027m here until Monday. Avatar \u0026 Sherlock Holmes interviews!!!","time":1260365014},{"text":"Win tickets to the advanced screening of \u0027Sherlock Holmes\u0027 http://bit.ly/6bb7aQ #fb","time":1260367837},{"text":"Win a Sony Handycam and Sherlock Holmes movie merchandise - guardian.co.uk http://bit.ly/64h6TX","time":1260369031},{"text":"Free passes to Sherlock Holmes preview screening - http://fwix.com/article/26_66b7c482f3","time":1260369697},{"text":"@MrMadman How can I focus you? I\u0027m imagining a sir sherlock holmes in a pinafore smoking pipe, in front of the screen.","time":1260369968},{"text":"Sherlock Holmes hotel offer to go with Guy Ritchie\u0027s new film http://tinyurl.com/yhjuosb","time":1260372070},{"text":"Going to be incredibly badass! RT @Ezio3feb: Can\u0027t wait for the 25th, Sherlock Holmes is coming out!","time":1260372175},{"text":"RT:Play the official Sherlock Holmes game #221B www.221b.sh http://bit.ly/6Bpc6N #holmes","time":1260372988},{"text":"@m0sbeauTIFulest see i was right...something is up with this #twitter shit. bout to do a sherlock holmes in this bitch","time":1260373823},{"text":"RT @alistaird221b: If you\u0027re going to watch the new #Sherlock #Holmes movie, my book will assist you in understanding his London http:// ...","time":1260362951},{"text":"http://blip.pl/s/25347417 #pogodakrakow Ale takiej mgy Sherlock Holmes jeszcze by si powstydzi, jeszcze nie do Londyska.","time":1260365469},{"text":"RT:@samantharonson hit me up in real life. I\u0027m here until Monday. Avatar \u0026 Sherlock Holmes interviews!!! http://bit.ly/5mSOya #holmes","time":1260365606},{"text":"RT @RegentStOnline: RT @ihowie: Guy Ritchie will be at the Apple Store on Friday to talk about his new Sherlock Holmes film: http://bit. ...","time":1260367878},{"text":"yes! i\u0027ve been waiting to see this for months! RT @Cleveland_Scene: Free passes to Sherlock Holmes preview screening: http://bit.ly/4ODPxN","time":1260370120},{"text":"I AM excited, however, about Sherlock Holmes. Not sure why, really. Maybe it\u0027s just thinking about how pissed Jude Law must be that some...","time":1260372149},{"text":"RT @MetromixCLE We\u0027ve got tix to the advanced screening of \u0027Sherlock Holmes!\u0027 Click this link to win...http://bit.ly/5JuGRu","time":1260373477},{"text":"Yes, I\u0027ll take two, please - A wax figure of Robert Downey Jr. in his latest role as Sherlock Holmes from the new m... http://ow.ly/167MSu","time":1260368510},{"text":"Grabbing lunch with Pat, talking church and Sherlock Holmes","time":1260379871},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260375689},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260375689},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260375711},{"text":"Sherlock Holmes: Cinco novos psteres. http://bit.ly/6xzbOe","time":1260382535},{"text":"Experience the 1890s London of Guy Ritchies Sherlock Holmes: www.221b.sh","time":1260382609},{"text":"Travel to 221B Baker St to visit the world of Sherlock Holmes... www.221b.sh","time":1260374511},{"text":"RT @jamesmoran: The good thing about being on a train in the UK countryside is that you feel like Sherlock Holmes on the way to or from ...","time":1260375092},{"text":"My friend got me Sherlock Holmes in America for my birthday. This is a mark of what a wonderful friend she is, and how obsessed I am.","time":1260375244},{"text":"sooooooo excited about watching Sherlock Holmes. it needs to be closer to Christmas. that\u0027s all i\u0027m saying","time":1260375353},{"text":"Sherlock Holmes with Robert Downey Jr. and Jude Law comes out Christmas Day. Read the books first to get to know Holmes and Watson now.","time":1260375781},{"text":"@mafemosi Ah, I see you\u0027ve figured out the reason Sherlock Holmes. Though I did just reply to you, too. Decade indeed!","time":1260377085},{"text":"@7ElevenSoCal If I were Sherlock Holmes husband would be my Watson because he\u0027s mad clever!","time":1260377544},{"text":"How did I just find out there\u0027s naked male wresteling in Sherlock Holmes? JFC I need to see this movie!","time":1260377726},{"text":"@PishPoshPotato My fav Sherlock Holmes story is definitely The Adventure of the Speckled Band, but I love them all!","time":1260380468},{"text":"@7ElevenSoCal If I were Sherlock Holmes, Watson would be my main bird, my African Grey, Sherlock! Perceptive AND witty!","time":1260381328},{"text":"RT Close To Holmes examines the London locations featured in the Sherlock Holmes stories http://tinyurl.com/m68mhk","time":1260382158},{"text":"@devincf That is because actual women (who make up half the planet+) want to see SHERLOCK HOLMES.","time":1260383845},{"text":"RT @devincf: The tracking numbers Jeff Wells just ran indicate to me that SHERLOCK HOLMES could kill AVATAR in its tracks.","time":1260383992},{"text":"RT @devincf: The tracking numbers Jeff Wells just ran indicate to me that SHERLOCK HOLMES could kill AVATAR in its tracks.","time":1260384181},{"text":"RT @jcferrin: Sherlock Holmes es a la bonaerense, lo que Shakespeare a Belen Francese","time":1260384814},{"text":"RT:Am I the only one out there who wants to see Sherlock Holmes? http://bit.ly/5DzGgC #holmes","time":1260385090},{"text":"RT @jcferrin: Sherlock Holmes es a la bonaerense, lo que Shakespeare a Belen Francese \u003e JAJAJAJA #Pomar","time":1260385313},{"text":"Charlie D\u0027Agata talks to the casts and crews of AVATAR and SHERLOCK HOLMES this weekend in LONDON. Stay TUNED!","time":1260385948},{"text":"@pseudonymDK I thought of Inspector Lestrade from Sherlock Holmes - it guessed at William of Baskerville from Name of the Rose. Fail. :(","time":1260387533},{"text":"So many movies I need to see! Precious, Brothers, Up in the Air, Sherlock Holmes, Princess and the Frog, Blind Side . . .","time":1260387963},{"text":"Multimediale Lesungen Frhjahr 2010 mit Sherlock Holmes, Kstner, Zaimoglu und jungen Autoren http://www.gefuehlskonserve.de/?p\u003d4369","time":1260388238},{"text":"@susiesioux Really? Well,all the time I saw old movies e.g. Sherlock Holmes it was dark,damp,foggy,eerie...but not,when I visited London ;-)","time":1260375745},{"text":"I\u0027m thinking of spending all of Xmas day at the movie theatre. Nine and Sherlock Holmes seem like they\u0027ll go well with my Chinese food.","time":1260382716},{"text":"RT:Experience the 1890s London of Guy Ritchies Sherlock Holmes: www.221b.sh http://bit.ly/4u6gCd #holmes","time":1260382771},{"text":"That would be funny RT @devincf The tracking numbers Jeff Wells just ran indicate to me that SHERLOCK HOLMES could kill AVATAR in its tracks","time":1260384416},{"text":"RT:Sherlock Holmes vs. Captain Kirk - Babel Clash http://bit.ly/4L62ph http://bit.ly/6nh3yK #holmes","time":1260388736},{"text":"Blog: New \u0027Sherlock Holmes\u0027 posters stand tall - From Inside the Box ...: We really can\u0027t wait till Sherlock Hol... http://bit.ly/4zJZX7","time":1260382199},{"text":"RT:Nieuw blogbericht: Speel Roddel Je Rot...: Speel de speciale Q Top 1000 en Sherlock Holmes editie va.. http://bit.ly/6d8OFZ #holmes","time":1260382750},{"text":"I want to see sherlock holmes @kateeng!","time":1260395314},{"text":"That new sherlock holmes movie looks quite good i\u0027m thinking!","time":1260388970},{"text":"@stainedstephiee ME TOO! I can\u0027t stop starring at all the Sherlock Holmes billboards!","time":1260389415},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260390187},{"text":"Twitter / Guardian Tech: Sherlock Holmes and a new ... http://ow.ly/167SSh","time":1260390549},{"text":"Are you playing #221B, the online Sherlock Holmes experience? www.221b.sh","time":1260391324},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260397278},{"text":"Veja cinco novos cartazes de Sherlock Holmes - http://migre.me/dGmk","time":1260397280},{"text":"@gavia1 I want to make a t-shirt that says I\u0027d Rather Be Reading Sherlock Holmes.","time":1260398517},{"text":"It\u0027s elementary, my dear Watson! Find out why we\u0027re so excited for Sherlock Holmes in our new blog: http://bit.ly/6zOiow","time":1260391189},{"text":"Haha! I was sherlock holmes london style RT @mdotperiod: @DJKSLY LOL at all of us dressed like we were going to Big Bear last night!!!","time":1260391810},{"text":"Sherlock Holmes looks awful and I hate Guy \u0027I\u0027m a pwoper cocker-nee\u0027 Ritchie. But loads was filmed near me so I want to see it now :S","time":1260392381},{"text":"Saw Sherlock Holmes today. Downey and Law are top-notch, though I found the plot convoluted to say the least. Still, a lot of fun to see.","time":1260392799},{"text":"Continuing my sick leave by watching the BBC\u0027s Sherlock Holmes on youtube. Getting in touch with my inner 8 year old. The game is afoot!","time":1260393916},{"text":"@drfidelius i dont understand how sherlock holmes can still be SO FREAKING GOOD. i would always prefer to read it. greatest love story ever?","time":1260399154},{"text":"Don\u0027t go see the new Sherlock Holmes film, come to my apartment, drink and listen to me recite from a 1920s complete edition","time":1260400532},{"text":"transient - sherlock holmes - wavesync.co.uk","time":1260408864},{"text":"@montimer Let me know what you think of Sherlock Holmes!","time":1260410372},{"text":"RT @wangxingcs: 09-Sherlock.Holmes http://9911.ms/5BpC","time":1260414015},{"text":"Experience the 1890s London of Guy Ritchies Sherlock Holmes: www.221b.sh","time":1260408610},{"text":"Sherlock Holmes NEVER said, Elementary, my dear Watson. #USE","time":1260412985},{"text":"RT @freemovies: NEW! Free Advance Movie Screening of Sherlock Holmes in Chicago, IL: http://advancescreenings.com/screening/3588","time":1260404021},{"text":"RT @andiegibsonnn: RDJ was born to play sherlock holmes. it almost makes me want to pick up the books and start reading again.","time":1260410362},{"text":"@TashaRobinson @neilhimself Sherlock Holmes, Sue Grafton, almost any Mystery series, Sookie Stackhouse, Merry Gentry, The Land Before Time","time":1260410540},{"text":"Jeremy Brett as Sherlock Holmes looks disturbingly like my grandfather, if Bapa was both British and a vampire. And an opium fiend.","time":1260412197},{"text":"@xaprilmartinez ALSO OMG OMG OMG SHERLOCK HOLMES COMMERCIAL AAAAAAHHHHHHHH i need to stfu","time":1260414777},{"text":"@IQXS WQLN, long history, Upstairs Downstairs, Sherlock Holmes, Eastenders! Before Cable WQLN was the only culture.","time":1260415360},{"text":"@thegnc Sherlock Holmes will break records. Trust me. On Christmas Day I will not leave the house to watch old divorces.","time":1260416122},{"text":"I imagine around Dec 27th the police will be looking for Sherlock Holmes to charge him with the Rape of Avatar....Its going to get ugly","time":1260417051},{"text":"@ssmirnov @ohdoctah I\u0027m totally psyched to see Sherlock Holmes. If we tried to all go together, they\u0027d prolly toss us out. #sh*tdisturbers","time":1260410455},{"text":"After seeing the preview for Sherlock Holmes I\u0027m kinda envying Rachel McAdams - acting between Jude Law and Robert Downey Jr? Lucky girl!","time":1260413361},{"text":"RT @TeresaKopec: Can\u0027t wait for Robert Downey Jr. in Sherlock Holmes though no doubt it will piss Holmes purists off. Previews look great.","time":1260404120},{"text":"RT @TeresaKopec Can\u0027t wait for Robert Downey Jr. in Sherlock Holmes though no doubt it will piss Holmes purists off. Previews look great","time":1260404185},{"text":"Sherlock Holmes is going to be the shit.","time":1260420397},{"text":"Explore the world of Sherlock Holmes www.221b.sh","time":1260417626},{"text":"@Jongirl4evah Sherlock Holmes is deffo on my list to watch!!!","time":1260426497},{"text":"@lovedrug and a sherlock holmes type with the world against him","time":1260428399},{"text":"Blog: Double Feature: Sherlock Holmes\u0027 Smarter Brother + The Postman ...: Sherlock Holmes primer. The Adventure of ... http://bit.ly/7OjkN7","time":1260431678},{"text":"oh my gosh i want to see sherlock holmes so bad. it looks awesome.","time":1260420315},{"text":"Come to my house for christmas..muaha it doesn\u0027t take sherlock holmes to figure it out.","time":1260422895},{"text":"There\u0027s so much fog, feels like i\u0027m in a sherlock holmes movie","time":1260430869},{"text":"Sentinel| ROBERT DOWNEY JR. ON THE CINEMATIC TRAIL OF SHERLOCK HOLMES: Robert Downey Jr as Sherlock Holmes and Jude... http://bit.ly/6V7vmC","time":1260418348},{"text":"RT @holmesnews: Blog: The new Sherlock Holmes movie - Robert Downey stays true to a ...: Sherlock Holmes and his sidekick, Dr. Wats... h ...","time":1260425108},{"text":"@Seksibrain Have you seen Sherlock Holmes? I\u0027m thinkin Ima see that or blind side.","time":1260419990},{"text":"The upcoming Sherlock Holmes movie looks terrible. Beneath this pillow lies the key to my release. I get it, but it\u0027s just not funny.","time":1260420366},{"text":"I WANT TO SEE SHERLOCK HOLMES SO BAD. RACHEL MCADAMS, ROBERT DOWNEY JR. AND JUDE LAW!? FUCK YEAH! TRIPLE THREAT!","time":1260420369},{"text":"Dude, Sherlock Holmes and Watson were secret lovers throughout the book series. MIND. BLOWN.","time":1260420404},{"text":"@nattynat15 I thought you meant for a new episode of Glee. I see now you were referring to the hottness that will be Sherlock Holmes","time":1260420573},{"text":"Sherlock Holmes isn\u0027t exactly the easiest movie to write about. And I need to get at least preliminary thoughts down because tomorrow...","time":1260420663},{"text":"RT:Jessica fletcher...the sherlock holmes of her time. http://bit.ly/5AeMPr #holmes","time":1260421105},{"text":"On the trail of the cinematic Sherlock Holmes -- latimes.com http://j.mp/6Ge01e","time":1260422153},{"text":"RT @EricDSnider I\u0027m very disappointed that at no point in SHERLOCK HOLMES does anyone say, No s***, Sherlock. #missedopportunity","time":1260423904},{"text":"@brunablack I want to see Sherlock Holmes, Robert and Jude look pretty darn good in the previews Ive seen so far.","time":1260423947},{"text":"Excuses, excuses. You\u0027re going to see Sherlock Holmes on Christmas Day, like it or not!","time":1260425715},{"text":"RT:@MOFOTOXXX Im gonna be somewhere watching Sherlock Holmes http://bit.ly/4r1ik8 #holmes","time":1260426602},{"text":"Sherlock Holmes the official movie game is released on all operator wap portal in HK. Check it out! http://tiny.cc/haWVh","time":1260427604},{"text":"RT @ZahnmimreS: Soundtrack Preview: Sherlock Holmes By Hans Zimmer http://bit.ly/6UEYwk","time":1260427720},{"text":"@Andys_Films_etc Though I think the real Sherlock Holmes (character) wouldn\u0027t be amused!","time":1260429916},{"text":"movie list for the season: avatar, invictus, nine, up in the air, sherlock holmes, the lovely bones, it\u0027s complicated.","time":1260430277},{"text":"RT:but, ayyyy brah, jude law is in it too...... ;D [yes, i\u0027m talking about sherlock holmes, AGAIN] http://bit.ly/5IjvS9 #holmes","time":1260417652},{"text":"RT:@thegnc Sherlock Holmes will break records. Trust me. On Christmas Day I will not leave the house to.. http://bit.ly/4FutWg #holmes","time":1260417654},{"text":"RT:@lajabear Wasnt she in Sherlock Holmes...she was ight but I still think Monique was better http://bit.ly/7GEpAy #holmes","time":1260421102},{"text":"RT:Beginning the Adventures of Sherlock Holmes, epi 1 on Hulu http://bit.ly/8G5x4w http://bit.ly/84W5jY #holmes","time":1260421104},{"text":"RT:I cant wait till sherlock holmes \u0026 its tht complicated come out xmas day :) http://bit.ly/4yjhKr #holmes","time":1260421107},{"text":"RT:Come to my house for christmas..muaha it doesn\u0027t take sherlock holmes to figure it out. http://bit.ly/7gN8QU #holmes","time":1260423031},{"text":"I\u0027ve got no right to complain, but I\u0027m still sad that I\u0027ll be on #vacation\u0026won\u0027t see #movies that come out on Xmas day, esp. Sherlock Holmes","time":1260423483},{"text":"Lisa doesn\u0027t want to go see Sherlock Holmes because she doesn\u0027t know anything about him. What Lind of bullshit is that.","time":1260425498},{"text":"lousy migraine making me miss the Lovely Bones premiere. Oh well, at least I have Sherlock Holmes next week. And Up in the Air tomorrow","time":1260427572},{"text":"RT:Blockbuster Buzz Times Online WBLG Sherlock Holmes Competition Win ... http://bit.ly/5vH925 http://bit.ly/6xFSAx #holmes","time":1260430035},{"text":"RT:Part 3 of our #Sherlock Holmes series is up on the LW Blog www.londonwalkblog.blogspot.com http://bit.ly/71Zd0l #holmes","time":1260430038},{"text":"RT:@Andys_Films_etc Though I think the real Sherlock Holmes (character) wouldn\u0027t be amused! http://bit.ly/8REkJS #holmes","time":1260430041},{"text":"Blog: December\u0027s Box Office Battle: Avatar Versus Sherlock Holmes - Best ...: Over the last few weeks as I talk to ... http://bit.ly/6xJpIz","time":1260431679},{"text":"RT:@thegnc Sherlock Holmes will break records. The Meryl Streep movie will not make more money than Pr.. http://bit.ly/8V3WLU #holmes","time":1260417659},{"text":"RT:I don\u0027t want to see Sherlock Holmes because I don\u0027t want to boost Robert Downey Jr.\u0027s ego, however u.. http://bit.ly/7km7Pv #holmes","time":1260423027},{"text":"RT:watching the third Case-Closed-movie Kaito Kid vs Conan Edogawa: Sherlock Holmes vs Arsene Lupin (1s.. http://bit.ly/4ImEkf #holmes","time":1260430037},{"text":"RT:@clubMOVIE feeeeia. haha podia ter pego a foto do poster do sherlock holmes, ficaria mto mais gats. http://bit.ly/6U7DzI #holmes","time":1260430040},{"text":"Off to see Sherlock Holmes. Hope it\u0027s good.","time":1260445971},{"text":"RT:Sherlock Holmes http://bit.ly/91ym7M #holmes","time":1260433634},{"text":"The Return of Sherlock Holmes (1987) (TV) On Megaupload [MU] http://bit.ly/5PqEyq","time":1260437950},{"text":"I cannot wait to see Sherlock Holmes! It\u0027s going to be AWESOME!","time":1260443718},{"text":"@Dyana_ Thank you. Are u going to see the Sherlock Holmes on Cristmasday? :)","time":1260445780},{"text":"Interviewing Sherlock holmes cast and Ritchie on Saturday. Anyone got any questions?","time":1260446248},{"text":"RT:Even though Sherlock Holmes the film bears only faint resemblance to Sherlock Holmes the stories I a.. http://bit.ly/6fAmyp #holmes","time":1260441047},{"text":"10 Finalists of Sherlock Holmes Wannabe is out, check out now to see if you are one of them. http://bit.ly/5qE36R","time":1260434162},{"text":"RT Close To Holmes examines the London locations featured in the Sherlock Holmes stories http://tinyurl.com/m68mhk","time":1260435509},{"text":"RT @netmovies Cinco ?novos? posteres de Sherlock Holmes! - http://vqv.me/NL","time":1260435655},{"text":"RT @netmovies: Cinco novos psteres de Sherlock Holmes! - http://vqv.me/NL","time":1260436665},{"text":"@S_Holmes Hi. i love Sherlock Holmes and his stalwart friend Watson. It\u0027s nice to follow a fellow fanatic. :)","time":1260437567},{"text":"i should really get to bed but i want to keep reading my sherlock holmes: the valley of fear and selected cases","time":1260438931},{"text":"RT:The Return of Sherlock Holmes (1987) (TV) On Megaupload [MU] http://bit.ly/5PqEyq http://bit.ly/5NAQTa #holmes","time":1260438975},{"text":"Sherlock Holmes - Win tickets to the Dubai and Abu Dhabi Premiere http://is.gd/5hL8z","time":1260439719},{"text":"@firstshowing I had it confirmed for me the other day that the Iron Man 2 trailer is in front of Sherlock Holmes, not Avatar.","time":1260440255},{"text":"@pinknantucket Sherlock Holmes has Robert Downey Jr in it, which is more than enough reason to go in my book","time":1260440751},{"text":"RT @annarchism: Powerpoint presentation preparation so dull. Wondering What Would Sherlock Holmes Do? Answer is probably: A lot of drugs.","time":1260445350},{"text":"Playing Sherlock Holmes vs Jack the Ripper. Moral dilemma. Is it good to be entertained by something a) gruesome and b) that was real..?","time":1260445464},{"text":"RT:Blog update \u003d Im a Sherlock Holmes in the Making: Guess what? Nuffnang is sending a pair of ticke.... http://bit.ly/6wTh96 #holmes","time":1260435482},{"text":"RT:Sherlock Holmes: Evidence Regarding a Mystery: Newsarama (blog) The fact is the artist, John Watkiss.. http://bit.ly/7OweTl #holmes","time":1260438978},{"text":"RT:i should really get to bed but i want to keep reading my sherlock holmes: the valley of fear and sel.. http://bit.ly/5MDctj #holmes","time":1260438981},{"text":"RT @wbpictures: goofy photos of SHERLOCK HOLMES\u0027 Robert Downey Jr. from his Hand \u0026 Footprint Ceremony on Mon: http://bit.ly/7GsqiB","time":1260440290},{"text":"RT:Published a new post: Sherlock Holmes - Trailer - Kino http://ping.fm/KQNoZ http://bit.ly/6QKL90 #holmes","time":1260441054},{"text":"RT:Today at Bookgasm.com: JJ Adams\u0027 IMPROBABLE ADVENTURES OF SHERLOCK HOLMES, Timothy Hallinans BREATH.. http://bit.ly/7LauUr #holmes","time":1260444972},{"text":"RT @CHICKENSHED_UK: Auctioning 2 incredibly special tickets to world premiere of Guy Ritchie\u0027s - Sherlock Holmes.... http://bit.ly/7Wozbg","time":1260445086},{"text":"RT @Watson_MD: RT:via @janelasky: Robert Downey, Jr. land in London for Sherlock Holmes http://tinyurl.com/yjvuqsh #mo.. http://bit.ly/7 ...","time":1260441744},{"text":"@EuphTweetsToo I think Sherlock Holmes would suit you better?","time":1260448867},{"text":"Films I want to see: Paranormal Activity, A Serious Man, The Road, Sherlock Holmes.","time":1260447574},{"text":"I\u0027d bet quite a bit on SHERLOCK HOLMES beating AVATAR at the Box Office.","time":1260449114},{"text":"@jwcounts but what about Robert Downey Jr?? I mean Sherlock Holmes?","time":1260456602},{"text":"RT:What movie are you more hyped to see, Sherlock Holmes or Avatar? I wanna see Sherlock Holmes. Avatar.. http://bit.ly/6kVQU4 #holmes","time":1260452556},{"text":"after the amazing 2012 and new moon, im looking forward to avatar, me \u0026 orson welles, the last song, and sherlock holmes","time":1260446834},{"text":"Iron Man 2 Trailer Confirmed for Sherlock Holmes http://bit.ly/6m90sN","time":1260447621},{"text":"Movies over Christmas break: Avatar (Dec 18), Alvin and the Chimpmunks 2 (Dec 23), Sherlock Holmes (Dec 25), and... http://bit.ly/4ndxnz","time":1260455332},{"text":"@petersagal Preach it; if that\u0027s Sherlock Holmes, I\u0027m Lou Rawls (I\u0027m not, incidentally). http://bit.ly/xehuR","time":1260455477},{"text":"@DonnaFontenot believe it or not, I\u0027d say probably Sherlock Holmes. Love my Kindergarten teacher for that!","time":1260455528},{"text":"RT @EricDSnider I\u0027m very disappointed that at no point in SHERLOCK HOLMES does anyone say, No s***, Sherlock. #missedopportunity","time":1260455768},{"text":"Loving all things Sherlock Holmes right now - considering flying to US for Christmas Day, just to see it 1 day earlier! http://bit.ly/7Fzemp","time":1260457177},{"text":"Young Sherlock Holmes is not as awesome as I remembered as a kid. Ahhh Nostalgia, you sure know how to blind the senses.","time":1260457566},{"text":"When I think about promotional pairings, Sherlock Holmes and 99-cent taquitos isn\u0027t the first to come to mind.","time":1260458304},{"text":"Thanks a lot allstate. Your commercial just scared the shit out of me. Sherlock Holmes commercial too.","time":1260459468},{"text":"RT @blackberrysker Sherlock Holmes,BLACKBERRY GAMES DOWNLOAD FOR FREE http://bit.ly/7WC676","time":1260459717},{"text":"@countessderro ah - but it was at least a little bit Vincent related! But then you don\u0027t have to be sherlock holmes to work that out x","time":1260447256},{"text":"RT:@eevon there is only one box in the hand...where got two? I am sherlock holmes\u0027 reincarnation ok! @k.. http://bit.ly/8jz1wB #holmes","time":1260448163},{"text":"Park Plaza Sherlock Holmes Hotel in London Offers Movie Package: The aptly named Park Plaza Sherlock HolmesHot.. http://bit.ly/4WhoHd","time":1260451823},{"text":"If I had Sherlock Holmes for Secret Santa, he\u0027d see right through my ploys and do fingerprint analysis on the tape used to attach the note.","time":1260452343},{"text":"RT:If I had Sherlock Holmes for Secret Santa, he\u0027d see right through my ploys and do fingerprint analys.. http://bit.ly/5hcqsv #holmes","time":1260452551},{"text":"Blog: Iron Man 2 Trailer Confirmed for Sherlock Holmes - Film School Rejects: Last month I reported on a Twitter-in... http://bit.ly/5FyN5l","time":1260454499},{"text":"RT @petersagal Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder. I\u0027d rather see Satan\u0027s Alley.","time":1260455203},{"text":"Didn\u0027t know Holmes was a cage fighter. RT @petersagal Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder.","time":1260455247},{"text":"RT @petersagal: Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder. I\u0027d rather see Satan\u0027s Alley.","time":1260456499},{"text":"Did I mention #DriveInTweetUp 12/26? We\u0027re getting together to watch Sherlock Holmes - bring the Fam \u0026 tailgate http://twvt.us/DriveIn","time":1260457008},{"text":"New Blog Post: Peterson\u0027s Sherlock Holmes Tobacco Review - I excitedly purchased this tin about a year a half ago, ... http://ow.ly/168aOn","time":1260457798},{"text":"Robert Downey Jr. talks Sherlock Holmes \u0026 Iron Man 2 - RT Interview - Robert Downey Jr. can\u0027t quite remember why he.. http://bit.ly/7Te2NA","time":1260455329},{"text":"Anyone looking forward to the new Sherlock Holmes movie?","time":1260466120},{"text":"You are like Sherlock Holmes ;)RT @cloudnove i\u0027m hoping he\u0027ll show up on Fri for her \u003d)","time":1260463821},{"text":"The local Sherlock Holmes society has a meeting in my livingroom. I\u0027m not kidding. I fled to my study.","time":1260466466},{"text":"That\u0027s pretty true, and yet... RT @petersagal: Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder.","time":1260466808},{"text":"@PennyAsh actually, the fellow who played Sherlock Holmes on the BBC series was really good.","time":1260466920},{"text":"RT @gyveruk: lmfao failmum thought Sherlock holmes and dr Watson were real ppl","time":1260467338},{"text":"New Sherlock Holmes game! Will you play as Holmes or Watson?www.221b.sh","time":1260467987},{"text":"@CiarCullen ...he doesn\u0027t strike me as the Sherlock Holmes type. I thought Holmes was more sophisticated, and not so brutish.","time":1260468315},{"text":"Heh. Sherlock Holmes line You cannot hang a man on a coincidence, quoted by a Japanese blogger and then returned to English via (1)","time":1260471570},{"text":"@pipe_smokers I had the exact same experience with Sherlock Holmes tobacco. I posted a comment on yr blog.","time":1260473942},{"text":"From the New York Times Magazine - did Sherlock Holmes have Asperger\u0027s? http://bit.ly/63ywDA","time":1260474843},{"text":"RT @StanCarey: Sherlock Holmes usually arrived brilliantly very late in the morning; his record for lateness was not coming down until ...","time":1260461074},{"text":"RT:wanna see Sherlock Holmes in the Victorian era\u0027s equivalent to skinny jeans? http://tinyurl.com/yamckmb http://bit.ly/7IIXL1 #holmes","time":1260461935},{"text":"RT @petersagal: Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder. I\u0027d rather see Satan\u0027s Alley.","time":1260463840},{"text":"RT: @petersagal Sherlock Holmes trailer looks like one of the parody trailers from Tropic Thunder. I\u0027d rather see Satan\u0027s Alley.","time":1260464598},{"text":"RT @Watson_MD: RT:Jude Law in Sherlock Holmes http://bit.ly/75RPSa http://bit.ly/8c90Um #holmes","time":1260465618},{"text":"@Shake_Well Because it doesn\u0027t look like the Sherlock Holmes stories I read. it looks like an action flick with a coating of A.C. Doyle","time":1260467120},{"text":"RT @Watson_MD: RT:Residing at Crown Plaza Sherlock Holmes tonight. I am hoping for some themed Hans Zimmer music to go.. http://bit.ly/8 ...","time":1260468997},{"text":"RT @Watson_MD: RT:@CiarCullen ...he doesn\u0027t strike me as the Sherlock Holmes type. I thought Holmes was more sophist.. http://bit.ly/6 ...","time":1260469038},{"text":"RT @Jet_Set: RT @EricDSnider I\u0027m very disappointed that at no point in SHERLOCK HOLMES does anyone say, No s***, Sherlock. #missedoppo ...","time":1260473271},{"text":"RT @Watson_MD: RT:@bergopolis Hey I knew it was coming out and I like Sherlock Holmes. Downey has a high standard to r.. http://bit.ly/5 ...","time":1260465617},{"text":"Wow. Huge RT @bergopolis http://twitpic.com/sy0tt - Have you heard there\u0027s a movie called Sherlock Holmes coming out soon? Yeah, me neither.","time":1260466036},{"text":"@gofoboRSVPCodes do you have the LA Sherlock Holmes RSVP Code?","time":1260479316},{"text":"Screening Sherlock Holmes tomorrow...have to say..kinda excited.","time":1260487641},{"text":"I can recite Heathcliff\u0027s whole I love my murderer speech from Wuthering Heights, a fair amount of Sherlock Holmes dialogue and-","time":1260475777},{"text":"Best selling audiobook #84: The Sherlock Holmes Collection (Unabridged) - Sir Arthur Conan Doyle The... http://dealnay.com/16046","time":1260482921},{"text":"Now that AVATAR is seen, and SHERLOCK HOLMES is tomorrow, I will be focusing my geek lust on IRON MAN 2 going forward.","time":1260483254},{"text":"www.el-talent.com Iron Man 2 Trailer Confirmed for Sherlock Holmes - Film School Rejects http://bit.ly/6lDEtZ","time":1260475901},{"text":"@Veronica It\u0027s Sherlock Holmes, but not as we know it. Personally, I can\u0027t wait for Avatar to see how good e-motion really is.","time":1260482211},{"text":"Baixar jogo para celular Sherlock Holmes: The Official Game: Update do game, agora com o idioma PT-.. http://bit.ly/70ThQH","time":1260483596},{"text":"Baixar jogo para celular Sherlock Holmes: The Official Game: Update do game, agora com o idioma PT-.. http://bit.ly/70ThQH","time":1260483697},{"text":"Reading Sherlock holmes, loving it!","time":1260494552},{"text":"I wants to see Sherlock Holmes.","time":1260501264},{"text":"I want to see Sherlock Holmes","time":1260503165},{"text":"@SmittnbyBritain VERY much looking forward to Sherlock Holmes !","time":1260498458},{"text":"i wanna see It\u0027s Compilicated, Sherlock Holmes, and Nine.","time":1260499996},{"text":"Waaaard i forgot about sherlock holmes coming out in a few weeks! Ehnaice!","time":1260499037},{"text":"Experience the 1890s London of Guy Ritchies Sherlock Holmes: www.221b.sh","time":1260500450},{"text":"No, The Kinks, I am the Sherlock Holmes English Speaking Vernacular, not you.","time":1260503056},{"text":"RT @SamSneaker: RT @BrwnSkinHoney: #menshouldnever try to hide anything from me...alias Sherlock Holmes, Inspector Gadget \u003c~humph me too!!","time":1260491140},{"text":"#whoknew In the UK, Sherlock Holmes fans are called Holmesians, in the US, Sherlockians. #trekkies #soundsarmenian","time":1260491298},{"text":"mahal si SHERLOCK HOLMES! *gooood morning smiles* (bigeyes) http://plurk.com/p/2xu0wf","time":1260491306},{"text":"RT @freemovies: NEW! Free Advance Movie Screening of Sherlock Holmes in Boston, MA: http://bit.ly/858nus","time":1260492903},{"text":"Sherlock Holmes is a sparkling piece of action-packed holiday entertainment with spectacular production design and superb cast. Excellent!","time":1260494770},{"text":"RT:Sherlock Holmes is a sparkling piece of action-packed holiday entertainment with spectacular produ.. http://bit.ly/85prso #holmes","time":1260494914},{"text":"@NikWutzUrStory hey Nik let\u0027s not forget the Charlie Chan, and Sherlock Holmes movies classics","time":1260495570},{"text":"I can\u0027t wait to see Sang Pemimpi, AVATAR, Alvin and The Chipmunks 2 and Sherlock Holmes :D","time":1260499811},{"text":"@dougbenson Pre-release #eightwordsorless movie review of SHERLOCK HOLMES: when it releases so will I.","time":1260501402},{"text":"About to start reading this wonderful online edition of the illustrated Sherlock Holmes: http://bit.ly/6mGZUK","time":1260502758},{"text":"Pengen nonton sherlock holmes... RT @devitahotmauli: RT @blitzmegaplex http://myloc.me/212Nd","time":1260503275},{"text":"RT @janelasky: RT @ReTweet_Central: RT  @janelasky: Jude Law, Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yjvuqs","time":1260493413},{"text":"RT:Cover Story: Sherlock Holmes, super hero http://bit.ly/7iT23N http://bit.ly/8N6uxb #holmes","time":1260494912},{"text":"Joe\u0027s Movie Lounge: Avatar, Sherlock Holmes, Up in the Air: Best movie day ever? http://bit.ly/6IGDNd #STL #MOVIES","time":1260498278},{"text":"#Alert, Alert, @Jeabella tryna figure out BDR my nikka @mrucudead, she think she Sherlock Holmes over here n shit,lol","time":1260501130},{"text":"Have you seen the latest selection of audio books our latest shipment brought in yesterday\u0027s post? Sherlock Holmes\u0027... http://bit.ly/5M0NT0","time":1260502745},{"text":"The more I see the previews, the more I get excited for Sherlock Holmes.","time":1260511376},{"text":"On a mission to get Sherlock Holmes Pre-screening tickets!!!!!!!!!!!!!","time":1260505717},{"text":"The Modern Day Sherlock Holmes. Hide it and ill find it lol","time":1260515600},{"text":"If the Sherlock Holmes movie wasn\u0027t purporting to be about Sherlock Holmes, I\u0027d be excited to see it.","time":1260511614},{"text":"so i kinda wanna see Sherlock Holmes. Rachel McAdams. :D","time":1260504506},{"text":"CHRISTMAS CHRISTMAS TIME IS HERE, TIME FOR SHERLOCK HOLMES FROM BIG FINISH...","time":1260506147},{"text":"RT !! @visionseller   #Sherlock Holmes, 2009#,        , http://blog.naver.com/visual_value/40096046311","time":1260508630},{"text":"The Sherlock Holmes Effect http://bit.ly/4TDG4W","time":1260509128},{"text":"desperately waiting for the Holmes movie - sherlock-holmes-movie.warnerbros.com","time":1260510884},{"text":"The Full Sherlock Holmes Gallery http://bit.ly/5XjOl0","time":1260514511},{"text":"Looks like I\u0027ve woken up in a sherlock holmes novel outside...","time":1260517250},{"text":"@Veronica I guess it\u0027s Hard to see Sherlock Holmes as a fighter but more of a gentleman sleuther. Is \u0027sleuther\u0027 even a word? LOL!!","time":1260504015},{"text":"Iron Man 2 trailer will be shown before Sherlock Holmes! Is that not the best thing EVER?!","time":1260506314},{"text":"IRON MAN 2 trailer will debut in front of Sherlock Holmes. http://viigo.im/1KC4","time":1260506697},{"text":"You look like that guy who\u0027s playing Sherlock Holmes. Robert Downey Jr.? I\u0027ll take it.","time":1260507223},{"text":"Come the fuck on Detective Sherlock Holmes before i stop replyin and say i was sleep.","time":1260507229},{"text":"I presume that it is Mr Sherlock Holmes whom I am addressing and not http://j.mp/SHFilm","time":1260508590},{"text":"So many movies I want to see! Sherlock Holmes, Avatar, The Road... how do I get hooked up with a private theater for a day? Plus Sno-Caps?","time":1260508597},{"text":"Sherlock Holmes was okay. My panties aren\u0027t in a knot. But my panties were BORED.","time":1260508773},{"text":"omigod omigod omigod 15 days until the Sherlock Holmes movie opens omigod omigod....I am squealing with delight!","time":1260508833},{"text":"@katiehebert holy crap. I just saw a sherlock holmes commercial. I almost fainted from my excitement :P","time":1260509089},{"text":"@chriscolfer There\u0027s only two weeks until Sherlock Holmes! You should see that.","time":1260510096},{"text":"Hopefully Sherlock Holmes will help to end my year of watching movies with a good closure! :) and A Xmas Carol plus Alvin and the Chipmunks!","time":1260510729},{"text":"So friends have told me Avatar and Sherlock Holmes are two of the best movies of the year. So excited now!!","time":1260510735},{"text":"@QueenPsycho I would be perfectly content spending xmas watching Alvin 2 \u0026 Sherlock Holmes as well! I may fly out to Cali and join you! :)","time":1260510966},{"text":"Thick, thick fog out there at the moment, like a classsic black and white Sherlock Holmes film.","time":1260511601},{"text":"I presume that it is Mr Sherlock Holmes whom I am addressing and not http://j.mp/SHFilm","time":1260512190},{"text":"37 High Resolution Photos From Guy Ritchies Sherlock Holmes http://moovimix.com/pe","time":1260512598},{"text":"I want to see Sherlock Holmes but I feel like I\u0027ll be thinking of Berkenkotter the whole time I\u0027m watching it...","time":1260512842},{"text":"New Article: Cast and Character Breakdowns of SHERLOCK HOLMES http://tinyurl.com/y8dlrp3","time":1260513544},{"text":"The Hound of the Baskervilles Conan Doyle a great yearn for Christmas by the fireside - my favourite book,film and character Sherlock Holmes","time":1260513853},{"text":"37 High Resolution Photos From Guy Ritchie?s Sherlock Holmes #entertainment http://bit.ly/4Wpm48","time":1260514270},{"text":"37 High Resolution Photos From Guy Ritchie 19s Sherlock Holmes http://twlv.net/nu3hUy #movies","time":1260514442},{"text":"Coming Soon: The Princess and the Frog, Nine, and Sherlock Holmes!! Plus my holiday favorites. Stay tuned : )","time":1260514730},{"text":"so pretty much december 25th will be the best day of cinema i\u0027ve experienced: Sherlock Holmes + Imaginarium of Doctor Parnassus.","time":1260516670},{"text":"RT @SupSappel: RT @weretweet: via @janelasky: Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yjvuqsh #movies #film","time":1260505028},{"text":"RT @ReTweet_Central:  http://p.gs/coj51 RT @janelasky: Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yjvuqsh #mov ...","time":1260505040},{"text":"RT @janelasky: RT @SupSappel: RT @weretweet: via @janelasky: Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yjvuqsh #mo","time":1260505084},{"text":"Ayo kita buat jadwal utk nonton smuanya hehehe RT @anitazoraya: looking forward to see Sherlock Holmes, Avatar, and Alvin","time":1260507180},{"text":"Hans Zimmer has still got it. His score for Sherlock Holmes is one of only two I remember from 2009. The movie\u0027s fun too.","time":1260508193},{"text":"RT @SupSappel: RT @janelasky: RT @SupSappel: RT @TweetAnnounce: via @janelasky: Robert Downey, Jr. in London for Sherlock Holmes http:// ...","time":1260508766},{"text":"i just saw a sherlock holmes trailer ive not seen yet! :D\u003c3 it was all theres one name for christmas blah blah and it had some new bits","time":1260508799},{"text":"RT @weretweet: via @janelasky: Jude Law, Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yjvuqsh #movies #film","time":1260508816},{"text":"RT @janelasky RT @weretweet: via @janelasky: Jude Law, Robert Downey, Jr. in London 4 Sherlock Holmes http://6el.t.0sp.in #movies #film","time":1260508894},{"text":"Really enjoyed HBO\u0027s First Look at SHERLOCK HOLMES -- Guy Ritchie describes the film as an intellectual, humorous, action film. Looks so.","time":1260508899},{"text":"HBO First Look @ SHERLOCK HOLMES - most illuminating, many new clips, be sure to check it out starting this weekend: http://tiny.cc/XdlR3","time":1260509025},{"text":"7-Eleven uses an online game promoting Sherlock Holmes where players search for clues on Facebook http://ow.ly/JEjy @instoremarketer","time":1260510314},{"text":"Cover Story: Sherlock Holmes, super hero: A: The funny thing is, I can do all this stuff and Adler just lays him ou... http://bit.ly/4KJLPa","time":1260511332},{"text":"37 High Rez Images from SHERLOCK HOLMES: When I became a producer, I reread all the stories and realized that ther... http://bit.ly/7JEVck","time":1260512268},{"text":"Sherlock holmes trailer\u0027i gordum, gormeseydim. Bu kadar tekme-tokat-patlama-catlama ne yahu?! Conan doyle epey bi kivraniyordur mezarinda.","time":1260514731},{"text":"Guerrilla The Full Sherlock Holmes Gallery: Warner Bros. Pictures has provided us with the full gallery of photos... http://bit.ly/7lCh4j","time":1260514735},{"text":"37 High Rez Images from SHERLOCK HOLMES: Created in the late 19th century, in a series of stories and novels by.. http://bit.ly/68qgQm","time":1260515276},{"text":"37 High Rez Images from SHERLOCK HOLMES: It\u0027s certainly an adventure, just as the stories seemed to m.. http://bit.ly/8IKI7p","time":1260516769},{"text":"37 High Rez Images from SHERLOCK HOLMES: It\u0027s certainly an adventure, just as the stories seemed to m.. http://bit.ly/7Ghg9f","time":1260516893},{"text":".@heywho Yes, I love Mystery! Agatha Christie, Sherlock Holmes, jigsaw puzzle, UFO, Biblical mysteries, paranormal, haunted houses, etc. :-)","time":1260518083},{"text":"RT @atikasarwono: I WANT TO WATCH SHERLOCK HOLMES!!!!!!!!","time":1260525556},{"text":"wiiieeeeh!!! i already have the Sherlock Holmes complete novels and stories!!!","time":1260521971},{"text":"paranormal activity, sang pemimpi, sherlock holmes, new york i love you !!","time":1260522747},{"text":"@BrownhillsBob Mine is a great fan of Sherlock Holmes, especially The Hound of the Baskervilles...","time":1260523213},{"text":"Desember RT @anpmufc kapan Sherlock Holmes di release????","time":1260524314},{"text":"RT @saraskm: RT @atikasarwono: I WANT TO WATCH SHERLOCK HOLMES!!!!!!!!","time":1260525651},{"text":"RT @rmaisha: RT @saraskm: RT @atikasarwono: I WANT TO WATCH SHERLOCK HOLMES!!!!!!!!","time":1260525693},{"text":"had a fun session: Sherlock Holmes in a pokeball and sexual rape in the smirths","time":1260526063},{"text":"Cast and Character Breakdowns of SHERLOCK HOLMES http://bit.ly/7TfvBX","time":1260527369},{"text":"@Veronica didn\u0027t u like sherlock holmes? i like it very much","time":1260529693},{"text":"@nan_san I\u0027m actually counting down to the opening day of Sherlock Holmes. RDJ, hubba hubba xp~","time":1260520879},{"text":"Interesting sidenotes - the Knight in Young Sherlock Holmes was actually... (YouTube http://bit.ly/813oDQ)","time":1260521098},{"text":"London\u0027s looking like a scene from Sherlock Holmes this morning! Foggy, grey and bloody freezing.... I really hate winter!","time":1260521234},{"text":"Sherlock Holmes. I\u0027m ambivalent. Do you think Mark Strong and Rachel McAdams will make up for the fact Breathy Riley is in it @TheDailyEmma","time":1260523979},{"text":"Flicks: Win Tickets To \u0027Sherlock Holmes\u0027: We\u0027re giving away 20 in-season double passes. http://awe.sm/24YND","time":1260524896},{"text":"Solve the clues in my Sherlock Holmes audio walk and win a camcorder http://bit.ly/7kBVGf #holmes","time":1260525016},{"text":"RT @mattfromlondon Solve the clues in my Sherlock Holmes audio walk and win a camcorder http://bit.ly/7kBVGf","time":1260525127},{"text":"RT @mattfromlondon: Solve the clues in my Sherlock Holmes audio walk and win a camcorder http://bit.ly/7kBVGf #holmes","time":1260526237},{"text":"@OldmonkMGM there are sooo many cool movies awaited!! Sherlock Holmes, The Imaginarium of Doctor Parnassus...","time":1260526909},{"text":"RT:The movie Sherlock Holmes will be released Dec. 25, 2009.. I want to watch it! http://bit.ly/7BZDY9 #holmes","time":1260530980},{"text":"Watching Sherlock Holmes(2009)  http://www.youtube.com/watch?v\u003d57ypsgnWico\u0026feature\u003dplayer_embedded","time":1260531118},{"text":"@Davest010 I agree, the new Sherlock Holmes look pretty ridiculous. But, I am looking forward to Iron Man 2 in 2010! (http://bit.ly/4pgs5I)","time":1260532267},{"text":"@MondoDan @heavenztrash I am seeing Sherlock Holmes next week for that very reason, and that I\u0027m not paying for it helps too","time":1260532499},{"text":"Heath Ledger\u0027s last movie, The Imaginarium of Doctor Parnassus, and Sherlock Holmes are both coming out Dec. 25! Which will make more $?","time":1260519422},{"text":"The Full Sherlock Holmes Gallery: Warner Bros. Pictures has provided us with the full gallery of photos from dire... http://bit.ly/7lCh4j","time":1260519434},{"text":"Sherlock Holmes and the minus-one mystery  by Samiullah Khan: They seemed to have hated Benazir before Zardar.. http://bit.ly/4mUI1X","time":1260519861},{"text":"The fog is really thick tis morning in Edinburgh. It\u0027s inspiring me to finish my research paper today on Conan Doyle (Sherlock Holmes writr)","time":1260519925},{"text":"RT:Heath Ledger\u0027s last movie, The Imaginarium of Doctor Parnassus, and Sherlock Holmes are both com.. http://bit.ly/68EOnO #holmes","time":1260520221},{"text":"Sherlock Holmes and the minus-one mystery  by Samiullah Khan: They seemed to have hated Benazir before Zardari.. http://bit.ly/4mUI1X","time":1260521455},{"text":"RT:@ravis31 I\u0027m not so much interested in Avatar, but cant wait to check out Sherlock Holmes :D http://bit.ly/5Uyfct #holmes","time":1260521864},{"text":"RT @djackmanson Has anyone seen Sherlock Holmes trailers? The poster ads look bloody awful, make the two characters look like silly fops. ..","time":1260521973},{"text":"Having anxiety attacks as I try to go to sleep proves that watching scary clips before bed is a BAD IDEA. Ddmn you Sherlock Holmes game!","time":1260522842},{"text":"Robert Downey Jr. Publicly Reveals His Naughty Desires - The \u0027Sherlock Holmes\u0027 star shares what he wants to do with... http://bit.ly/5lEX2M","time":1260523938},{"text":"Robert Downey Jr. Publicly Reveals His Naughty Desires - The \u0027Sherlock Holmes\u0027 star shares what he wants to do with... http://bit.ly/4niXuY","time":1260523939},{"text":"@sayasaras iye, gw tau desember, tanggal brp? RT @sayasaras: Desember RT @anpmufc kapan Sherlock Holmes di release????","time":1260524439},{"text":"Flicks: Win Tickets To \u0027Sherlock Holmes\u0027: We\u0027re giving away 20 in-season double passes. http://awe.sm/24YMY #free","time":1260524897},{"text":"RT @mattfromlondon: Solve the clues in my Sherlock Holmes audio walk and win a camcorder http://bit.ly/7kBVGf #holmes great work matt","time":1260527033},{"text":"Robert Downey Jr/Jude Law feel a bit wrong for a Guy Ritchie Sherlock Holmes movie. The Stath/Holmes and Danny Dyer/Watson seem more apt!","time":1260528537},{"text":"@emohoho Wild Things and Orson Welles. Pretty good set of films for the end of the year I reckon. Will probably see Sherlock Holmes too.","time":1260529612},{"text":"Guy in front of me is watching #RocknRolla Did I ever mention that I love this movie?Can\u0027t wait to see #Ritchie\u0027s version of Sherlock Holmes","time":1260529655},{"text":"RT @SupSappel: RT @TweetAnnounce: via @janelasky: Jude Law, Robert Downey, Jr. in London for Sherlock Holmes http://tinyurl.com/yzxa ...","time":1260530025},{"text":"i found Sherlock Holmes AD at subway! it\u0027s awesome!! the Movie comes out on X-mas Eve, 2009. http://twitpic.com/t1mkf","time":1260531167},{"text":"Sherlock Holmes: bumper image gallery http://bit.ly/5G2znj","time":1260534793},{"text":"a.penelope b.sang pemimpi c.sherlock holmes d.alvin and the chipmunks2 ... tampak bingung?","time":1260533654},{"text":"Liked Am I the only one uncommonly excited for the Sherlock Holmes movie? It looks like so much fun! But, is... http://ff.im/-cJwo6","time":1260533833},{"text":"My name is Sherlock Holmes. It is my business to know what other people don\u0027t know. (The Adventure of the Blue Carbuncle)","time":1260534147},{"text":"Film Friday: Comparing Ritchie\u0027s Sherlock Holmes to Conan Doyle\u0027s Stories http://bit.ly/8YzvuE","time":1260534152},{"text":"Working out then Sherlock Holmes and phone conference then movies all night @BFCA voting deadine looming...","time":1260534383},{"text":"Hey #collegehumor Are you guys going to WATCH SHERLOCK HOLMES? (CH live  http://ustre.am/2J18)","time":1260535132},{"text":"RT Close To Holmes examines the London locations featured in the Sherlock Holmes stories http://tinyurl.com/m68mhk","time":1260536809},{"text":"The fog is rolling in \u0026 visibility is 50ft round my office block. Am expecting to see Sherlock holmes come round the corner.","time":1260540230},{"text":"Not particularly enthralled with the idea of avatar. My winter blockbuster hopes are holed up with Sherlock holmes.","time":1260540306},{"text":"RT @mattfromlondon: Solve the clues in my Sherlock Holmes audio walk and win a camcorder http://bit.ly/7kBVGf #holmes","time":1260542813},{"text":"RT @MarcieVargas I cannot wait for the new Sherlock Holmes movie!!!! //Me too, \u003c3 Robert Downey Jr. Looks fun from trailers.","time":1260543144},{"text":"RT:@rrafaa To meio na espectativa p Sherlock Holmes linda! http://bit.ly/7f1EOV #holmes","time":1260543349},{"text":"RT @barbaran61: Sherlock Holmes waved our strange visitor into a chair @visitbritain http://j.mp/SHFilm","time":1260546005},{"text":"RT @empiretheatres: Sherlock Holmes opens Christmas Day! Read all about it, then enter to #win some really sweet prizes http://bit.ly/7NEIPc","time":1260533875},{"text":"Must see movie list: Nine, Up In The Air, Single Man,An Education, Sherlock Holmes, Invictus and The Lovely Bones. I better start watching.","time":1260534128},{"text":"RT:As a longtime Holmesian-from @PasteMagazine Film Friday: Comparing Ritchie\u0027s Sherlock Holmes to Cona.. http://bit.ly/5KrvF3 #holmes","time":1260534464},{"text":"very,very interesting piece RT@PasteMagazine: Film Friday: Comparing Ritchie\u0027s Sherlock Holmes to Conan Doyle\u0027s Stories http://bit.ly/8YzvuE","time":1260538374},{"text":"@lahondaknitter I\u0027ve read every Sherlock Holmes story, big fan from way back, and I\u0027ll watch anything with Robert Downey Jr. Win/win!","time":1260543520},{"text":"@john_jordan NO! To Brooklyn. Hell no I\u0027m not going to the movies. Well, \u0027cept for Sherlock Holmes and Men Who Stare at Goats #hatesmovies","time":1260543581},{"text":"Anyone wanna see Sherlock Holmes? I think I do","time":1260550059},{"text":"is looking forward to the movies coming out around Christmas...Avatar and Sherlock Holmes.","time":1260558550},{"text":"Cohen to make Sherlock Holmes film. http://tr.im/Hm6i","time":1260561013},{"text":"Not able to log-in to @movies_ie to enter the Sherlock Holmes comp. I\u0027m relying on @sharononeil now :/","time":1260548719},{"text":"I still think the Sherlock Holmes trailer is trying to trick us into thinking it\u0027s an action blockbuster.","time":1260551378},{"text":"@guavalicious I\u0027m looking forward to Sherlock Holmes too and still want to see 2012 (must get my butt in gear!)","time":1260551860},{"text":"Awww my kitty looks so saaad. It\u0027s okay. Sherlock Holmes will be fine sweetums. http://yfrog.com/4a8u4ej","time":1260552036},{"text":"I\u0027m seeing billboards for Sherlock Holmes. This makes me sad. Movies advertised on billboards are not usually favorably reviewed movies.","time":1260554000},{"text":"@LMarle @katiebeth Side note re sleuthing: If you see the new Sherlock Holmes movie, I want your chick reviews :)!","time":1260554480},{"text":"@Pat_Healy I ate a Sherlock Holmes taquito in slow motion while deliberating precisely where to take a shit when I sped up.","time":1260559700},{"text":"There are so many good looking films coming out this holiday season. My must sees include Invictus, Avatar, and Sherlock Holmes.","time":1260551548},{"text":"Love that Adam Sandler video for Hanukkah. Now just waiting for 3 good movies to come out. 1. Avatar 2. Sherlock Holmes 3. can u guess","time":1260554414},{"text":"Raising a pint 4 London here at Sherlock Holmes Pub then off to see the movie w/Robert Downy Jr and Jude Law, who shall I hug first? ha! RG","time":1260551995},{"text":"Cant wait to see Sherlock Holmes.....","time":1260567396},{"text":"RT:Sherlock Holmes is the man. http://bit.ly/4Fn6yH #holmes","time":1260562098},{"text":"@cisforchesney we need to make a holiday movie date. Sherlock Holmes maybe?","time":1260566250},{"text":"@john_hunter did you ever see the Sherlock Holmes The Awakened game? that was Sherlock Holmes meets HP Lovecraft too, was very interesting.","time":1260566944},{"text":"RT @chireaderpromo: Win admit two passes to an advance screening of Sherlock Holmes. http://bit.ly/6AGx9T","time":1260563726},{"text":"RT:@JohnnyFocal you are the first person on the entire planet to rate Sherlock Holmes the movie. Bravo! http://bit.ly/4Onksc #holmes","time":1260564618},{"text":"@chetwill I am looking forward to seeing both movies especially Sherlock Holmes. Love Robert Downey Jr.","time":1260564912},{"text":"I\u0027m extremely confused, is there TWO Sherlock Holmes coming out?? The one with Gareth David-Lloyd \u0026 one with Jude Law??","time":1260566993},{"text":"RT @scottEweinberg So I made fun of SHERLOCK HOLMES here and there. Happy to say I was mostly wrong. Surprisingly fun flick.","time":1260567292},{"text":"Just saw the preview of Sherlock Holmes.... thinking to go watch it when it comes out in theater at midnight(:","time":1260573066},{"text":"1.) Ride school bus. 2.) Get picked up by my mom. 3.) Eat in the car. 4.) Head to Warner Bros and see Sherlock Holmes for the 2nd time!","time":1260573983},{"text":"Ailing World Famous Detective recovers and writes about agriculure look for Better Sherlock Holmes and Gardens to be released soon","time":1260575688},{"text":"RT:... Harry Potter and the Half Blood Prince, Sherlock Holmes, Star Trek, Terminator Salvation ... http://bit.ly/4xU7c5 #holmes","time":1260562100},{"text":"RT:And some Sherlock Holmes trailer music too, by one of my favorite groups in the world, E.S. Posthumo.. http://bit.ly/8aBiIM #holmes","time":1260564610},{"text":"RT @janelasky: http://bit.ly/4GWQqV - Jude Law, Robert Downey, Jr. in London for Sherlock Holmes #holmes #UK (See part 1 \u0026 2 of post, too)","time":1260565949},{"text":"RT @43KixNorCal: Fabulously goofy photos of SHERLOCK HOLMES\u0027 Robert Downey Jr. from his Hand \u0026 Footprint Ceremony on Mon: http://bit.ly/ ...","time":1260567672},{"text":"1885 - It\u0027s nice to see my name with Sherlock Holmes, my hero. It\u0027s said A. Conan Doyle named Holmes after his hero, Oliver Wendell Holmes.","time":1260568268},{"text":"I will never stop being disappointed by the Sherlock Holmes story where he gets a chance to fight the Ku Klux Klan and misses it. :(","time":1260568341},{"text":"Penelope Cruz talks about her role in NINE and Robert Downey Jr. debuts SHERLOCK HOLMES. Check out ET at 7:30 on WKYC. See ya there!","time":1260568924},{"text":"RT:Saw the final major movie of the season, SHERLOCK HOLMES. It\u0027s not Ritchie rock \u0027n roll, which works.. http://bit.ly/7Fnwhe #holmes","time":1260570713},{"text":"I totally wanna see sherlock holmes","time":1260588894},{"text":"I think the new Sherlock Holmes movie is Razzie-bait.","time":1260581119},{"text":"RT @rcjohnso: Sherlock Holmes really suprised me. Tons of fun.","time":1260590129},{"text":"@rcjohnso Sherlock Holmes really?! I know RD is great, but is the story really there?","time":1260590268},{"text":"Imagens de Sherlock Holmes. http://www.omelete.com.br/cine/100023983/Veja_mais_duas_dezenas_de_imagens_de_Sherlock_Holmes.aspx","time":1260579491},{"text":"Can\u0027t wait to see it! RT @EricVespe: Really dug Sherlock Holmes. Downey and Law are great together.","time":1260577495},{"text":"Waiting to hear reviews of Sherlock Holmes movie from Londoners. Watch a trailer here ~ http://is.gd/5kjFB","time":1260579478},{"text":"Just finished The Improbable Adventures of Sherlock Holmes: 500 p. of Holmes goodness, + short stories by Laurie R. King and Neil Gaiman!","time":1260579678},{"text":"Date nite with my girl. We\u0027re @ screening of Nine. Hope it\u0027s better than Sherlock Holmes!","time":1260581281},{"text":"RT:I think the new Sherlock Holmes movie is Razzie-bait. http://bit.ly/7fb7qn #holmes","time":1260581455},{"text":"@officialdhough http://twitpic.com/t3us1 - omg thats soo awesome! OMG SHERLOCK HOLMES!!!!!! xD","time":1260584875},{"text":"RT:Jude Law and Robert Downey Jr in Sherlock Holmes, be still my heart, oh my! http://bit.ly/5bajoQ #holmes","time":1260584889},{"text":"@EmilyTheGiraffe Sherlock Holmes is only PG13 so that doesn\u0027t matter. Generally I feel hopeless about the future of everything.","time":1260584908},{"text":"Watching the trailer I thought Guy had lost it but then RT @rcjohnso Sherlock Holmes really suprised me. Tons of fun.","time":1260590322},{"text":"RT @Watson_MD: RT:[FRiEND] Sherlock Holmes ...: The film #film #photo: http://bit.ly/7cevYn http://bit.ly/6ecWmR #holmes","time":1260581588},{"text":"RT:Date nite with my girl. We\u0027re @ screening of Nine. Hope it\u0027s better than Sherlock Holmes! http://bit.ly/5GYgjp #holmes","time":1260582909},{"text":"vou dormir..... amanh to pensado em ir no shopping cidade... assistir algum filme... Recomendo 2012. E aguardo Sherlock Holmes e Avatar.","time":1260582998},{"text":"@x3Natalie but you\u0027ll be able to see all the rated r movies we\u0027ve wanted to see, such as sherlock holmes! So smile, for you\u0027ll see RDJ! :D","time":1260584769},{"text":"RT:is chillin. That Sherlock Holmes movie looks pretty dang cool. gonna go see it when it comes out. http://bit.ly/4THpKs #holmes","time":1260588289},{"text":"RT:December movies I want to see - Up in the Air, Sherlock Holmes, Invictus, and because I love my daug.. http://bit.ly/63YeNT #holmes","time":1260588292},{"text":"RT:Sherlock Holmes Hi-Res Photo Gallery http://post.ly/Eq6S http://bit.ly/4srxpf #holmes","time":1260588295},{"text":"RT:add Where The Wild Things Are to your list! RT @putrikarinta: Movies to see: NINE, Sherlock Holmes, .. http://bit.ly/8STTwK #holmes","time":1260588298},{"text":"RT:Wonders how he can get Tammy to let him and Bubba go watch the new Sherlock Holmes movie on Christma.. http://bit.ly/82S2uq #holmes","time":1260584892},{"text":"The director of the awesome \u0027Brick\u0027 likes \u0027Sherlock Holmes\u0027! RT @rcjohnso Sherlock Holmes really suprised me. Tons of fun.","time":1260590783},{"text":"The Adventure of Sherlock Holmes Smarter Brother http://awesomestart.com/public/sherlock-holmes-smarter-brother","time":1260594012},{"text":"Sherlock Holmes And Dr. Watson Are Gay? http://nxy.in/840hq","time":1260599250},{"text":"RT:Sherlock Holmes really suprised me. Tons of fun. /via @rcjohnso Well, as a Sherlock Holmes-fan, I am.. http://bit.ly/50NBSh #holmes","time":1260602815},{"text":"Sherlock Holmes and Watson are out camp...- Sherlock Holmes and Watson are out camping - don\u0027t ask me why, probably... http://bit.ly/d5hou","time":1260598245},{"text":"Sherlock Holmes was just as fantastic the second time around! I\u0027m seeing it for a third time with my brother...any other takers?","time":1260592043},{"text":"Why should you watch Sherlock Holmes this holiday season? Iron Man 2 trailer debuting in the front #IronMan2","time":1260596084},{"text":"Was watching the Sherlock Holmes trailer..finally a Guy Ritchie movie without Jason Statham!!...#sherlockholmes, #guyritchie...","time":1260597309},{"text":"Excitement level+Sherlock Holmes movie\u003d7/10 Excitement level+Triumphant return of the phrase No sh!t Sherlock 10/10","time":1260597873},{"text":"via @janelasky: http://bit.ly/4GWQqV - Jude Law, Robert Downey, Jr. in London for Sherlock Holmes #holmes #UK","time":1260599524},{"text":"Harry Potter and the Half-Blood Prince Sherlock Holmes Star Trek Terminator Salvation","time":1260602928},{"text":"now that you have told me something i would never need i would have to struggle to forget it - Sherlock Holmes","time":1260603131},{"text":"RT:Note to self: Sherlock Holmes is out Dec 25. http://bit.ly/5Ln3Rt #holmes","time":1260604611},{"text":"RT:advance screening tickets to see sherlock holmes! ask me how! :] http://bit.ly/54vzYm #holmes","time":1260604613},{"text":"RT:Baca Novel Sherlock Holmes, mudahan 21 bjm cepat muterin filmnya http://bit.ly/4IFUxU #holmes","time":1260604616},{"text":"Blog: The Boy Sherlock Holmes: Eye of the Crow, by Shane Peacock - Ms ...: Despite appearances, Ive actually had ... http://bit.ly/6K21CK","time":1260590582},{"text":"The Imaginarium of Doctor Parnassus, Sherlock Holmes \u0026 Shuutter Island: kapan sih film2 ini bakal maen? Can\u0027t hardly wait to watch \u0027em!!!","time":1260594119},{"text":"RT:PBS presents British TV with Mr. Bean, Monty Python, Are you being served? and Sherlock Holmes(Jerem.. http://bit.ly/89MOTJ #holmes","time":1260594136},{"text":"Sherlock Holmes And Dr. Watson Are Gay? -- The usurpation of traditional higher education by the left has reached its ... http://j.mp/6HO6CE","time":1260594374},{"text":"RT:cant wait for sherlock holmes. is it me, or does jude law look and sound like ewan mcgreggor in the .. http://bit.ly/5zwuUA #holmes","time":1260599526},{"text":"@girlinamural that\u0027s a cold,cold place you live in. It\u0027s very foggy here this morning. Looks like a sherlock holmes film. hope you\u0027re warm!","time":1260601208},{"text":"RT:via @janelasky: http://bit.ly/4GWQqV Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes.. http://bit.ly/88usyI #holmes","time":1260602813},{"text":"RT:http://www.sssmovies.com/vb/pc-games/4859-ug-sherlock-holmes-jack-ripper-2009-pc.html http://bit.ly/5i3Ont #holmes","time":1260602816},{"text":"RT:@stephstricklen hey, speaking of Watson: Jude Law NAILS Watson in the new Sherlock Holmes. Almost st.. http://bit.ly/7DxoFa #holmes","time":1260602817},{"text":"RT:The Adventures of Sherlock Holmes: Episode One - by Sir Arthur Conan Doyle. http://bit.ly/7GydIc http://bit.ly/6zVo1G #holmes","time":1260604614},{"text":"RT:Don\u0027t know much about SHERLOCK HOLMES or how Watson\u0027s portrayed, but are there any movies where Wats.. http://bit.ly/5K9WDA #holmes","time":1260594133},{"text":"RT:Saw SHERLOCK HOLMES tonight on the Warners lot. Great script by Simon Kinberg and Guy Ritchie\u0027s dire.. http://bit.ly/4pSjcz #holmes","time":1260597432},{"text":"@Midgley looks impressive and so does Sherlock Holmes :0)","time":1260610193},{"text":"@tridestra : nntn sherlock holmes yukkk!!! hwahahahahaha... ato niko and the way to the stars","time":1260611963},{"text":"Re-imagining \u0027Sherlock Holmes\u0027 for the big screen http://bit.ly/86pRoY","time":1260615441},{"text":"RT @visitlondonweb: New blog post: Sherlock Holmes Comes to Madame Tussauds http://blog.visitlondon.com/2009/12/sherlock-holmes-comes-to ...","time":1260613527},{"text":"Weekend of film watching ahead of me: Sherlock Holmes this afternoon, Princess and the Frog tomorrow and some DVDs inbetween.","time":1260606860},{"text":"That\u0027s part of my day sorted, all 14 of the Basil Rathbone, Sherlock Holmes films to watch. http://twitpic.com/t6i45","time":1260608487},{"text":"Robert Downey Jr. Discusses Sherlock Holmes and Iron Man 2 - ReelzChannel.com http://twa.lk/0XWc9","time":1260611685},{"text":"Watching Granada TV\u0027s Sherlock Holmes--period sets and props reinforce my gratitude for this era.","time":1260613151},{"text":"RT:A \u0027Down and Dirty\u0027 \u0027Sherlock Holmes\u0027, http://www.myfeedme.com/article/5748460.html http://bit.ly/5gqtxS #holmes","time":1260613411},{"text":"RT:@tridestra : nntn sherlock holmes yukkk!!! hwahahahahaha... ato niko and the way to the stars http://bit.ly/8rAb86 #holmes","time":1260613428},{"text":"Need something to wear to see Sherlock Holmes? This is perfect: http://twurl.nl/6k1xpa","time":1260613977},{"text":"Off to see Guy Ritchie\u0027s Sherlock Holmes in a bit. \u0027Elementary my dear Watson, YOU MUPPET!\u0027 etc etc.","time":1260613994},{"text":"Sherlock Holmes is in the cinema, Boxing day. He\u0027ll be the one with the deer-stalker hat and pipe, then. No sh*t!","time":1260617867},{"text":"Sherlock Holmes was highly entertaining. Can\u0027t wait for Robert Downey Jr to square off against Moriarty in the sequel. Gonna be sick.","time":1260605032},{"text":"RT @weretweet: via @janelasky: http://bit.ly/4GWQqV Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260605129},{"text":"RT @janelasky: RT @weretweet: via @janelasky: http://bit.ly/4GWQqV Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #fil","time":1260605163},{"text":"RT @janelasky: RT @ReTweet_Central: RT @janelasky: http://bit.ly/4GWQqV Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK","time":1260605164},{"text":"RT @janelasky: RT @weretweet: via @janelasky: http://bit.ly/4GWQqV Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #fil","time":1260607006},{"text":"VisitBritain + WarnerBros have created a v.cool website with Sherlock Holmes film locations, the works - enjoy! http://tinyurl.com/y9ybqyh","time":1260613559},{"text":"Avatar, New moon, Princess and the Frog, Astroboy, Alvin \u0026 Chipmunks 2, Coraline, Sherlock Holmes T_T I want to watch em all T_T","time":1260617779},{"text":"Breaking Now: Robert Downey Jr. Discusses Sherlock Holmes and Iron Man 2: ReelzChannel.com Brad Pitt\u0027s Sherlock Hol... http://bit.ly/8JrZJL","time":1260612198},{"text":"RT:Reading: New blog post: Sherlock Holmes Comes to Madame Tussauds http://bit.ly/8XAull http://tinyurl.. http://bit.ly/6oXRJX #holmes","time":1260613462},{"text":"The complete Sherlock Holmes collection!!! Cannot contain my excitement!","time":1260629846},{"text":"Sherlock holmes?! Already!!!!!! Can\u0027t wait!!!!!!! http://tweetphoto.com/6287863","time":1260624487},{"text":"#myplanfornewyear going to see Sherlock Holmes with my dad. I love Robert Downey Jr. \u003c3","time":1260624562},{"text":"Christmas Day is a good day for movies this year. Up in the Air and Sherlock Holmes double feature, anyone?","time":1260631671},{"text":"RT @msmentari: aaa I LOVE SHERLOCK HOLMES!!! cant wait for his movie on december 24th!!","time":1260620947},{"text":"Sherlock Holmes And Dr. Watson Are Gay? http://tinyurl.com/yexwact #tcot","time":1260622637},{"text":"RT @mikepfs: Sherlock Holmes And Dr. Watson Are Gay? http://tinyurl.com/yexwact #tcot","time":1260622841},{"text":"#movie Which movies do u wanna watch? I\u0027m expecting Avatar(D-4), Sherlock Holmes(D-11), and Nine(D-18).","time":1260623220},{"text":"@seanchoe you deffo have to tell us if it\u0027s worth it! I can\u0027t wait for Sherlock Holmes!!","time":1260624859},{"text":"@SwatchUS gonna try to catch The Lovely Bones. can\u0027t wait til Christmas for Sherlock Holmes!","time":1260626788},{"text":"@wishing_willow I am planning a double bill with a friend for Christmas Day - The Princess and the Frog and Sherlock Holmes. :D","time":1260627929},{"text":"RT:The complete Sherlock Holmes collection!!! Cannot contain my excitement! http://bit.ly/4CDo9A #holmes","time":1260629980},{"text":"Unseen by me and not on my #CCMA ballot: Sherlock Holmes, Crazy Heart, Avatar, Me and Orson Wells","time":1260630008},{"text":"@LisaRosen I saw the trailer for Sherlock Holmes the other night and told Dude we had to see it.","time":1260631670},{"text":"RT:thanks to @IamPhoebe I can go to the premier of sherlock holmes on thursday !... thanking you little.. http://bit.ly/6AyUje #holmes","time":1260631771},{"text":"RT:I normally love Sherlock Holmes...but this new film looks terrible. http://bit.ly/5uNKQi #holmes","time":1260631772},{"text":"Shopper Post: Sherlock Holmes Comes to Madame Tussauds http://rrid6.th8.us","time":1260631828},{"text":"Which Movie are you most anticipating to see this holiday season? #Avatar or #Sherlock Holmes? I think #Holmes for me.","time":1260631831},{"text":"@LisaRosen I have sensory issues if, say, Sherlock Holmes were supposed to be in 1960s Denmark \u0026 still had Victorian ostentation everywhere.","time":1260632430},{"text":"Omfg it\u0027s 14 days till Sherlock Holmes and like 6 till St Trinian\u0027s 2. Apologies in advance to anyone in the same cinema as me XD","time":1260619483},{"text":"Cant believe four movies come out Christmas Day. Want to see Nine and Sherlock Holmes but I wont see either on Xmas. Maybe a few days later","time":1260624439},{"text":"RT:#myplanfornewyear going to see Sherlock Holmes with my dad. I love Robert Downey Jr. \u003c3 http://bit.ly/5Q1M9Q #holmes","time":1260624654},{"text":"RT:Wahhh E! announcing Hot Holidays Movies. Nine,Sherlock Holmes n Avatar are my Best Picks ! http://bit.ly/90ozdD #holmes","time":1260626475},{"text":"@GHmltn Class,I haven\u0027t seen really dense fog since I was small,so you\u0027re having your own private Sherlock Holmes adventure","time":1260626717},{"text":"RT:Pero como me mola la BSO de Sherlock Holmes http://bit.ly/4B6Zv1 http://bit.ly/4NqnvQ #holmes","time":1260629974},{"text":"RT:@LisaRosen I saw the trailer for Sherlock Holmes the other night and told Dude we had to see it. http://bit.ly/5Patmm #holmes","time":1260631765},{"text":"@ThatKevinSmith 1/2 Are you as stoked for Sherlock Holmes as I am? How can RDJr go from junkie fired from Ally McBeal cause he can\u0027t stay...","time":1260633385},{"text":"Robert Downey Jr. ruined Sherlock Holmes for me, I hate his hair so much it\u0027s not even funny, Why the hell does he always have it like that?","time":1260620718},{"text":"RT @tai_ramos: Robert Downey Jr., favor, pegar-eu. Obrigada. RT @cineseries Confira MUITAS imagens de Sherlock Holmes http://uiop.me/BAU","time":1260624880},{"text":"I want to see Sherlock Holmes","time":1260645071},{"text":"Sherlock Holmes, on the other hand, looks to be spectacular.","time":1260645408},{"text":"Pgn bget....sherlock holmes...next target..","time":1260645612},{"text":"@prkchoppdnscrwd i pre-ordered mine. but ima go 2 the stores on my sherlock holmes shit","time":1260641106},{"text":"Dressed up as Sherlock Holmes. it\u0027s awesome, all I need is a Watson now...","time":1260641443},{"text":"Don\u0027t feel any better today at all. Bleh. Gonna stay in bed and watch Young Sherlock Holmes!","time":1260636139},{"text":"I just drove by what looks to be either Santa Claus or Sherlock Holmes. You decide... http://twitpic.com/t80ve","time":1260638094},{"text":"I\u0027m goin to see it day 1 RT @Chayse_G: @C_Wise tell me u saw the preview for Sherlock Holmes","time":1260638187},{"text":"Missed screenings of Sherlock Holmes and It\u0027s Complicated the past couple of nights. Annoyed. Avatar next week, please!!","time":1260640804},{"text":"via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260641410},{"text":"RT @TweetAnnounce: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260641522},{"text":"And out of them. RT @hillarygayle: I will see this Sherlock Holmes movie if only for the eye candy of dudes in vintage suits.","time":1260642640},{"text":"Sherlock Holmes in cinemas - Boxing Day - http://wwws.warnerbros.co.uk/sherlockholmes/site/index.html","time":1260643079},{"text":"RT:I really wanna see Sherlock Holmes. Absolutely love Jude Law. http://bit.ly/4q15z0 #holmes","time":1260644416},{"text":"RT:RDJ Discusses Sherlock Holmes - Comic Book Movie http://bit.ly/7Xc4no #holmes","time":1260644420},{"text":"@OreLawPracMgmt I am on the fence about Sherlock Holmes. I like RD, Jr., but I think SH could be really good or really sucky.","time":1260645402},{"text":"I\u0027m liking the reviews of avatar so far at rottentomatoes http://bit.ly/2pdZ0X I hope sherlock holmes is good","time":1260645960},{"text":"Only 17 hours left to bid on SHERLOCK HOLMES: THE PAINFUL PREDICAMENT OF ALICE FAULKNER: http://lnk.ms/4rYCT","time":1260645997},{"text":"Fuck, i steel cant find mah fuckin headphones smh, I\u0027m finna get mah sherlock holmes on afta i get out tha shower","time":1260640948},{"text":"@ohvienna Well, there\u0027s the Sherlock Holmes movie. Which looks like it will be fun fanfiction, at least; I mean obv it\u0027s not Really Holmes.","time":1260641443},{"text":"#Sherlock Holmes + me....Watson too ;-) http://tweetphoto.com/6313938","time":1260653189},{"text":"@melissasousaa i did it to sherlock holmes, \u0026 i got my ass a hug :-*","time":1260653977},{"text":"Sherlock Holmes film locations http://bit.ly/64sW71","time":1260648118},{"text":"I LURRRRRRRVE Rober Downey Jr! I cannot wait for Christmas day and Sherlock Holmes!!! RAWR!","time":1260655204},{"text":"New Sherlock Holmes game! Will you play as Holmes or Watson? www.221b.sh","time":1260648129},{"text":"@BrianDau I totally agree with you. Avatar: MEH. Sherlock Holmes: Thank you sir, may I have another?","time":1260648185},{"text":"Sherlock Holmes! Robert Downey Jr. and Jude Law in a film together! What a TREAT! Only one missing is Hugh Jackman! Hehe.","time":1260648953},{"text":"Perfect Londonian (is that a word) weather. Rainy, cold and humid. Kinda appropriate after seeing Sherlock Holmes yesterday night.","time":1260651481},{"text":"Going to see Sherlock Holmes on boxing day, or maybe just after. Should be good, got my snacks ready.","time":1260652290},{"text":"RT @gallerynucleus: Tonight is opening night of Power in Numbers 4 AND John Watkiss\u0027 The Art of the Motion Picture: Sherlock Holmes... ...","time":1260652455},{"text":"Finally the TV spots for the newest Sherlock Holmes movie starring http://bit.ly/ijjHI Robert Downey and Jude Law.","time":1260653123},{"text":"RT:You know what movie I want to see? the new Sherlock Holmes. http://bit.ly/8F1gbf #holmes","time":1260655198},{"text":"RT:I\u0027m like Sherlock Holmes http://bit.ly/8PC72z #holmes","time":1260655200},{"text":"Hi all! Sherlock Holmes Versus Jack the Ripper just got published: http://trim.su/2SQH (by lucas-ruroken)","time":1260656733},{"text":"RT:II wanna see Sherlock Holmes! http://bit.ly/4J7To4 #holmes","time":1260657605},{"text":"filmsfilmsfilms: it\u0027s complicated, an education, bright star, sherlock holmes, new york i love you.. what else?","time":1260658728},{"text":"Ok...I\u0027m confused...how did the bitchy blonde girl from Mean Girls get the lead female role in Sherlock Holmes?","time":1260658826},{"text":"RT:Posters das personagens de Sherlock Holmes http://bit.ly/6g9gUU http://bit.ly/68Bjst #holmes","time":1260649969},{"text":"@CBowdon if you can wait until post Christmas then I\u0027ll have some free time. Not too fussed about it tbf. Sherlock Holmes soon though ^_^","time":1260650306},{"text":"The new Sherlock Holmes movie has my swordmaster all aflutter, \u0026 he now wants to incorporate some bartitsu-style fighting into my training.","time":1260650327},{"text":"RT @SteveHaweeli: Whose idea was it to turn Sherlock Holmes into some haphazard amalgam of Jason Bourne \u0026 James Bond? (via @NerdwithSwag)","time":1260651585},{"text":"I refuse to entertain you woman any longer...(no homo) but damn yall like sherlock holmes on the prowl wit ish..married/single all","time":1260655037},{"text":"RT:@Veronica i have been waiting for the new Sherlock Holmes movie ever since i started reading about i.. http://bit.ly/7Tybsn #holmes","time":1260657613},{"text":"i want to watch Sherlock Holmes x)","time":1260672879},{"text":"Robert Downey Jr. Playing Sherlock Holmes? #GTFOH!","time":1260674348},{"text":"8. The movies I want to see this year are: Law Abiding Citizen, Sherlock Holmes, Avatar, Nowhere Boy and Carriers.","time":1260665787},{"text":"RT:Why is Kelly Reilly playing second fiddle in Sherlock Holmes http://ow.ly/1691OZ http://bit.ly/6POzmW #holmes","time":1260675124},{"text":"RT @BillCorbett: We all know Sherlock Holmes was a ripped, streetfighting kickass-machine. But this new movie also makes him some sort o ...","time":1260675667},{"text":"Surprised how much I\u0027m enjoying reading books on my phone. Going to attempt Sherlock holmes 4 the 1st time (mostly b/c it was free).","time":1260676498},{"text":"RT @Watson_MD: RT:via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film http://bit.ly/75AWMA #holmes","time":1260672917},{"text":"I wanna watch sherlock holmes :l","time":1260680121},{"text":"i want to see Sherlock Holmes so bad! Jude Law is amazing!","time":1260678498},{"text":":  Sherlock Holmes and the Voice of Terror (1942)    http://tr.im/HsXR","time":1260678609},{"text":"RT:Excites to see Sherlock Holmes. http://bit.ly/7RSgbv #holmes","time":1260685997},{"text":"@henriachterkamp de sherlock holmes in aktie vandaag http://moby.to/xy2ovu","time":1260687599},{"text":"i want to see Sherlock Holmes so bad! Jude Law is amazing!","time":1260687796},{"text":"I was kinda so-so on Sherlock Holmes, but with the news of this Inception teaser, I will be the first one in the theater.","time":1260690056},{"text":"oh look! sherlock holmes is here to figure out the case of the gay sweater!","time":1260690302},{"text":"december movie plan..sherlock holmes and sang pemimpi http://myloc.me/2402w","time":1260690857},{"text":"RMO Update: ET Sherlock Holmes Interview http://is.gd/5lDjf","time":1260690922},{"text":"RT:@tessreid SHERLOCK HOLMES FOR SURE BRAH http://bit.ly/5SqOPp #holmes","time":1260678414},{"text":"i wish there was a theatre near me that was open in the winter (all we have is a drive in in the summer) i wanna see sherlock holmes","time":1260680254},{"text":"RT:I was kinda so-so on Sherlock Holmes, but with the news of this Inception teaser, I will be the firs.. http://bit.ly/4ODfpc #holmes","time":1260680694},{"text":"At Fantacity waiting for our room. There are two odd Sherlock Holmes lookin men writing notes and taking pics. Inspection?","time":1260682358},{"text":"RT @TweetAnnounce: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260683682},{"text":"RT @weretweet: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260683688},{"text":"RT @janelasky: RT @TweetAnnounce: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260683824},{"text":"RT:Avatar friday and Sherlock holmes next. Going to be rather expensive http://bit.ly/7C8Ti0 #holmes","time":1260683967},{"text":"RT:SHERLOCK HOLMES WANT. @missrenne you are killing me. http://bit.ly/5BmNmH #holmes","time":1260683969},{"text":"RT:Sherlock Holmes . why E ess YES YES YES \u003d ) http://bit.ly/4LbLbV #holmes","time":1260691029},{"text":"RT:Today\u0027s Fact: Sherlock Holmes never said Elementary, my dear Watson. http://bit.ly/797pyz #holmes","time":1260691030},{"text":"RT:RMO Update: ET Sherlock Holmes Interview http://is.gd/5lDjf http://bit.ly/5Kkz5K #holmes","time":1260691032},{"text":"RT:I was kinda so-so on Sherlock Holmes, but with the news of this Inception teaser, I will be the firs.. http://bit.ly/4ODfpc #holmes","time":1260691155},{"text":"#ihateguysthat have their guards up so high, it\u0027s hard to get to know them. i dont wanna solve no damn mystery sherlock holmes.","time":1260678550},{"text":"RT @BillCorbett: We all know Sherlock Holmes was a ripped, streetfighting kickass-machine. But this new movie also makes him some sort o ...","time":1260679215},{"text":"RT @janelasky: RT @SupSappel: RT @TweetAnnounce: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260679728},{"text":"RT:Repost of an older article: The Faith of Sherlock Holmes http://armandoheredia.com/archives/351 http://bit.ly/4NcZ9n #holmes","time":1260683971},{"text":"Surprised how much I\u0027m enjoying reading books on my phone. Going to attempt Sherlock holmes 4 the 1st time (mostly b/c it was free).","time":1260684690},{"text":"RT @MyFonts: The branding for the new Sherlock Holmes movie makes prominent use of movable letterpress type http://myfonts.us/holmestype","time":1260685721},{"text":"RT:The branding for the new Sherlock Holmes movie makes prominent use of movable letterpress type http:.. http://bit.ly/6XKq0j #holmes","time":1260685996},{"text":"@TheOnion RT @BillCorbett We all know Sherlock Holmes was a ripped, streetfighting kickass-machine. But this new movie also makes him some s","time":1260688258},{"text":"RT:Huge week for movies. Mon - Morgans, Tue - Sherlock Holmes, Wed - Lovely Bones, Thu - Up In The Air,.. http://bit.ly/6xgvgl #holmes","time":1260691028},{"text":"RT:december movie plan..sherlock holmes and sang pemimpi http://myloc.me/2402w http://bit.ly/7vX5Kq #holmes","time":1260691031},{"text":"Anybody think that the sherlock holmes movie looks good? Cuz I sure don\u0027t and that\u0027s from someone who has read doyle.","time":1260691086},{"text":"RT @convision:  !   (Sherlock Holmes) - http://convision.ru/dn","time":1260704075},{"text":"RT:@ShesPerfexted i will! *pulls out magnifying glass \u0026 puts on sherlock holmes hat* http://bit.ly/7dfeI3 #holmes","time":1260693042},{"text":"RT @SupSappel: RT @weretweet: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260700241},{"text":"RT:@fadsey emang sherlock holmes seru apaaaaa? gua gak tertarik masa http://bit.ly/82hZby #holmes","time":1260704038},{"text":"RT:Must get my Sherlock Holmes audiobooks sorted in the correct sequence...lot of iTunes messing to be .. http://bit.ly/4sdlVV #holmes","time":1260704041},{"text":"Sherlock Holmes and Watson: Really loved this joke. Found it on a Weekly magazine. Please do drop in a comment!.. http://bit.ly/8jJzaS","time":1260705158},{"text":"My Most Anticipated Movies -  (2009) Avatar   (2009) Sherlock Holmes    ... http://tumblr.com/xnx4noaik","time":1260705491},{"text":"RT:And treated myself to Sherlock Holmes vs Jack the Ripper pc game i love those kind of games x http://bit.ly/8dbmCh #holmes","time":1260693040},{"text":"RT @SupSappel: RT @janelasky: RT @weretweet: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260695469},{"text":"RT:@Jwxwei i borrowed The Adventures of Sherlock Holmes from my church library... And my name had \u0027pict.. http://bit.ly/6UIxMq #holmes","time":1260696446},{"text":"RT:Hmmm Sherlock Holmes, I\u0027ll probably go see it. Robert Downey Jr in hats. Hello sailor! http://bit.ly/4n37cg #holmes","time":1260696450},{"text":"RT @janelasky: RT @SupSappel: RT @weretweet: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #holmes #UK #film","time":1260700383},{"text":"RT @SupSappel: RT @janelasky: RT @SupSappel: RT @weretweet: via @janelasky: Robert Downey, Jr. crosses the Pond for Sherlock Holmes #ho ...","time":1260700473},{"text":"RT:Pengen nonton Law Abiding Citizen,sm Sherlock Holmes,cm Sherlock keluarny masi minggu depan http://bit.ly/5aeB4v #holmes","time":1260704039}]
